{
  "tools": [
    {
      "id": "vscode",
      "name": "Visual Studio Code",
      "developer": "Microsoft",
      "category": "Code Editor",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2015-04-29",
      "license": "MIT",
      "pricing": ["Free"],
      "description": {
        "de": "Visual Studio Code (VS Code) ist ein kostenloser, quelloffener und plattformübergreifender Code-Editor von Microsoft. Er unterstützt eine Vielzahl von Programmiersprachen und Technologien wie JavaScript, TypeScript, Python, PHP, C++, C#, HTML, CSS und viele mehr. Mit Funktionen wie IntelliSense (intelligente Codevervollständigung), integriertem Debugging, Git- und GitHub-Integration sowie einem leistungsstarken Erweiterungs-Ökosystem lässt sich VS Code flexibel an nahezu jede Entwicklungsumgebung anpassen. Dank integrierter Terminal-, Snippet- und Emmet-Unterstützung sowie Remote-Entwicklungs-Features eignet sich VS Code gleichermaßen für Web-, Cloud-, und Softwareentwicklung. Durch seine hohe Performance, Anpassbarkeit und aktive Community zählt er heute zu den beliebtesten Entwicklungswerkzeugen weltweit.",
        "en": "Visual Studio Code (VS Code) is a free, open-source, and cross-platform code editor developed by Microsoft. It supports a wide range of programming languages and technologies such as JavaScript, TypeScript, Python, PHP, C++, C#, HTML, CSS, and many others. With features like IntelliSense (smart code completion), built-in debugging, Git and GitHub integration, and a powerful extension ecosystem, VS Code can be customized to fit virtually any development workflow. It also includes an integrated terminal, snippet and Emmet support, and remote development capabilities, making it ideal for web, cloud, and software development. Thanks to its performance, flexibility, and active community, VS Code is now one of the most popular development tools in the world."
      },
      "shortDescription": {
        "de": "Kostenloser, quelloffener Code-Editor mit umfangreichen Funktionen",
        "en": "Free, open-source code editor with extensive features"
      },
      "logo": "assets/img/utilities/vscode/logo/vscode.png",
      "screenshots": ["assets/img/utilities/vscode/screenshots/vscode_screenshot.png"],
      "links": {
        "website": "https://code.visualstudio.com/",
        "github": "https://github.com/microsoft/vscode",
        "documentation": "https://code.visualstudio.com/docs"
      },
      "personalUsage": true
    },
    {
      "id": "laragon",
      "name": "Laragon",
      "developer": "Leo Khoa",
      "category": "Web Server Stack",
      "platforms": ["windows"],
      "releaseDate": "2015-02-10",
      "license": "Freeware",
      "pricing": ["Free"],
      "description": {
        "de": "Laragon ist eine schnelle, portable und leistungsstarke lokale Entwicklungsumgebung für PHP, Node.js, Python, Java, Go und mehr. Es wurde speziell für Windows entwickelt und bietet ein leichtgewichtiges, isoliertes und modulares Setup für Webentwicklung. Laragon vereinfacht das Einrichten von Apache, Nginx, MySQL/MariaDB, PHP, Redis und anderen Diensten erheblich. Es ist bekannt für seine hohe Geschwindigkeit, automatische virtuelle Hosts, SSL-Unterstützung mit einem Klick und eine clevere Benutzeroberfläche. Mit Laragon können Entwickler problemlos Entwicklungsumgebungen für Frameworks wie Laravel, Symfony, WordPress, Drupal oder Node.js-Projekte erstellen.",
        "en": "Laragon is a fast, portable, and powerful local development environment for PHP, Node.js, Python, Java, Go, and more. Designed specifically for Windows, it provides a lightweight, isolated, and modular setup for web development. Laragon simplifies the setup of Apache, Nginx, MySQL/MariaDB, PHP, Redis, and other services. It is known for its high speed, automatic virtual hosts, one-click SSL support, and intuitive interface. With Laragon, developers can easily create development environments for frameworks like Laravel, Symfony, WordPress, Drupal, or Node.js projects."
      },
      "shortDescription": {
        "de": "Schnelle, portable lokale Entwicklungsumgebung für PHP, Node.js und mehr",
        "en": "Fast, portable local development environment for PHP, Node.js, and more"
      },
      "logo": "assets/img/utilities/laragon/logo/laragon.png",
      "screenshots": ["assets/img/utilities/laragon/screenshots/laragon_screenshot.png"],
      "links": {
        "website": "https://laragon.org/",
        "documentation": "https://laragon.org/docs.html",
        "downloads": "https://laragon.org/download/"
      },
      "personalUsage": true
    },
    {
      "id": "visualstudio",
      "name": "Visual Studio",
      "developer": "Microsoft",
      "category": "IDE",
      "platforms": ["windows", "macos"],
      "releaseDate": "1997-03-19",
      "license": "Proprietary",
      "pricing": ["Free", "subscription", "trial"],
      "description": {
        "de": "Visual Studio ist eine vollwertige, integrierte Entwicklungsumgebung (IDE) von Microsoft, die eine breite Palette an Programmiersprachen und Technologien unterstützt, darunter C#, C++, Visual Basic, Python, JavaScript, .NET und mehr. Sie bietet umfangreiche Werkzeuge für die Softwareentwicklung, einschließlich fortschrittlicher Debugging- und Diagnosefunktionen, Versionsverwaltung, integrierter Build- und Testumgebungen sowie Cloud-Integration über Azure. Visual Studio ist besonders für die Entwicklung von Windows-, Web-, mobilen und Cloud-Anwendungen optimiert und eignet sich sowohl für Einsteiger als auch für professionelle Teams. Die IDE überzeugt durch ihre Leistungsfähigkeit, nahtlose Integration mit dem .NET-Ökosystem und Unterstützung für moderne Entwicklungs-Workflows.",
        "en": "Visual Studio is a fully featured integrated development environment (IDE) from Microsoft that supports a wide range of programming languages and technologies, including C#, C++, Visual Basic, Python, JavaScript, .NET, and more. It offers comprehensive tools for software development, including advanced debugging and diagnostic capabilities, version control integration, built-in build and testing environments, and seamless cloud integration through Azure. Visual Studio is optimized for developing Windows, web, mobile, and cloud applications, and is suitable for both beginners and professional development teams. The IDE stands out for its powerful features, deep integration with the .NET ecosystem, and support for modern development workflows."
      },
      "shortDescription": {
        "de": "Vollwertige IDE für Windows-, Web- und Cloud-Entwicklung",
        "en": "Fully featured IDE for Windows, web, and cloud development"
      },
      "logo": "assets/img/utilities/visualstudio/logo/visualstudio.png",
      "screenshots": ["assets/img/utilities/visualstudio/screenshots/visualstudio_screenshot.png"],
      "links": {
        "website": "https://visualstudio.microsoft.com/",
        "documentation": "https://learn.microsoft.com/visualstudio/",
        "downloads": "https://visualstudio.microsoft.com/downloads/"
      },
      "personalUsage": false
    },
    {
      "id": "xampp",
      "name": "XAMPP",
      "developer": "Apache Friends",
      "category": "Web Server Stack",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2002-05-22",
      "license": "GPL",
      "pricing": ["Free"],
      "description": {
        "de": "XAMPP ist ein kostenloses, plattformübergreifendes Softwarepaket, das eine vollständige lokale Serverumgebung zur Webentwicklung bereitstellt. Es kombiniert Apache (Webserver), MariaDB (Datenbank), PHP und Perl in einer einfach zu installierenden Distribution. XAMPP ist besonders bei Webentwicklern beliebt, um PHP-basierte Anwendungen wie WordPress, Joomla oder Drupal lokal zu testen und zu entwickeln, bevor sie auf einen Live-Server übertragen werden. Das integrierte Control Panel ermöglicht eine einfache Verwaltung von Diensten wie Apache, MySQL, FileZilla und Mercury Mail. Durch seine Benutzerfreundlichkeit und Flexibilität ist XAMPP ideal für Einsteiger und Profis gleichermaßen geeignet.",
        "en": "XAMPP is a free, cross-platform software package that provides a complete local server environment for web development. It combines Apache (web server), MariaDB (database), PHP, and Perl in an easy-to-install distribution. XAMPP is especially popular among web developers for testing and developing PHP-based applications such as WordPress, Joomla, or Drupal locally before deploying them to a live server. The integrated control panel allows for easy management of services like Apache, MySQL, FileZilla, and Mercury Mail. With its user-friendly design and flexibility, XAMPP is ideal for both beginners and experienced developers."
      },
      "shortDescription": {
        "de": "Kostenloses, plattformübergreifendes Serverpaket für lokale Webentwicklung",
        "en": "Free, cross-platform server package for local web development"
      },
      "logo": "assets/img/utilities/xampp/logo/xampp.png",
      "screenshots": ["assets/img/utilities/xampp/screenshots/xampp_screenshot.png"],
      "links": {
        "website": "https://www.apachefriends.org/",
        "documentation": "https://www.apachefriends.org/docs.html",
        "downloads": "https://www.apachefriends.org/download.html"
      },
      "personalUsage": false
    },
    {
      "id": "projectidx",
      "name": "Project IDX",
      "developer": "Google",
      "category": "IDE",
      "platforms": ["web"],
      "releaseDate": "2023-08-08",
      "license": "EULA",
      "pricing": ["Free"],
      "description": {
        "de": "Project IDX ist eine experimentelle, cloudbasierte Entwicklungsplattform von Google, die darauf abzielt, die Entwicklung von Full-Stack-Web- und Multiplatform-Anwendungen zu vereinfachen. Es bietet eine vorkonfigurierte Umgebung im Browser, die direkt losgelegt werden kann, ohne dass lokale Setups erforderlich sind. IDX unterstützt eine Vielzahl von Frameworks und Sprachen, darunter Flutter, Angular, React, Vue, Next.js, sowie Node.js und Python. Die Plattform integriert KI-gestützte Funktionen für Code-Vervollständigung und Fehlerbehebung. Durch die cloudbasierte Natur können Entwickler von überall aus zusammenarbeiten und ihre Projekte nahtlos über verschiedene Geräte hinweg synchronisieren. Es ist darauf ausgelegt, Prototyping und das Deployment zu beschleunigen und ein reibungsloses End-to-End-Entwicklungserlebnis zu bieten.",
        "en": "Project IDX is an experimental, cloud-based development platform from Google, aiming to simplify the development of full-stack web and multiplatform applications. It offers a pre-configured, browser-based environment that allows developers to get started instantly without the need for local setups. IDX supports a wide range of frameworks and languages, including Flutter, Angular, React, Vue, Next.js, as well as Node.js and Python. The platform integrates AI-powered features for code completion and debugging. Due to its cloud-native nature, developers can collaborate from anywhere and seamlessly synchronize their projects across different devices. It is designed to accelerate prototyping and deployment, providing a smooth end-to-end development experience."
      },
      "shortDescription": {
        "de": "Eine cloudbasierte Entwicklungsplattform von Google für Full-Stack-Anwendungen",
        "en": "A cloud-based development platform from Google for full-stack applications"
      },
      "logo": "assets/img/utilities/project_idx/logo/project_idx.png",
      "screenshots": ["assets/img/utilities/project_idx/screenshots/project_idx_screenshot.png"],
      "links": {
        "website": "https://idx.dev/",
        "blog": "https://developers.googleblog.com/2023/08/introducing-project-idx.html"
      },
      "personalUsage": false
    },
    {
      "id": "notepad++",
      "name": "Notepad++",
      "developer": "Don Ho",
      "category": "Code Editor",
      "platforms": ["windows"],
      "releaseDate": "2003-11-24",
      "license": "GPLv2",
      "pricing": ["Free"],
      "description": {
        "de": "Notepad++ ist ein beliebter, kostenloser und quelloffener Text- und Quellcode-Editor für Windows. Er basiert auf der Scintilla-Komponente und ist in C++ mit reiner Win32 API und STL geschrieben, was eine hohe Ausführungsgeschwindigkeit und geringe Programmgröße gewährleistet. Notepad++ unterstützt Tabbed-Editing, Syntaxhervorhebung für zahlreiche Programmier-, Skript- und Auszeichnungssprachen, Code-Faltung, Auto-Vervollständigung, Suchen/Ersetzen mit regulären Ausdrücken und Makro-Aufzeichnung. Er bietet auch eine Vielzahl von Plugins, die seine Funktionalität erweitern. Aufgrund seiner Effizienz, Anpassbarkeit und Leistungsfähigkeit ist Notepad++ ein unverzichtbares Werkzeug für Entwickler, Systemadministratoren und alle, die regelmäßig mit Textdateien arbeiten.",
        "en": "Notepad++ is a popular, free, and open-source text and source code editor for Windows. It is based on the Scintilla editing component and written in C++ with pure Win32 API and STL, ensuring high execution speed and small program size. Notepad++ supports tabbed editing, syntax highlighting for numerous programming, scripting, and markup languages, code folding, auto-completion, search/replace with regular expressions, and macro recording. It also offers a wide range of plugins that extend its functionality. Due to its efficiency, customizability, and performance, Notepad++ is an indispensable tool for developers, system administrators, and anyone who regularly works with text files."
      },
      "shortDescription": {
        "de": "Ein schneller und flexibler Text- und Quellcode-Editor für Windows",
        "en": "A fast and flexible text and source code editor for Windows"
      },
      "logo": "assets/img/utilities/notepad_plus_plus/logo/notepad_plus_plus.png",
      "screenshots": ["assets/img/utilities/notepad_plus_plus/screenshots/notepad_plus_plus_screenshot.png"],
      "links": {
        "website": "https://notepad-plus-plus.org/",
        "download": "https://notepad-plus-plus.org/downloads/",
        "github": "https://github.com/notepad-plus-plus/notepad-plus-plus"
      },
      "personalUsage": false
    },
    {
      "id": "phpstorm",
      "name": "PHPStorm",
      "developer": "JetBrains",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2009-05-13",
      "license": "EULA",
      "pricing": ["Subscription"],
      "description": {
        "de": "PHPStorm ist eine leistungsstarke und intelligente integrierte Entwicklungsumgebung (IDE) von JetBrains, die speziell für PHP-Entwickler und Webentwicklung konzipiert wurde. Sie bietet umfassende Unterstützung für PHP 5.3 bis zur neuesten Version, HTML, CSS, JavaScript und SQL. Zu den herausragenden Funktionen gehören intelligente Code-Vervollständigung, On-the-fly-Fehlerprüfung, fortschrittliche Debugging-Tools (mit Xdebug und Zend Debugger), Refactoring-Fähigkeiten, integrierte Versionskontrolle (Git, SVN, Mercurial) und eine tiefe Integration mit Build-Tools wie Composer und Frameworks wie Symfony, Laravel, WordPress und Joomla. PHPStorm ist eine plattformübergreifende IDE, die auf Windows, macOS und Linux läuft. Ihre umfassende Feature-Sammlung macht sie zu einem unverzichtbaren Werkzeug für professionelle PHP-Entwickler, die Wert auf Produktivität und Code-Qualität legen.",
        "en": "PHPStorm is a powerful and intelligent integrated development environment (IDE) by JetBrains, specifically designed for PHP developers and web development. It offers comprehensive support for PHP 5.3 through to the latest version, HTML, CSS, JavaScript, and SQL. Key features include intelligent code completion, on-the-fly error checking, advanced debugging tools (with Xdebug and Zend Debugger), refactoring capabilities, integrated version control (Git, SVN, Mercurial), and deep integration with build tools like Composer and frameworks such as Symfony, Laravel, WordPress, and Joomla. PHPStorm is a cross-platform IDE that runs on Windows, macOS, and Linux. Its comprehensive feature set makes it an indispensable tool for professional PHP developers who prioritize productivity and code quality."
      },
      "shortDescription": {
        "de": "Eine intelligente IDE für PHP und Webentwicklung von JetBrains",
        "en": "An intelligent IDE for PHP and web development by JetBrains"
      },
      "logo": "assets/img/utilities/phpstorm/logo/phpstorm.png",
      "screenshots": ["assets/img/utilities/phpstorm/screenshots/phpstorm_screenshot.png"],
      "links": {
        "website": "https://www.jetbrains.com/phpstorm/",
        "documentation": "https://www.jetbrains.com/help/phpstorm/getting-started.html"
      },
      "personalUsage": false
    },
    {
      "id": "webstorm",
      "name": "WebStorm",
      "developer": "JetBrains",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2010-09-13",
      "license": "EULA",
      "pricing": ["Subscription"],
      "description": {
        "de": "WebStorm ist eine leistungsstarke und intelligente integrierte Entwicklungsumgebung (IDE) von JetBrains, die speziell für die moderne JavaScript- und Webentwicklung konzipiert wurde. Sie bietet umfassende Unterstützung für HTML, CSS, JavaScript (einschließlich ES6+), TypeScript, React, Angular, Vue.js, Node.js und viele andere Web-Technologien. Zu den Kernfunktionen gehören intelligente Code-Vervollständigung, On-the-fly-Fehlererkennung, robuste Debugging-Tools, leistungsstarke Refactoring-Optionen, integrierte Versionskontrolle (Git, SVN) und ein umfassendes Ökosystem an Plugins. WebStorm ist eine plattformübergreifende IDE, die auf Windows, macOS und Linux läuft. Sie ist ein unverzichtbares Werkzeug für professionelle Frontend- und Full-Stack-Entwickler, die Wert auf Produktivität, Code-Qualität und eine reibungslose Entwicklungserfahrung legen.",
        "en": "WebStorm is a powerful and intelligent integrated development environment (IDE) by JetBrains, specifically designed for modern JavaScript and web development. It offers comprehensive support for HTML, CSS, JavaScript (including ES6+), TypeScript, React, Angular, Vue.js, Node.js, and many other web technologies. Key features include intelligent code completion, on-the-fly error detection, robust debugging tools, powerful refactoring options, integrated version control (Git, SVN), and a comprehensive ecosystem of plugins. WebStorm is a cross-platform IDE that runs on Windows, macOS, and Linux. It is an indispensable tool for professional frontend and full-stack developers who prioritize productivity, code quality, and a smooth development experience."
      },
      "shortDescription": {
        "de": "Eine intelligente IDE von JetBrains für JavaScript und Webentwicklung",
        "en": "An intelligent IDE from JetBrains for JavaScript and web development"
      },
      "logo": "assets/img/utilities/webstorm/logo/webstorm.png",
      "screenshots": ["assets/img/utilities/webstorm/screenshots/webstorm_screenshot.png"],
      "links": {
        "website": "https://www.jetbrains.com/webstorm/",
        "documentation": "https://www.jetbrains.com/help/webstorm/meet-webstorm.html"
      },
      "personalUsage": false
    },
    {
      "id": "rider",
      "name": "Rider",
      "developer": "JetBrains",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2017-08-09",
      "license": "EULA",
      "pricing": ["Subscription"],
      "description": {
        "de": "JetBrains Rider ist eine schnelle, leistungsstarke und plattformübergreifende .NET IDE, die auf der IntelliJ-Plattform und ReSharper basiert. Sie bietet eine umfassende Entwicklungsumgebung für .NET- und Unity-Entwickler unter Windows, macOS und Linux. Rider unterstützt eine Vielzahl von .NET-Frameworks und -Standards, darunter .NET, .NET Core, ASP.NET, .NET MAUI/Xamarin, Unity, XAML, SQL, JavaScript, TypeScript, HTML, CSS und mehr. Zu den herausragenden Funktionen gehören intelligente Code-Analyse, Fehlererkennung und Quick-Fixes, fortschrittliche Refactoring-Tools, ein integrierter Debugger, Versionskontrollintegration (Git, SVN), Unterstützung für NuGet-Pakete und Datenbanktools. Rider ist bekannt für seine hohe Performance und seinen umfangreichen Funktionsumfang, der die Produktivität bei der Entwicklung von Desktop-, Web-, Mobil- und Gaming-Anwendungen erheblich steigert.",
        "en": "JetBrains Rider is a fast, powerful, and cross-platform .NET IDE built on the IntelliJ platform and ReSharper. It provides a comprehensive development environment for .NET and Unity developers on Windows, macOS, and Linux. Rider supports a wide range of .NET frameworks and standards, including .NET, .NET Core, ASP.NET, .NET MAUI/Xamarin, Unity, XAML, SQL, JavaScript, TypeScript, HTML, CSS, and more. Key features include intelligent code analysis, error detection and quick-fixes, advanced refactoring tools, an integrated debugger, version control integration (Git, SVN), NuGet package support, and database tools. Rider is renowned for its high performance and extensive feature set, significantly boosting productivity for developing desktop, web, mobile, and gaming applications."
      },
      "shortDescription": {
        "de": "Eine schnelle und leistungsstarke .NET IDE für Windows, Mac und Linux",
        "en": "A fast and powerful .NET IDE for Windows, Mac, and Linux"
      },
      "logo": "assets/img/utilities/rider/logo/rider.png",
      "screenshots": ["assets/img/utilities/rider/screenshots/rider_screenshot.png"],
      "links": {
        "website": "https://www.jetbrains.com/rider/",
        "documentation": "https://www.jetbrains.com/help/rider/"
      },
      "personalUsage": false
    },
    {
      "id": "clion",
      "name": "CLion",
      "developer": "JetBrains",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2015-04-14",
      "license": "EULA",
      "pricing": ["Subscription"],
      "description": {
        "de": "JetBrains CLion ist eine leistungsstarke und intelligente integrierte Entwicklungsumgebung (IDE), die speziell für die C- und C++-Entwicklung konzipiert wurde. Sie läuft nativ auf Windows, macOS und Linux und bietet eine Vielzahl von Funktionen, die Entwickler bei der Erstellung robuster und effizienter Anwendungen unterstützen. CLion integriert einen intelligenten Code-Editor, der Kontext-sensitives Code-Vervollständigung, On-the-fly-Code-Analyse und Refactoring-Optionen bietet. Es unterstützt verschiedene Build-Systeme wie CMake, Makefile und Gradle C/C++ und integriert sich nahtlos mit gängigen Debuggern wie GDB und LLDB. Darüber hinaus bietet CLion integrierte Versionskontrolle (Git, SVN, Mercurial), Tools für die Code-Qualitätssicherung, wie statische Analyse, und eine tiefe Integration mit Test-Frameworks. CLion ist ein unverzichtbares Werkzeug für professionelle C/C++-Entwickler, die eine hohe Produktivität und qualitativ hochwertigen Code anstreben.",
        "en": "JetBrains CLion is a powerful and intelligent integrated development environment (IDE) specifically designed for C and C++ development. It runs natively on Windows, macOS, and Linux, offering a wide range of features to help developers build robust and efficient applications. CLion integrates an intelligent code editor that provides context-aware code completion, on-the-fly code analysis, and refactoring options. It supports various build systems like CMake, Makefile, and Gradle C/C++ and integrates seamlessly with popular debuggers such as GDB and LLDB. Furthermore, CLion offers integrated version control (Git, SVN, Mercurial), code quality tools like static analysis, and deep integration with testing frameworks. CLion is an indispensable tool for professional C/C++ developers aiming for high productivity and high-quality code."
      },
      "shortDescription": {
        "de": "Eine intelligente Cross-Plattform-IDE für C und C++ von JetBrains",
        "en": "An intelligent cross-platform IDE for C and C++ by JetBrains"
      },
      "logo": "assets/img/utilities/clion/logo/clion.png",
      "screenshots": ["assets/img/utilities/clion/screenshots/clion_screenshot.png"],
      "links": {
        "website": "https://www.jetbrains.com/clion/",
        "documentation": "https://www.jetbrains.com/help/clion/"
      },
      "personalUsage": false
    },
    {
      "id": "intellijidea",
      "name": "IntelliJ IDEA",
      "developer": "JetBrains",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2001-01-01",
      "license": "EULA",
      "pricing": ["Mixed"],
      "description": {
        "de": "IntelliJ IDEA ist eine leistungsstarke und intelligente integrierte Entwicklungsumgebung (IDE) von JetBrains, die primär für die Java-Entwicklung konzipiert wurde, aber auch eine exzellente Unterstützung für andere JVM-Sprachen wie Kotlin und Scala bietet. Neben JVM-Sprachen unterstützt sie umfassend eine Vielzahl von Web-Technologien, Frameworks und Datenbanken, was sie zu einer vielseitigen IDE für Full-Stack-Entwickler macht. Zu den Kernfunktionen gehören eine tiefgreifende Code-Analyse, intelligente Code-Vervollständigung, fortschrittliche Refactoring-Tools, ein robuster Debugger, integrierte Versionskontrolle (Git, SVN), Unterstützung für Build-Systeme wie Maven und Gradle sowie Tools für die Software-Qualitätssicherung. IntelliJ IDEA ist plattformübergreifend verfügbar (Windows, macOS, Linux) und bietet eine Community Edition, die kostenlos und Open Source ist, sowie eine kostenpflichtige Ultimate Edition mit erweiterten Funktionen für professionelle und Enterprise-Entwicklung. Sie ist bekannt für ihre Benutzerfreundlichkeit, hohe Produktivität und die Fähigkeit, komplexe Entwicklungsprozesse zu vereinfachen.",
        "en": "IntelliJ IDEA is a powerful and intelligent integrated development environment (IDE) by JetBrains, primarily designed for Java development, but also offering excellent support for other JVM languages like Kotlin and Scala. In addition to JVM languages, it extensively supports a wide range of web technologies, frameworks, and databases, making it a versatile IDE for full-stack developers. Key features include deep code analysis, intelligent code completion, advanced refactoring tools, a robust debugger, integrated version control (Git, SVN), support for build systems like Maven and Gradle, and tools for software quality assurance. IntelliJ IDEA is cross-platform (Windows, macOS, Linux) and offers a free and open-source Community Edition, as well as a paid Ultimate Edition with extended features for professional and enterprise development. It is renowned for its usability, high productivity, and ability to simplify complex development processes."
      },
      "shortDescription": {
        "de": "Die führende IDE von JetBrains für Java und JVM-Sprachen, mit umfangreicher Web-Unterstützung",
        "en": "The leading IDE by JetBrains for Java and JVM languages, with extensive web support"
      },
      "logo": "assets/img/utilities/intellij_idea/logo/intellij_idea.png",
      "screenshots": ["assets/img/utilities/intellij_idea/screenshots/intellij_idea_screenshot.png"],
      "links": {
        "website": "https://www.jetbrains.com/idea/",
        "download": "https://www.jetbrains.com/idea/download/",
        "documentation": "https://www.jetbrains.com/help/idea/"
      },
      "personalUsage": false
    },
    {
      "id": "eclipseide",
      "name": "Eclipse IDE",
      "developer": "Eclipse Foundation",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2001-11-07",
      "license": "EPL (Eclipse Public License)",
      "pricing": ["Free"],
      "description": {
        "de": "Eclipse ist eine weit verbreitete, quelloffene integrierte Entwicklungsumgebung (IDE), die von der Eclipse Foundation entwickelt und gepflegt wird. Ursprünglich primär für die Java-Entwicklung bekannt, hat sich Eclipse zu einer vielseitigen Plattform entwickelt, die durch ein umfangreiches Plugin-System Unterstützung für eine Vielzahl von Programmiersprachen wie C/C++, Python, PHP, JavaScript, und viele andere bietet. Die IDE zeichnet sich durch ihre Anpassbarkeit, eine große Community und zahlreiche Funktionen wie intelligenten Code-Editor, Debugging-Tools, Versionskontrollintegration (Git), und Build-Automatisierung aus. Eclipse ist plattformübergreifend verfügbar (Windows, macOS, Linux) und wird von Entwicklern weltweit für die Erstellung von Desktop-, Web- und Enterprise-Anwendungen eingesetzt. Es gibt verschiedene 'Eclipse Packages', die vorkonfigurierte Umgebungen für spezifische Entwicklungsaufgaben bieten.",
        "en": "Eclipse is a widely used, open-source integrated development environment (IDE) developed and maintained by the Eclipse Foundation. Originally primarily known for Java development, Eclipse has evolved into a versatile platform that offers support for a wide range of programming languages such as C/C++, Python, PHP, JavaScript, and many others through an extensive plugin system. The IDE is characterized by its adaptability, a large community, and numerous features including an intelligent code editor, debugging tools, version control integration (Git), and build automation. Eclipse is cross-platform (Windows, macOS, Linux) and is used by developers worldwide for creating desktop, web, and enterprise applications. Various 'Eclipse Packages' provide pre-configured environments for specific development tasks."
      },
      "shortDescription": {
        "de": "Eine vielseitige Open-Source-IDE für verschiedene Programmiersprachen",
        "en": "A versatile open-source IDE for various programming languages"
      },
      "logo": "assets/img/utilities/eclipse/logo/eclipse.png",
      "screenshots": ["assets/img/utilities/eclipse/screenshots/eclipse_screenshot.png"],
      "links": {
        "website": "https://www.eclipse.org/",
        "download": "https://www.eclipse.org/downloads/",
        "documentation": "https://help.eclipse.org/"
      },
      "personalUsage": false
    },
    {
      "id": "netbeans",
      "name": "NetBeans",
      "developer": "Apache Software Foundation",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2000-06-21",
      "license": "Apache License 2.0",
      "pricing": ["Free"],
      "description": {
        "de": "Apache NetBeans ist eine kostenlose und quelloffene integrierte Entwicklungsumgebung (IDE), die von der Apache Software Foundation entwickelt und gepflegt wird. Ursprünglich von Sun Microsystems entwickelt, ist NetBeans besonders für die Java-Entwicklung bekannt, bietet aber auch starke Unterstützung für andere Sprachen wie PHP, HTML5/JavaScript, C/C++ und Groovy. Die IDE verfügt über einen leistungsstarken Code-Editor mit intelligentem Code-Vervollständigung, Refactoring-Funktionen und On-the-fly-Fehlerprüfung. Zu den weiteren Merkmalen gehören integrierte Debugging-Tools, Versionskontrollintegration (Git, SVN), ein GUI-Builder (Swing) und umfangreiche Projektmanagement-Fähigkeiten. NetBeans ist plattformübergreifend verfügbar (Windows, macOS, Linux) und eine beliebte Wahl für Entwickler, die robuste Anwendungen in verschiedenen Sprachen und für verschiedene Plattformen erstellen möchten.",
        "en": "Apache NetBeans is a free and open-source integrated development environment (IDE) developed and maintained by the Apache Software Foundation. Originally created by Sun Microsystems, NetBeans is particularly well-known for Java development, but also offers strong support for other languages like PHP, HTML5/JavaScript, C/C++, and Groovy. The IDE features a powerful code editor with intelligent code completion, refactoring capabilities, and on-the-fly error checking. Other features include integrated debugging tools, version control integration (Git, SVN), a GUI builder (Swing), and extensive project management capabilities. NetBeans is cross-platform (Windows, macOS, Linux) and a popular choice for developers looking to build robust applications in various languages and for different platforms."
      },
      "shortDescription": {
        "de": "Eine kostenlose und quelloffene IDE für Java, PHP, HTML5 und mehr",
        "en": "A free and open-source IDE for Java, PHP, HTML5, and more"
      },
      "logo": "assets/img/utilities/netbeans/logo/netbeans.png",
      "screenshots": ["assets/img/utilities/netbeans/screenshots/netbeans_screenshot.png"],
      "links": {
        "website": "https://netbeans.apache.org/",
        "download": "https://netbeans.apache.org/download/",
        "documentation": "https://netbeans.apache.org/kb/"
      },
      "personalUsage": false
    },
    {
      "id": "androidstudio",
      "name": "Android Studio",
      "developer": "Google",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2013-05-15",
      "license": "Apache License 2.0 / Freeware",
      "pricing": ["Free"],
      "description": {
        "de": "Android Studio ist die offizielle integrierte Entwicklungsumgebung (IDE) von Google für die Entwicklung von Android-Anwendungen. Basierend auf JetBrains' IntelliJ IDEA, bietet es eine umfassende Suite von Tools, die speziell auf die Anforderungen der Android-Plattform zugeschnitten sind. Dazu gehören ein leistungsstarker Code-Editor mit intelligentem Code-Vervollständigung, Debugging-Tools, visuelle Layout-Editoren für UI-Design, ein Emulator für verschiedene Android-Geräte, und eine nahtlose Integration mit Gradle für das Build-Management. Android Studio unterstützt Java, Kotlin und C++ für die App-Entwicklung. Es bietet außerdem Tools für Performance-Profiling, APK-Analyse und die Verwaltung von Abhängigkeiten. Die IDE wird kontinuierlich von Google weiterentwickelt und ist das Standardwerkzeug für professionelle Android-Entwickler weltweit, um qualitativ hochwertige und leistungsstarke Apps für das Android-Ökosystem zu erstellen.",
        "en": "Android Studio is Google's official integrated development environment (IDE) for building Android applications. Built on JetBrains' IntelliJ IDEA, it provides a comprehensive suite of tools specifically tailored to the demands of the Android platform. These include a powerful code editor with intelligent code completion, debugging tools, visual layout editors for UI design, an emulator for various Android devices, and seamless integration with Gradle for build management. Android Studio supports Java, Kotlin, and C++ for app development. It also offers tools for performance profiling, APK analysis, and dependency management. The IDE is continuously developed by Google and is the standard tool for professional Android developers worldwide to create high-quality and high-performance apps for the Android ecosystem."
      },
      "shortDescription": {
        "de": "Die offizielle IDE von Google für die Android-App-Entwicklung",
        "en": "Google's official IDE for Android app development"
      },
      "logo": "assets/img/utilities/android_studio/logo/android_studio.png",
      "screenshots": ["assets/img/utilities/android_studio/screenshots/android_studio_screenshot.png"],
      "links": {
        "website": "https://developer.android.com/studio",
        "download": "https://developer.android.com/studio#downloads",
        "documentation": "https://developer.android.com/studio/intro"
      },
      "personalUsage": false
    },
    {
      "id": "arduinoide",
      "name": "Arduino IDE",
      "developer": "Arduino",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2005-03-24",
      "license": "GPL / LGPL",
      "pricing": ["Free"],
      "description": {
        "de": "Die Arduino IDE (Integrated Development Environment) ist die offizielle Software, die für die Programmierung von Arduino-kompatiblen Boards verwendet wird. Sie ist eine Open-Source-Plattform, die auf Java basiert und eine einfache und benutzerfreundliche Umgebung für Anfänger und Fortgeschrittene bietet, um Mikrocontroller-Projekte zu entwickeln. Die IDE enthält einen Code-Editor mit Syntaxhervorhebung, eine einfache Oberfläche zum Kompilieren und Hochladen von Sketchen (Programmen) auf die Boards, sowie eine serielle Monitorfunktion zur Kommunikation mit dem Board. Sie unterstützt die Programmiersprache Wiring, die eine vereinfachte Form von C/C++ ist, was den Einstieg in die Embedded-Programmierung erleichtert. Die Arduino IDE ist plattformübergreifend für Windows, macOS und Linux verfügbar und wird von einer großen und aktiven Community unterstützt, die zahlreiche Bibliotheken und Beispiel-Sketche bereitstellt.",
        "en": "The Arduino IDE (Integrated Development Environment) is the official software used for programming Arduino-compatible boards. It is an open-source platform based on Java, providing a simple and user-friendly environment for beginners and experienced users alike to develop microcontroller projects. The IDE includes a code editor with syntax highlighting, a straightforward interface for compiling and uploading sketches (programs) to the boards, and a serial monitor function for communicating with the board. It supports the Wiring language, which is a simplified form of C/C++, making it easier to get started with embedded programming. The Arduino IDE is cross-platform, available for Windows, macOS, and Linux, and is supported by a large and active community that provides numerous libraries and example sketches."
      },
      "shortDescription": {
        "de": "Die offizielle Open-Source-IDE für die Programmierung von Arduino-Boards",
        "en": "The official open-source IDE for programming Arduino boards"
      },
      "logo": "assets/img/utilities/arduino_ide/logo/arduino_ide.png",
      "screenshots": ["assets/img/utilities/arduino_ide/screenshots/arduino_ide_screenshot.png"],
      "links": {
        "website": "https://www.arduino.cc/en/software",
        "download": "https://www.arduino.cc/en/software",
        "documentation": "https://docs.arduino.cc/"
      },
      "personalUsage": false
    },
    {
      "id": "xcode",
      "name": "Xcode",
      "developer": "Apple Inc.",
      "category": "IDE",
      "platforms": ["macos"],
      "releaseDate": "2003-10-24",
      "license": "Proprietär",
      "pricing": ["Free"],
      "description": {
        "de": "Xcode ist die integrierte Entwicklungsumgebung (IDE) von Apple, die speziell für die Entwicklung von Anwendungen für macOS, iOS, iPadOS, watchOS und tvOS konzipiert wurde. Sie bietet eine umfassende Suite von Tools für den gesamten Entwicklungszyklus, von der Codierung und dem Debugging bis hin zum Design der Benutzeroberfläche und dem App-Deployment. Xcode integriert einen leistungsstarken Code-Editor, den Interface Builder für visuelles UI-Design, einen fortschrittlichen Debugger, Asset-Management und ein vollständiges Set von Apple SDKs. Es unterstützt die Programmiersprachen Swift und Objective-C und bietet nahtlose Integration mit den Apple Developer Programmen und dem App Store Connect. Xcode ist ein unverzichtbares Werkzeug für alle Entwickler, die native Anwendungen für das Apple-Ökosystem erstellen möchten.",
        "en": "Xcode is Apple's integrated development environment (IDE) specifically designed for developing applications across macOS, iOS, iPadOS, watchOS, and tvOS. It provides a comprehensive suite of tools for the entire development lifecycle, from coding and debugging to UI design and app deployment. Xcode integrates a powerful code editor, Interface Builder for visual UI design, an advanced debugger, asset management, and a complete set of Apple SDKs. It supports Swift and Objective-C programming languages and offers seamless integration with Apple Developer Programs and App Store Connect. Xcode is an indispensable tool for all developers looking to create native applications for the Apple ecosystem."
      },
      "shortDescription": {
        "de": "Die offizielle IDE von Apple für die Entwicklung von Apps für Apple-Plattformen",
        "en": "Apple's official IDE for developing apps across Apple platforms"
      },
      "logo": "assets/img/utilities/xcode/logo/xcode.png",
      "screenshots": ["assets/img/utilities/xcode/screenshots/xcode_screenshot.png"],
      "links": {
        "website": "https://developer.apple.com/xcode/",
        "download": "https://developer.apple.com/xcode/resources/",
        "documentation": "https://developer.apple.com/documentation/xcode/"
      },
      "personalUsage": false
    },
    {
      "id": "pycharm",
      "name": "PyCharm",
      "developer": "JetBrains",
      "category": "IDE",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2011-02-01",
      "license": "EULA",
      "pricing": ["Mixed"],
      "description": {
        "de": "JetBrains PyCharm ist eine leistungsstarke und intelligente integrierte Entwicklungsumgebung (IDE), die speziell für die Python-Entwicklung konzipiert wurde. Sie bietet eine umfassende Suite von Tools für die gesamte Bandbreite der Python-Entwicklung, von Web-Anwendungen (mit Frameworks wie Django, Flask, Pyramid) über Data Science bis hin zur Systemadministration. PyCharm ist plattformübergreifend verfügbar (Windows, macOS, Linux) und bietet zwei Haupteditionen: die kostenlose und quelloffene Community Edition und die kostenpflichtige Professional Edition. Zu den Kernfunktionen gehören intelligente Code-Vervollständigung, On-the-fly-Fehlerprüfung, leistungsstarke Debugging-Tools, Refactoring-Funktionen, integrierte Versionskontrolle (Git, SVN) und die Unterstützung für wissenschaftliche Tools wie Jupyter Notebooks. PyCharm ist ein unverzichtbares Werkzeug für professionelle Python-Entwickler, die Wert auf Produktivität, Code-Qualität und eine reibungslose Entwicklungserfahrung legen.",
        "en": "JetBrains PyCharm is a powerful and intelligent integrated development environment (IDE) specifically designed for Python development. It offers a comprehensive suite of tools for the entire spectrum of Python development, from web applications (with frameworks like Django, Flask, Pyramid) to data science and system administration. PyCharm is cross-platform (Windows, macOS, Linux) and offers two main editions: the free and open-source Community Edition and the paid Professional Edition. Key features include intelligent code completion, on-the-fly error checking, powerful debugging tools, refactoring capabilities, integrated version control (Git, SVN), and support for scientific tools like Jupyter Notebooks. PyCharm is an indispensable tool for professional Python developers who prioritize productivity, code quality, and a smooth development experience."
      },
      "shortDescription": {
        "de": "Eine intelligente IDE von JetBrains für Python-Entwicklung",
        "en": "An intelligent IDE by JetBrains for Python development"
      },
      "logo": "assets/img/utilities/pycharm/logo/pycharm.png",
      "screenshots": ["assets/img/utilities/pycharm/screenshots/pycharm_screenshot.png"],
      "links": {
        "website": "https://www.jetbrains.com/pycharm/",
        "download": "https://www.jetbrains.com/pycharm/download/",
        "documentation": "https://www.jetbrains.com/help/pycharm/"
      },
      "personalUsage": false
    },
    {
      "id": "nodejs",
      "name": "Node.js",
      "developer": "OpenJS Foundation (ursprünglich Ryan Dahl)",
      "category": "Runtime Environment",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2009-05-27",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Node.js ist eine quelloffene, plattformübergreifende JavaScript-Laufzeitumgebung, die es Entwicklern ermöglicht, JavaScript-Code außerhalb eines Webbrowsers auszuführen. Sie basiert auf der V8 JavaScript-Engine von Google Chrome und ist bekannt für ihre ereignisgesteuerte, nicht-blockierende E/A-Architektur, die sie ideal für den Aufbau skalierbarer Netzwerk-Anwendungen wie Webserver, APIs und Echtzeit-Anwendungen macht. Node.js verfügt über ein riesiges Ökosystem an Bibliotheken und Frameworks, die über den Node Package Manager (npm) verfügbar sind, was die Entwicklung beschleunigt. Es wird häufig für Backend-Dienste, Microservices, Kommandozeilen-Tools und Desktop-Anwendungen (mit Frameworks wie Electron) eingesetzt. Die aktive Community und die ständige Weiterentwicklung machen Node.js zu einem fundamentalen Bestandteil der modernen Webentwicklung.",
        "en": "Node.js is an open-source, cross-platform JavaScript runtime environment that allows developers to execute JavaScript code outside of a web browser. Built on Google Chrome's V8 JavaScript engine, it is known for its event-driven, non-blocking I/O architecture, making it ideal for building scalable network applications such as web servers, APIs, and real-time applications. Node.js boasts a vast ecosystem of libraries and frameworks available via the Node Package Manager (npm), which accelerates development. It is widely used for backend services, microservices, command-line tools, and desktop applications (with frameworks like Electron). Its active community and continuous development make Node.js a fundamental component of modern web development."
      },
      "shortDescription": {
        "de": "Eine Open-Source JavaScript-Laufzeitumgebung für serverseitige und Netzwerk-Anwendungen",
        "en": "An open-source JavaScript runtime environment for server-side and networking applications"
      },
      "logo": "assets/img/utilities/nodejs/logo/nodejs.png",
      "screenshots": [],
      "links": {
        "website": "https://nodejs.org/",
        "documentation": "https://nodejs.org/docs/",
        "github": "https://github.com/nodejs/node"
      },
      "personalUsage": true
    },
    {
      "id": "npmnodepackagemanager",
      "name": "npm (Node Package Manager)",
      "developer": "npm Inc. (jetzt Teil von GitHub/Microsoft)",
      "category": "Package Manager",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2010-01-12",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "npm (Node Package Manager) ist der Standard-Paketmanager für die JavaScript-Laufzeitumgebung Node.js und die weltweit größte Software-Registry. Es besteht aus einer Kommandozeilen-Client-Anwendung (CLI) und einer Online-Datenbank (der npm-Registry) mit öffentlichen und privaten Paketen, die über eine Milliarde Downloads pro Woche verzeichnen. npm ermöglicht Entwicklern, Node.js-Pakete und -Module einfach zu installieren, zu teilen und zu verwalten. Es wird umfassend in der gesamten JavaScript-Entwicklung (Frontend und Backend) eingesetzt, um Abhängigkeiten zu handhaben, Projekte zu initialisieren, Skripte auszuführen und die Zusammenarbeit in Teams zu erleichtern. Obwohl es primär mit Node.js assoziiert wird, nutzen auch Frontend-Projekte npm, um Bibliotheken wie React, Angular oder Vue.js zu verwalten. npm ist ein unverzichtbares Werkzeug im modernen JavaScript-Ökosystem.",
        "en": "npm (Node Package Manager) is the standard package manager for the JavaScript runtime environment Node.js and the world's largest software registry. It consists of a command-line interface (CLI) client and an online database (the npm registry) of public and private packages, boasting over a billion downloads per week. npm allows developers to easily install, share, and manage Node.js packages and modules. It is widely used across all JavaScript development (frontend and backend) to handle dependencies, initialize projects, run scripts, and facilitate team collaboration. Although primarily associated with Node.js, frontend projects also leverage npm to manage libraries like React, Angular, or Vue.js. npm is an indispensable tool in the modern JavaScript ecosystem."
      },
      "shortDescription": {
        "de": "Der Standard-Paketmanager für Node.js und die weltweit größte Software-Registry",
        "en": "The standard package manager for Node.js and the world's largest software registry"
      },
      "logo": "assets/img/utilities/npm/logo/npm.png",
      "screenshots": [],
      "links": {
        "website": "https://www.npmjs.com/",
        "documentation": "https://docs.npmjs.com/",
        "github": "https://github.com/npm/cli"
      },
      "personalUsage": false
    },
    {
      "id": "python",
      "name": "Python",
      "developer": "Python Software Foundation (ursprünglich Guido van Rossum)",
      "category": "Programming Language",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "1991-02-20",
      "license": "Python Software Foundation License (PSF)",
      "pricing": ["Free"],
      "description": {
        "de": "Python ist eine interpretierte, objektorientierte und hochrangige Programmiersprache mit dynamischer Semantik, die besonders für ihre einfache, leicht lesbare Syntax bekannt ist. Sie wurde mit dem Ziel entworfen, die Lesbarkeit von Code zu verbessern und ist einsteigerfreundlich, was sie zu einer beliebten Wahl für Anfänger und Experten gleichermaßen macht. Python wird in einer Vielzahl von Anwendungsbereichen eingesetzt, darunter Webentwicklung (mit Frameworks wie Django und Flask), Datenwissenschaft und maschinelles Lernen (mit Bibliotheken wie NumPy, Pandas, TensorFlow), Automatisierung, Skripterstellung, wissenschaftliches Rechnen und Desktop-Anwendungen. Die Sprache verfügt über eine große und aktive Community sowie ein riesiges Ökosystem an Bibliotheken und Frameworks, die über den Paketmanager pip zugänglich sind. Python ist plattformübergreifend verfügbar (Windows, macOS, Linux) und wird ständig weiterentwickelt, um den Anforderungen moderner Softwareentwicklung gerecht zu werden.",
        "en": "Python is an interpreted, object-oriented, high-level programming language with dynamic semantics, particularly known for its simple, easy-to-read syntax. It was designed with the goal of enhancing code readability and is beginner-friendly, making it a popular choice for novices and experts alike. Python is used in a wide range of applications, including web development (with frameworks like Django and Flask), data science and machine learning (with libraries like NumPy, Pandas, TensorFlow), automation, scripting, scientific computing, and desktop applications. The language has a large and active community, as well as a vast ecosystem of libraries and frameworks accessible via the pip package manager. Python is cross-platform (Windows, macOS, Linux) and is continuously evolving to meet the demands of modern software development."
      },
      "shortDescription": {
        "de": "Eine vielseitige, interpretierte Programmiersprache für Webentwicklung, Datenanalyse und mehr",
        "en": "A versatile, interpreted programming language for web development, data analysis, and more"
      },
      "logo": "assets/img/utilities/python/logo/python.png",
      "screenshots": [],
      "links": {
        "website": "https://www.python.org/",
        "download": "https://www.python.org/downloads/",
        "documentation": "https://docs.python.org/",
        "github": "https://github.com/python/cpython"
      },
      "personalUsage": true
    },
    {
      "id": "java",
      "name": "Java",
      "developer": "Oracle Corporation (ursprünglich Sun Microsystems)",
      "category": "Programming Language",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "1995-05-23",
      "license": "GPLv2 (OpenJDK) / Oracle Technology Network License Agreement for Oracle Java SE",
      "pricing": ["Mixed"],
      "description": {
        "de": "Java ist eine vielseitige, objektorientierte Programmiersprache und Computing-Plattform, die 1995 von Sun Microsystems (jetzt Oracle) eingeführt wurde. Sie ist bekannt für ihr Prinzip 'Write Once, Run Anywhere' (WORA), was bedeutet, dass kompilierter Java-Code (Bytecode) auf jeder Plattform mit einer Java Virtual Machine (JVM) ausgeführt werden kann, unabhängig von der zugrunde liegenden Hardware. Java wird umfassend in der Entwicklung von Enterprise-Anwendungen, Android-Apps, Webanwendungen (Backend), Big Data, IoT-Geräten und vielem mehr eingesetzt. Die Sprache zeichnet sich durch ihre Robustheit, Skalierbarkeit, Sicherheit und eine riesige, aktive Community aus. Trotz der Änderungen im Lizenzmodell für kommerzielle Nutzung bleibt Java eine der wichtigsten und am weitesten verbreiteten Programmiersprachen weltweit.",
        "en": "Java is a versatile, object-oriented programming language and computing platform, introduced by Sun Microsystems (now Oracle) in 1995. It is renowned for its 'Write Once, Run Anywhere' (WORA) principle, meaning compiled Java code (bytecode) can run on any platform with a Java Virtual Machine (JVM), regardless of the underlying hardware. Java is extensively used in the development of enterprise applications, Android apps, web applications (backend), big data, IoT devices, and much more. The language is characterized by its robustness, scalability, security, and a massive, active community. Despite changes in its licensing model for commercial use, Java remains one of the most important and widely used programming languages globally."
      },
      "shortDescription": {
        "de": "Eine der weltweit beliebtesten objektorientierten Programmiersprachen und Plattformen",
        "en": "One of the world's most popular object-oriented programming languages and platforms"
      },
      "logo": "assets/img/utilities/java/logo/java.png",
      "screenshots": [],
      "links": {
        "website": "https://www.java.com/",
        "download": "https://www.java.com/download/manual.jsp",
        "documentation": "https://docs.oracle.com/en/java/"
      },
      "personalUsage": false
    },
    {
      "id": "tailwindcss",
      "name": "Tailwind CSS",
      "developer": "Adam Wathan, Steve Schoger (Tailwind Labs)",
      "category": "CSS Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2017-10-27",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Tailwind CSS ist ein Utility-First CSS-Framework, das Entwicklern eine riesige Sammlung von vorkonfigurierten CSS-Klassen bietet, um Benutzeroberflächen direkt in ihrem HTML-Markup zu erstellen. Im Gegensatz zu traditionellen CSS-Frameworks, die vorgefertigte Komponenten (wie Buttons oder Navigationsleisten) liefern, stellt Tailwind CSS atomare Utility-Klassen für jeden CSS-Eigenschaft zur Verfügung (z.B. `flex`, `pt-4`, `text-center`, `bg-blue-500`). Dies ermöglicht eine hohe Flexibilität und die Erstellung einzigartiger Designs ohne das Überschreiben von Standard-Styles oder das Schreiben von benutzerdefiniertem CSS. Es integriert sich nahtlos in moderne JavaScript-Frameworks und Build-Tools. Die PostCSS-Plugin-Architektur ermöglicht die Optimierung der finalen CSS-Datei, indem nur die tatsächlich verwendeten Klassen inkludiert werden. Tailwind CSS ist ideal für schnelle Prototypen, maßgeschneiderte Designs und für Teams, die eine konsistente Designsprache ohne den Overhead von Design-Systemen oder die Komplexität von manuellem CSS bevorzugen.",
        "en": "Tailwind CSS is a utility-first CSS framework that provides developers with a vast collection of pre-configured CSS classes to build user interfaces directly within their HTML markup. Unlike traditional CSS frameworks that offer pre-built components (like buttons or navigation bars), Tailwind CSS provides atomic utility classes for every CSS property (e.g., `flex`, `pt-4`, `text-center`, `bg-blue-500`). This allows for high flexibility and the creation of unique designs without overriding default styles or writing custom CSS. It integrates seamlessly with modern JavaScript frameworks and build tools. Its PostCSS plugin architecture enables optimization of the final CSS file by including only the classes actually used. Tailwind CSS is ideal for rapid prototyping, custom designs, and for teams preferring a consistent design language without the overhead of design systems or the complexity of manual CSS."
      },
      "shortDescription": {
        "de": "Ein Utility-First CSS-Framework für schnelles und flexibles UI-Design",
        "en": "A utility-first CSS framework for rapid and flexible UI development"
      },
      "logo": "assets/img/utilities/tailwindcss/logo/tailwindcss.png",
      "screenshots": [],
      "links": {
        "website": "https://tailwindcss.com/",
        "documentation": "https://tailwindcss.com/docs",
        "github": "https://github.com/tailwindlabs/tailwindcss"
      },
      "personalUsage": false
    },
    {
      "id": "bootstrap",
      "name": "Bootstrap",
      "developer": "Mark Otto, Jacob Thornton (und Community)",
      "category": "CSS Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2011-08-19",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Bootstrap ist ein kostenloses und quelloffenes CSS-Framework, das ursprünglich von Twitter entwickelt wurde und sich seitdem zum weltweit beliebtesten Framework für die Entwicklung responsiver, mobiler und projektsicherer Webseiten und Anwendungen entwickelt hat. Es bietet eine umfassende Sammlung von HTML-, CSS- und JavaScript-basierten Designvorlagen für Typografie, Formulare, Schaltflächen, Navigation, Modal-Fenster, Karussells und viele andere Benutzeroberflächenkomponenten. Bootstrap basiert auf einem responsiven Raster-System, das es Entwicklern ermöglicht, Layouts zu erstellen, die sich automatisch an verschiedene Bildschirmgrößen anpassen – von Smartphones über Tablets bis hin zu Desktop-Computern. Es beschleunigt den Entwicklungsprozess erheblich, indem es vorgefertigte, konsistente und zugängliche Komponenten zur Verfügung stellt und eine breite Palette von Browsern unterstützt. Bootstrap wird ständig weiterentwickelt und ist ein Eckpfeiler vieler moderner Webprojekte.",
        "en": "Bootstrap is a free and open-source CSS framework originally developed by Twitter, which has since become the world's most popular framework for building responsive, mobile-first websites and applications. It provides a comprehensive collection of HTML, CSS, and JavaScript-based design templates for typography, forms, buttons, navigation, modals, carousels, and many other user interface components. Bootstrap is built on a responsive grid system that allows developers to create layouts that automatically adapt to various screen sizes – from smartphones to tablets to desktop computers. It significantly accelerates the development process by providing ready-to-use, consistent, and accessible components, and supports a wide range of browsers. Bootstrap is continuously evolving and is a cornerstone of many modern web projects."
      },
      "shortDescription": {
        "de": "Das beliebteste Open-Source CSS-Framework für responsives und mobiles Frontend-Design",
        "en": "The most popular open-source CSS framework for responsive and mobile-first frontend development"
      },
      "logo": "assets/img/utilities/bootstrap/logo/bootstrap.png",
      "screenshots": [],
      "links": {
        "website": "https://getbootstrap.com/",
        "documentation": "https://getbootstrap.com/docs/5.3/",
        "github": "https://github.com/twbs/bootstrap"
      },
      "personalUsage": true
    },
    {
      "id": "emulatorjs",
      "name": "EmulatorJS",
      "developer": "EmulatorJS Project (Community)",
      "category": "JavaScript Library",
      "platforms": ["docker", "framework-Library"],
      "releaseDate": "Unknown (ongoing development)",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "EmulatorJS ist ein quelloffenes, JavaScript-basiertes Projekt, das es ermöglicht, Videospiele von Retro-Konsolen direkt im Webbrowser zu emulieren. Es umfasst eine Sammlung verschiedener Emulatoren (wie z.B. NES, SNES, Sega Genesis, Game Boy, N64) und ein Framework, um diese in Webseiten einzubetten. Ziel ist es, klassische Spiele ohne Installation zusätzlicher Software oder Plugins spielbar zu machen. EmulatorJS wird häufig in Online-Archiven von Retro-Spielen oder persönlichen Projekten eingesetzt, um Browser-basierte Gaming-Erlebnisse zu schaffen. Es nutzt Technologien wie WebAssembly für performante Emulation und ist darauf ausgelegt, einfach in bestehende Webprojekte integriert zu werden. Die Entwicklung ist community-getrieben und kontinuierlich, um Kompatibilität und Leistung zu verbessern.",
        "en": "EmulatorJS is an open-source, JavaScript-based project that enables the emulation of retro console video games directly within a web browser. It comprises a collection of various emulators (such as NES, SNES, Sega Genesis, Game Boy, N64) and a framework to embed them into webpages. The goal is to make classic games playable without installing additional software or plugins. EmulatorJS is often used in online archives of retro games or personal projects to create browser-based gaming experiences. It leverages technologies like WebAssembly for performant emulation and is designed to be easily integrated into existing web projects. Its development is community-driven and continuous, aiming to improve compatibility and performance."
      },
      "shortDescription": {
        "de": "Ein JavaScript-basierter Emulator für Retro-Konsolen, direkt im Webbrowser",
        "en": "A JavaScript-based emulator for retro consoles, playable directly in the web browser"
      },
      "logo": "assets/img/utilities/emulatorjs/logo/emulatorjs.png",
      "screenshots": [],
      "links": {
        "website": "https://emulatorjs.org/",
        "github": "https://github.com/EmulatorJS"
      },
      "personalUsage": true
    },
    {
      "id": "framework7",
      "name": "Framework7",
      "developer": "Vladimir Kharlampidi",
      "category": "UI Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2014-04-10",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Framework7 ist ein kostenloses und quelloffenes Mobile-HTML-Framework, das darauf ausgelegt ist, das 'native' Erscheinungsbild und die Leistung von iOS- und Android-Apps in Hybrid- oder Web-Apps nachzubilden. Es ist keine vollwertige mobile UI-Framework wie React Native oder Flutter, sondern eher ein Satz von HTML-, CSS- und JavaScript-Komponenten, die die UI/UX von nativen Mobil-Apps imitieren. Entwickler können Framework7 mit ihren bevorzugten Frameworks wie React, Vue.js oder Svelte kombinieren, um komplexe mobile Web-Apps zu erstellen, die sich wie native Apps anfühlen. Es bietet eine reiche Bibliothek an Widgets und Komponenten, wie Navigationselemente, Formulare, Listenansichten und Popups, die alle auf die jeweiligen nativen Designrichtlinien zugeschnitten sind. Framework7 ist ideal für schnelle Prototypen und die Entwicklung von Apps, die im Browser oder als Cordova/Capacitor-Apps bereitgestellt werden sollen.",
        "en": "Framework7 is a free and open-source mobile HTML framework designed to replicate the native look and performance of iOS and Android apps within hybrid or web apps. It's not a full-fledged mobile UI framework like React Native or Flutter, but rather a set of HTML, CSS, and JavaScript components that mimic the UI/UX of native mobile apps. Developers can combine Framework7 with their preferred frameworks like React, Vue.js, or Svelte to build complex mobile web apps that feel like native apps. It offers a rich library of widgets and components, such as navigation elements, forms, list views, and popups, all tailored to the respective native design guidelines. Framework7 is ideal for rapid prototyping and developing apps intended for browser deployment or as Cordova/Capacitor apps."
      },
      "shortDescription": {
        "de": "Ein kostenloses Open-Source-Framework zum Erstellen von Hybrid-Mobil-Apps mit nativer iOS- & Android-Optik",
        "en": "A free and open-source framework for building hybrid mobile apps with native iOS & Android look"
      },
      "logo": "assets/img/utilities/framework7/logo/framework7.png",
      "screenshots": [],
      "links": {
        "website": "https://framework7.io/",
        "documentation": "https://framework7.io/docs/",
        "github": "https://github.com/framework7io/Framework7"
      },
      "personalUsage": false
    },
    {
      "id": "onsenui",
      "name": "Onsen UI",
      "developer": "Monaca (Asial Corporation)",
      "category": "UI Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2014-06-13",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Onsen UI ist ein kostenloses und quelloffenes UI-Framework, das darauf spezialisiert ist, mobile Web- und Hybrid-Apps mit einem nativen Look and Feel zu entwickeln. Es bietet eine umfassende Sammlung von schönen und responsiven UI-Komponenten, die sich automatisch an die Plattform anpassen (iOS-Stil auf iPhones, Material Design auf Android-Geräten). Onsen UI ist framework-agnostisch und kann mit beliebten JavaScript-Frameworks wie Angular, React, Vue.js oder Svelte verwendet werden, aber auch als eigenständige Bibliothek. Die Performance ist optimiert, um eine flüssige Benutzererfahrung zu gewährleisten. Es wird häufig in Verbindung mit Cordova oder Capacitor verwendet, um Web-Anwendungen in native mobile Apps zu verpacken. Onsen UI ist eine ausgezeichnete Wahl für Entwickler, die schnell plattformübergreifende Apps mit einer konsistenten und nativen Benutzeroberfläche erstellen möchten, ohne sich um die spezifischen UI-Richtlinien jeder Plattform kümmern zu müssen.",
        "en": "Onsen UI is a free and open-source UI framework specializing in developing mobile web and hybrid applications with a native look and feel. It offers a comprehensive collection of beautiful and responsive UI components that automatically adapt to the platform (iOS style on iPhones, Material Design on Android devices). Onsen UI is framework-agnostic and can be used with popular JavaScript frameworks like Angular, React, Vue.js, or Svelte, or as a standalone library. Its performance is optimized to ensure a smooth user experience. It is often used in conjunction with Cordova or Capacitor to package web applications into native mobile apps. Onsen UI is an excellent choice for developers looking to quickly create cross-platform apps with a consistent and native user interface without having to worry about each platform's specific UI guidelines."
      },
      "shortDescription": {
        "de": "Ein Open-Source-Framework zum Erstellen von Hybrid- und Web-Apps mit nativen UI-Komponenten",
        "en": "An open-source framework for building hybrid and web apps with native-looking UI components"
      },
      "logo": "assets/img/utilities/onsen_ui/logo/onsen_ui.png",
      "screenshots": [],
      "links": {
        "website": "https://onsen.io/",
        "documentation": "https://onsen.io/v2/guide/",
        "github": "https://github.com/OnsenUI/OnsenUI"
      },
      "personalUsage": false
    },
    {
      "id": "django",
      "name": "Django",
      "developer": "Django Software Foundation (DSF)",
      "category": "Web Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2005-07-21",
      "license": "BSD 3-Clause License",
      "pricing": ["Free"],
      "description": {
        "de": "Django ist ein kostenloses und quelloffenes, hochrangiges Python Web-Framework, das eine schnelle Entwicklung von sicheren und wartbaren Websites ermöglichen soll. Es folgt dem 'Don't Repeat Yourself' (DRY)-Prinzip und dem 'Convention over Configuration'-Paradigma, um Entwicklern zu helfen, effizienter zu arbeiten. Django wird mit vielen Funktionen 'batteries-included' geliefert, darunter ein Objektrelationaler Mapper (ORM), ein Admin-Panel, URL-Routing, ein Template-System und ein Formular-Handling-System. Es ist bekannt für seine Robustheit, Skalierbarkeit und Sicherheit und wird von einer großen und aktiven Community unterstützt. Django ist ideal für die Entwicklung komplexer, datenbankgestützter Webanwendungen wie soziale Netzwerke, Content-Management-Systeme und E-Commerce-Plattformen.",
        "en": "Django is a free and open-source, high-level Python web framework designed to enable rapid development of secure and maintainable websites. It follows the 'Don't Repeat Yourself' (DRY) principle and the 'Convention over Configuration' paradigm to help developers work more efficiently. Django comes with many 'batteries-included' features, including an object-relational mapper (ORM), an admin panel, URL routing, a templating system, and a form-handling system. It's known for its robustness, scalability, and security, and is supported by a large and active community. Django is ideal for building complex, database-driven web applications such as social networks, content management systems, and e-commerce platforms."
      },
      "shortDescription": {
        "de": "Ein hochrangiges Python Web-Framework für schnelle und sichere Webentwicklung",
        "en": "A high-level Python web framework for rapid and secure web development"
      },
      "logo": "assets/img/utilities/django/logo/django.png",
      "screenshots": [],
      "links": {
        "website": "https://www.djangoproject.com/",
        "documentation": "https://docs.djangoproject.com/",
        "github": "https://github.com/django/django"
      },
      "personalUsage": false
    },
    {
      "id": "flask",
      "name": "Flask",
      "developer": "Pallets (ursprünglich Armin Ronacher)",
      "category": "Web Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2010-04-01",
      "license": "BSD 3-Clause License",
      "pricing": ["Free"],
      "description": {
        "de": "Flask ist ein beliebtes, leichtgewichtiges Python Web-Microframework, das sich durch seine Einfachheit und Flexibilität auszeichnet. Im Gegensatz zu 'Full-Stack'-Frameworks wie Django bietet Flask einen minimalistischeren Ansatz, der Entwicklern mehr Freiheit bei der Auswahl von Datenbanken, ORMs und anderen Komponenten lässt. Es ist ideal für kleinere Projekte, APIs, Prototypen und Webanwendungen, bei denen nicht der gesamte Funktionsumfang eines größeren Frameworks benötigt wird. Flask basiert auf der Werkzeug WSGI-Utility-Bibliothek und der Jinja2 Template-Engine. Zu seinen Kernmerkmalen gehören ein integrierter Entwicklungsserver und Debugger, Unterstützung für Unit-Tests und eine einfache, intuitive API. Flask wird von einer aktiven Community unterstützt und ist eine hervorragende Wahl für Entwickler, die schnell Webanwendungen mit Python erstellen möchten, ohne sich an starre Konventionen halten zu müssen.",
        "en": "Flask is a popular, lightweight Python web microframework known for its simplicity and flexibility. Unlike 'full-stack' frameworks like Django, Flask offers a more minimalist approach, giving developers greater freedom in choosing databases, ORMs, and other components. It is ideal for smaller projects, APIs, prototypes, and web applications where the full feature set of a larger framework isn't required. Flask is built upon the Werkzeug WSGI utility library and the Jinja2 templating engine. Its core features include a built-in development server and debugger, support for unit testing, and a simple, intuitive API. Flask is supported by an active community and is an excellent choice for developers looking to quickly build web applications with Python without being tied to rigid conventions."
      },
      "shortDescription": {
        "de": "Ein leichtgewichtiges Python-Microframework für schnelle Webentwicklung",
        "en": "A lightweight Python microframework for rapid web development"
      },
      "logo": "assets/img/utilities/flask/logo/flask.png",
      "screenshots": [],
      "links": {
        "website": "https://flask.palletsprojects.com/",
        "documentation": "https://flask.palletsprojects.com/en/latest/tutorial/",
        "github": "https://github.com/pallets/flask"
      },
      "personalUsage": false
    },
    {
      "id": "expressjs",
      "name": "Express.js",
      "developer": "OpenJS Foundation (ursprünglich TJ Holowaychuk)",
      "category": "Web Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2010-04-10",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Express.js, oft einfach als Express bezeichnet, ist ein kostenloses und quelloffenes Webanwendungs-Framework für Node.js. Es ist die De-facto-Standardlösung für die Entwicklung von Backend-Anwendungen und APIs mit Node.js und bildet die 'B' in der MERN- und MEAN-Stack-Architektur. Express.js bietet eine robuste Sammlung von Funktionen für Web- und Mobilanwendungen. Es ist bekannt für seinen minimalistischen und unaufdringlichen Ansatz, der Entwicklern die Freiheit gibt, die von ihnen bevorzugten Komponenten und Datenbanken zu wählen. Zu den Kernmerkmalen gehören Middleware-Unterstützung für Request-Handling, ein Routing-System, Templating-Engine-Unterstützung und grundlegende Fehlerbehandlung. Express.js ist hochgradig erweiterbar durch ein riesiges Ökosystem von npm-Modulen und wird von einer großen und aktiven Community unterstützt. Es ist ideal für den Bau von RESTful APIs, Single-Page-Anwendungen (SPAs) und Echtzeit-Anwendungen.",
        "en": "Express.js, often simply referred to as Express, is a free and open-source web application framework for Node.js. It is the de facto standard solution for building backend applications and APIs with Node.js, forming the 'B' in the MERN and MEAN stack architectures. Express.js provides a robust set of features for web and mobile applications. It is known for its minimalist and unopinionated approach, giving developers the freedom to choose their preferred components and databases. Core features include middleware support for request handling, a routing system, templating engine support, and basic error handling. Express.js is highly extensible through a vast ecosystem of npm modules and is supported by a large and active community. It is ideal for building RESTful APIs, single-page applications (SPAs), and real-time applications."
      },
      "shortDescription": {
        "de": "Ein schnelles, minimalistisches Web-Framework für Node.js",
        "en": "A fast, minimalist web framework for Node.js"
      },
      "logo": "assets/img/utilities/expressjs/logo/expressjs.png",
      "screenshots": [],
      "links": {
        "website": "https://expressjs.com/",
        "documentation": "https://expressjs.com/en/starter/installing.html",
        "github": "https://github.com/expressjs/express"
      },
      "personalUsage": false
    },
    {
      "id": "vuejs",
      "name": "Vue.js",
      "developer": "Evan You (und Vue Core Team)",
      "category": "JavaScript Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2014-02-01",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Vue.js ist ein Open-Source JavaScript-Framework zum Erstellen von Benutzeroberflächen und Single-Page-Anwendungen. Es ist bekannt für seine leichte Erlernbarkeit, hohe Leistung und Flexibilität. Im Gegensatz zu 'Monolithic Frameworks' wurde Vue.js von Grund auf progressiv gestaltet, was bedeutet, dass es inkrementell adaptierbar ist. Es kann als Bibliothek für einfache interaktive UI-Komponenten verwendet werden oder als vollwertiges Framework für komplexe Single-Page-Anwendungen. Vue.js bietet eine reaktive Datenbindung, eine komponentenbasiertes Architektur und eine sehr gut lesbare Template-Syntax. Die offizielle Tooling-Unterstützung, wie Vue CLI und Vite, erleichtert die Entwicklung. Vue.js wird von einer wachsenden Community unterstützt und ist eine beliebte Wahl für Frontend-Entwickler, die eine unaufdringliche, aber leistungsstarke Lösung für die UI-Entwicklung suchen.",
        "en": "Vue.js is an open-source JavaScript framework for building user interfaces and single-page applications. It's known for its ease of learning, high performance, and flexibility. Unlike 'monolithic frameworks,' Vue.js is designed from the ground up to be progressively adoptable. It can be used as a library for simple interactive UI components or as a full-fledged framework for complex single-page applications. Vue.js features reactive data binding, a component-based architecture, and a highly readable template syntax. Official tooling support, such as Vue CLI and Vite, simplifies development. Vue.js is supported by a growing community and is a popular choice for frontend developers looking for an unobtrusive yet powerful solution for UI development."
      },
      "shortDescription": {
        "de": "Ein progressives JavaScript-Framework für reaktive Benutzeroberflächen",
        "en": "A progressive JavaScript framework for building reactive user interfaces"
      },
      "logo": "assets/img/utilities/vuejs/logo/vuejs.png",
      "screenshots": [],
      "links": {
        "website": "https://vuejs.org/",
        "documentation": "https://vuejs.org/guide/introduction.html",
        "github": "https://github.com/vuejs/core"
      },
      "personalUsage": false
    },
    {
      "id": "angular",
      "name": "Angular",
      "developer": "Google",
      "category": "JavaScript Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2016-09-14",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Angular ist ein leistungsstarkes und umfassendes Open-Source-Frontend-Framework, das von Google entwickelt wurde, um dynamische Single-Page-Anwendungen (SPAs) zu erstellen. Es ist in TypeScript geschrieben und bietet eine robuste Struktur für große und komplexe Unternehmensanwendungen. Angular zeichnet sich durch seine komponentenbasierten Architektur, bidirektionale Datenbindung und ein vollständiges Set an Tools und Bibliotheken ('batteries-included') aus, darunter ein Router, ein Formular-Modul und ein HTTP-Client. Es fördert eine modulare und wartbare Codebasis und bietet Funktionen wie Dependency Injection, RxJS für reaktive Programmierung und eine starke CLI (Command Line Interface) für die Projektgenerierung und -verwaltung. Angular ist eine ausgezeichnete Wahl für Entwickler, die eine strukturierte und skalierbare Lösung für die Entwicklung komplexer Webanwendungen suchen, die auf allen Plattformen (Web, Mobil, Desktop) funktionieren.",
        "en": "Angular is a powerful and comprehensive open-source frontend framework developed by Google for building dynamic single-page applications (SPAs). Written in TypeScript, it provides a robust structure for large and complex enterprise-level applications. Angular is characterized by its component-based architecture, two-way data binding, and a complete set of 'batteries-included' tools and libraries, including a router, a forms module, and an HTTP client. It promotes a modular and maintainable codebase and offers features like dependency injection, RxJS for reactive programming, and a powerful CLI (Command Line Interface) for project generation and management. Angular is an excellent choice for developers seeking a structured and scalable solution for building complex web applications that work across all platforms (web, mobile, desktop)."
      },
      "shortDescription": {
        "de": "Ein plattformübergreifendes TypeScript-Framework für die Entwicklung von Single-Page-Anwendungen",
        "en": "A cross-platform TypeScript framework for building single-page applications"
      },
      "logo": "assets/img/utilities/angular/logo/angular.png",
      "screenshots": [],
      "links": {
        "website": "https://angular.dev/",
        "documentation": "https://angular.dev/guide/what-is-angular",
        "github": "https://github.com/angular/angular"
      },
      "personalUsage": false
    },
    {
      "id": "react",
      "name": "React",
      "developer": "Meta (früher Facebook)",
      "category": "JavaScript Library",
      "platforms": ["framework-Library"],
      "releaseDate": "2013-05-29",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "React (oft auch React.js oder ReactJS genannt) ist eine deklarative, effiziente und flexible Open-Source-JavaScript-Bibliothek zum Erstellen von Benutzeroberflächen (UIs) und Single-Page-Anwendungen. Ursprünglich von Facebook (jetzt Meta) entwickelt, konzentriert sich React auf die 'View'-Schicht von Web- und Mobilanwendungen. Sein Kernkonzept ist die komponentenbasierten Entwicklung, bei der UI-Elemente in wiederverwendbare, isolierte Komponenten unterteilt werden. React verwendet ein virtuelles DOM, um die Performance zu optimieren, indem es nur die notwendigen Änderungen im tatsächlichen DOM rendert. Es ist nicht streng ein Framework, sondern eine Bibliothek, die Entwicklern die Freiheit lässt, andere Bibliotheken für Routing, State Management oder API-Interaktionen zu wählen. Die Kombination mit Tools wie Vite oder Next.js ermöglicht die Entwicklung robuster, skalierbarer Anwendungen. React wird von einer riesigen Community unterstützt und ist eine der beliebtesten Technologien für moderne Frontend-Entwicklung.",
        "en": "React (often referred to as React.js or ReactJS) is a declarative, efficient, and flexible open-source JavaScript library for building user interfaces (UIs) and single-page applications. Originally developed by Facebook (now Meta), React focuses on the 'view' layer of web and mobile applications. Its core concept is component-based development, where UI elements are broken down into reusable, isolated components. React uses a virtual DOM to optimize performance by rendering only the necessary changes to the actual DOM. It's not strictly a framework, but a library, giving developers the freedom to choose other libraries for routing, state management, or API interactions. Combining it with tools like Vite or Next.js enables the development of robust, scalable applications. React is supported by a massive community and is one of the most popular technologies for modern frontend development."
      },
      "shortDescription": {
        "de": "Eine JavaScript-Bibliothek zum Erstellen von Benutzeroberflächen",
        "en": "A JavaScript library for building user interfaces"
      },
      "logo": "assets/img/utilities/react/logo/react.png",
      "screenshots": [],
      "links": {
        "website": "https://react.dev/",
        "documentation": "https://react.dev/learn",
        "github": "https://github.com/facebook/react"
      },
      "personalUsage": false
    },
    {
      "id": "nextjs",
      "name": "Next.js",
      "developer": "Vercel",
      "category": "React Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2016-10-25",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Next.js ist ein Open-Source React-Framework, das von Vercel entwickelt wurde und das Erstellen von produktionsreifen React-Anwendungen vereinfacht. Es erweitert die Fähigkeiten von React durch integrierte Funktionen wie Server-Side Rendering (SSR), Static Site Generation (SSG), inkrementelle statische Regeneration (ISR), API-Routen, Dateisystem-basiertes Routing und CSS-Modul-Unterstützung. Diese Funktionen ermöglichen die Entwicklung von hochperformanten und SEO-freundlichen Webseiten und Single-Page-Anwendungen, ohne dass komplexe Konfigurationen erforderlich sind. Next.js ist besonders beliebt für kommerzielle Websites, E-Commerce-Plattformen und Marketingseiten, da es von Haus aus für Performance und SEO optimiert ist. Es wird von einer großen und aktiven Community unterstützt und ist ein zentraler Bestandteil vieler moderner Full-Stack-JavaScript-Projekte.",
        "en": "Next.js is an open-source React framework developed by Vercel that simplifies building production-ready React applications. It extends React's capabilities with built-in features like Server-Side Rendering (SSR), Static Site Generation (SSG), Incremental Static Regeneration (ISR), API routes, file-system based routing, and CSS module support. These features enable the development of high-performance and SEO-friendly websites and single-page applications without requiring complex configurations. Next.js is particularly popular for commercial websites, e-commerce platforms, and marketing sites, as it's optimized for performance and SEO out of the box. It is supported by a large and active community and is a core component of many modern full-stack JavaScript projects."
      },
      "shortDescription": {
        "de": "Ein React-Framework für produktive und skalierbare Webanwendungen mit Server-Side Rendering (SSR) und Static Site Generation (SSG)",
        "en": "A React framework for productive and scalable web applications with Server-Side Rendering (SSR) and Static Site Generation (SSG)"
      },
      "logo": "assets/img/utilities/nextjs/logo/nextjs.png",
      "screenshots": [],
      "links": {
        "website": "https://nextjs.org/",
        "documentation": "https://nextjs.org/docs",
        "github": "https://github.com/vercel/next.js"
      },
      "personalUsage": false
    },
    {
      "id": "threejs",
      "name": "Three.js",
      "developer": "Ricardo Cabello (mrdoob) und Contributoren",
      "category": "JavaScript Library",
      "platforms": ["framework-Library"],
      "releaseDate": "2010-04-24",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Three.js ist eine kostenlose und quelloffene JavaScript-Bibliothek, die das Erstellen und Anzeigen von animierten 3D-Computergrafiken in einem Webbrowser erleichtert. Es verwendet WebGL, eine Web-Grafik-API, um GPU-beschleunigte 3D-Grafiken ohne Plugins zu rendern. Three.js bietet eine hohe Abstraktionsebene über die komplexen WebGL-APIs, wodurch Entwickler 3D-Szenen, Objekte, Kameras, Lichter und Materialien mit vergleichsweise einfachem Code erstellen können. Es wird häufig für interaktive 3D-Modelle, Produktkonfiguratoren, Spiele, Datenvisualisierungen und immersive Web-Erlebnisse eingesetzt. Die Bibliothek bietet eine umfangreiche Sammlung von Beispielen, eine aktive Community und ist hochgradig erweiterbar. Three.js ist ein essenzielles Werkzeug für jeden, der Rich-Media-3D-Inhalte direkt im Browser bereitstellen möchte.",
        "en": "Three.js is a free and open-source JavaScript library that simplifies the creation and display of animated 3D computer graphics in a web browser. It leverages WebGL, a web graphics API, to render GPU-accelerated 3D graphics without the need for plugins. Three.js provides a high level of abstraction over the complex WebGL APIs, allowing developers to create 3D scenes, objects, cameras, lights, and materials with relatively simple code. It is widely used for interactive 3D models, product configurators, games, data visualizations, and immersive web experiences. The library offers an extensive collection of examples, an active community, and is highly extensible. Three.js is an essential tool for anyone looking to deliver rich 3D content directly in the browser."
      },
      "shortDescription": {
        "de": "Eine JavaScript 3D-Bibliothek für WebGL, die 3D-Grafiken im Browser ermöglicht",
        "en": "A JavaScript 3D library for WebGL, enabling 3D graphics in the browser"
      },
      "logo": "assets/img/utilities/threejs/logo/threejs.png",
      "screenshots": [],
      "links": {
        "website": "https://threejs.org/",
        "documentation": "https://threejs.org/docs/",
        "github": "https://github.com/mrdoob/three.js/"
      },
      "personalUsage": false
    },
    {
      "id": "rubyonrails",
      "name": "Ruby on Rails",
      "developer": "David Heinemeier Hansson (DHH) und Core Team",
      "category": "Web Framework",
      "platforms": ["framework-Library"],
      "releaseDate": "2004-12-13",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Ruby on Rails, oft einfach Rails genannt, ist ein Open-Source Webanwendungs-Framework, das in der Programmiersprache Ruby geschrieben ist. Es folgt dem 'Model-View-Controller' (MVC)-Architekturmuster und legt großen Wert auf die Prinzipien 'Convention over Configuration' (CoC) und 'Don't Repeat Yourself' (DRY). Dies bedeutet, dass Rails viele Standardeinstellungen und -strukturen bereitstellt, wodurch Entwickler weniger Code schreiben und sich stärker auf die Geschäftslogik konzentrieren können. Rails bietet eine umfassende 'Batteries-Included'-Lösung für die Webentwicklung, inklusive eines ORM (Active Record), Routing, eines Template-Systems (ERB), Asset Pipeline und vielem mehr. Es ist bekannt für seine Produktivität, seine Entwicklerfreundlichkeit und die Fähigkeit, komplexe Webanwendungen schnell zu prototypen und zu skalieren. Trotz seines Alters bleibt Rails eine beliebte Wahl für Startups und Unternehmen, die robuste, datenbankgestützte Webanwendungen entwickeln.",
        "en": "Ruby on Rails, often simply called Rails, is an open-source web application framework written in the Ruby programming language. It follows the 'Model-View-Controller' (MVC) architectural pattern and places great emphasis on the 'Convention over Configuration' (CoC) and 'Don't Repeat Yourself' (DRY) principles. This means Rails provides many default settings and structures, allowing developers to write less code and focus more on business logic. Rails offers a comprehensive 'batteries-included' solution for web development, including an ORM (Active Record), routing, a templating system (ERB), asset pipeline, and much more. It is known for its productivity, developer-friendliness, and the ability to quickly prototype and scale complex web applications. Despite its age, Rails remains a popular choice for startups and companies building robust, database-driven web applications."
      },
      "shortDescription": {
        "de": "Ein Webanwendungs-Framework, das die Entwicklung mit dem 'Konvention vor Konfiguration'-Prinzip beschleunigt",
        "en": "A web application framework that accelerates development with 'convention over configuration'"
      },
      "logo": "assets/img/utilities/rubyonrails/logo/rubyonrails.png",
      "screenshots": [],
      "links": {
        "website": "https://rubyonrails.org/",
        "documentation": "https://guides.rubyonrails.org/",
        "github": "https://github.com/rails/rails"
      },
      "personalUsage": false
    },
    {
      "id": "chartjs",
      "name": "Chart.js",
      "developer": "Nick Moore und Contributoren (Open Source Community)",
      "category": "JavaScript Library",
      "platforms": ["framework-Library"],
      "releaseDate": "2013-03-01",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Chart.js ist eine kostenlose und quelloffene JavaScript-Bibliothek, die es Entwicklern ermöglicht, beeindruckende und responsive Diagramme direkt in Webseiten zu integrieren. Sie nutzt das HTML5-`<canvas>`-Element, um verschiedene Diagrammtypen wie Balken-, Linien-, Kuchen-, Polar-, Blasen- und Streudiagramme zu zeichnen. Die Bibliothek ist bekannt für ihre Einfachheit in der Nutzung und die gute Performance, selbst bei großen Datensätzen. Chart.js bietet eine breite Palette an Anpassungsoptionen, Animationen und Interaktivitäten (z.B. Tooltips bei Hover). Es ist leichtgewichtig und erfordert keine externen Abhängigkeiten (außer dem Browser selbst). Die aktive Community und die umfangreiche Dokumentation machen Chart.js zu einer ausgezeichneten Wahl für die Datenvisualisierung in Webanwendungen, Dashboards und Berichten, wo eine flexible und visuell ansprechende Darstellung von Daten erforderlich ist.",
        "en": "Chart.js is a free and open-source JavaScript library that enables developers to integrate impressive and responsive charts directly into web pages. It leverages the HTML5 `<canvas>` element to draw various chart types, including bar, line, pie, polar, bubble, and scatter charts. The library is known for its ease of use and good performance, even with large datasets. Chart.js offers a wide range of customization options, animations, and interactivity (e.g., tooltips on hover). It is lightweight and requires no external dependencies (other than the browser itself). Its active community and extensive documentation make Chart.js an excellent choice for data visualization in web applications, dashboards, and reports where flexible and visually appealing data representation is needed."
      },
      "shortDescription": {
        "de": "Eine Open-Source JavaScript-Bibliothek für einfache und flexible Diagramme auf HTML5 Canvas",
        "en": "An open-source JavaScript library for simple and flexible charts on HTML5 Canvas"
      },
      "logo": "assets/img/utilities/chartjs/logo/chartjs.png",
      "screenshots": [],
      "links": {
        "website": "https://www.chartjs.org/",
        "documentation": "https://www.chartjs.org/docs/latest/",
        "github": "https://github.com/chartjs/Chart.js"
      },
      "personalUsage": false
    },
    {
      "id": "sequelize",
      "name": "Sequelize",
      "developer": "Sequelize Community (ursprünglich Sascha Zarhuber)",
      "category": "ORM",
      "platforms": ["web"],
      "releaseDate": "2010-10-16",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Sequelize ist ein leistungsstarkes und versprechensbasiertes Node.js Object-Relational Mapper (ORM), das eine einfache Interaktion mit relationalen Datenbanken wie PostgreSQL, MySQL, MariaDB, SQLite und MSSQL ermöglicht. Es transformiert Datenbanktabellen in JavaScript-Objekte (Modelle) und erleichtert Operationen wie das Erstellen, Lesen, Aktualisieren und Löschen (CRUD) von Daten, ohne dass rohe SQL-Abfragen geschrieben werden müssen. Sequelize bietet eine robuste Reihe von Funktionen, darunter Transaktionsunterstützung, Eager- und Lazy-Loading, Datenvalidierung, Migrationsverwaltung und Synchronisierung der Datenbank. Es ist eine ausgezeichnete Wahl für Entwickler, die in Node.js mit relationalen Datenbanken arbeiten und eine abstraktere, typsichere und wartbarere Methode der Datenbankinteraktion bevorzugen. Die aktive Community und die umfangreiche Dokumentation machen es zu einem Standardwerkzeug im Node.js-Ökosystem.",
        "en": "Sequelize is a powerful and promise-based Node.js Object-Relational Mapper (ORM) that facilitates easy interaction with relational databases such as PostgreSQL, MySQL, MariaDB, SQLite, and MSSQL. It transforms database tables into JavaScript objects (models) and simplifies operations like creating, reading, updating, and deleting (CRUD) data without the need to write raw SQL queries. Sequelize offers a robust set of features, including transaction support, eager and lazy loading, data validation, migration management, and database synchronization. It is an excellent choice for developers working with relational databases in Node.js who prefer a more abstract, type-safe, and maintainable method of database interaction. Its active community and extensive documentation make it a standard tool in the Node.js ecosystem."
      },
      "shortDescription": {
        "de": "Ein versprechensbasiertes Node.js ORM für relationale Datenbanken",
        "en": "A promise-based Node.js ORM for relational databases"
      },
      "logo": "assets/img/utilities/sequelize/logo/sequelize.png",
      "screenshots": [],
      "links": {
        "website": "https://sequelize.org/",
        "documentation": "https://sequelize.org/docs/v6/getting-started/",
        "github": "https://github.com/sequelize/sequelize"
      },
      "personalUsage": false
    },
    {
      "id": "axios",
      "name": "Axios",
      "developer": "Matt Zabriskie und Axios Community",
      "category": "HTTP Client",
      "platforms": ["web"],
      "releaseDate": "2014-06-25",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Axios ist ein beliebter, versprechensbasierten HTTP-Client für den Browser und Node.js. Er ermöglicht Entwicklern das Senden von HTTP-Anfragen (GET, POST, PUT, DELETE etc.) an Server oder APIs auf eine einfache und effiziente Weise. Axios zeichnet sich durch seine benutzerfreundliche API, die Unterstützung für Interceptoren (für Anfragen und Antworten), die automatische Transformation von JSON-Daten, die Möglichkeit zum Abbrechen von Anfragen und robustes Fehler-Handling aus. Er kann sowohl auf der Client-Seite (im Browser) als auch auf der Server-Seite (mit Node.js) verwendet werden, was ihn zu einer vielseitigen Wahl für die Entwicklung von Full-Stack-Anwendungen macht. Axios ist weit verbreitet in der JavaScript-Community und wird oft als Alternative zur Fetch API verwendet, insbesondere wegen seiner besseren Browser-Kompatibilität und erweiterten Funktionen.",
        "en": "Axios is a popular, promise-based HTTP client for the browser and Node.js. It allows developers to send HTTP requests (GET, POST, PUT, DELETE, etc.) to servers or APIs in a simple and efficient manner. Axios stands out for its user-friendly API, support for interceptors (for requests and responses), automatic JSON data transformation, the ability to cancel requests, and robust error handling. It can be used on both the client-side (in the browser) and the server-side (with Node.js), making it a versatile choice for full-stack application development. Axios is widely adopted in the JavaScript community and is often used as an alternative to the native Fetch API, especially due to its better browser compatibility and extended features."
      },
      "shortDescription": {
        "de": "Ein versprechensbasierten HTTP-Client für Browser und Node.js",
        "en": "A promise-based HTTP client for the browser and Node.js"
      },
      "logo": "assets/img/utilities/axios/logo/axios.png",
      "screenshots": [],
      "links": {
        "website": "https://axios-http.com/",
        "documentation": "https://axios-http.com/docs/intro",
        "github": "https://github.com/axios/axios"
      },
      "personalUsage": true
    },
    {
      "id": "git",
      "name": "Git",
      "developer": "Linus Torvalds und Git Community",
      "category": "Version Control System",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2005-04-07",
      "license": "GNU GPLv2",
      "pricing": ["Free"],
      "description": {
        "de": "Git ist das am weitesten verbreitete moderne verteiltes Versionskontrollsystem (DVCS). Es wurde 2005 von Linus Torvalds, dem Schöpfer des Linux-Kernels, entwickelt und ist heute das Standardwerkzeug für die Quellcodeverwaltung in der Softwareentwicklung. Git ermöglicht es Entwicklern, Änderungen an Dateien und Projekten zu verfolgen, verschiedene Versionen zu verwalten, zusammenzuarbeiten und Änderungen reibungslos zusammenzuführen. Im Gegensatz zu zentralisierten Systemen hat jeder Entwickler eine vollständige Kopie des Repositorys, was die Arbeit offline ermöglicht und die Geschwindigkeit erhöht. Git ist extrem flexibel, leistungsstark und bietet Branching- und Merging-Funktionen, die die parallele Entwicklung und Experimente erleichtern. Es ist die Grundlage für beliebte Hosting-Dienste wie GitHub, GitLab und Bitbucket und ein unverzichtbares Werkzeug für jedes Entwicklerteam, das effizient und kollaborativ arbeiten möchte.",
        "en": "Git is the most widely used modern distributed version control system (DVCS). Developed in 2005 by Linus Torvalds, the creator of the Linux kernel, it is now the standard tool for source code management in software development. Git allows developers to track changes to files and projects, manage different versions, collaborate, and merge changes smoothly. Unlike centralized systems, each developer has a complete copy of the repository, enabling offline work and increasing speed. Git is extremely flexible, powerful, and offers branching and merging capabilities that facilitate parallel development and experimentation. It is the foundation for popular hosting services like GitHub, GitLab, and Bitbucket and an indispensable tool for any development team aiming to work efficiently and collaboratively."
      },
      "shortDescription": {
        "de": "Ein verteiltes Versionskontrollsystem zur Verwaltung von Quellcode",
        "en": "A distributed version control system for managing source code"
      },
      "logo": "assets/img/utilities/git/logo/git.png",
      "screenshots": [],
      "links": {
        "website": "https://git-scm.com/",
        "download": "https://git-scm.com/downloads",
        "documentation": "https://git-scm.com/doc",
        "github": "https://github.com/git/git"
      },
      "personalUsage": true
    },
    {
      "id": "github",
      "name": "GitHub",
      "developer": "Microsoft (ursprünglich GitHub, Inc.)",
      "category": "Version Control Hosting",
      "platforms": ["web"],
      "releaseDate": "2008-04-10",
      "license": "Proprietär (mit kostenlosen und kostenpflichtigen Plänen)",
      "pricing": ["Freemium"],
      "description": {
        "de": "GitHub ist eine webbasierte Hosting-Plattform für die Versionskontrolle von Softwareentwicklungsprojekten mit Git. Es wurde 2008 gegründet und ist seit 2018 Teil von Microsoft. GitHub bietet nicht nur Speicherplatz für Git-Repositories, sondern auch eine Vielzahl von Funktionen für die kollaborative Entwicklung, darunter Issue-Tracking, Pull Requests, Code-Reviews, Projektmanagement-Tools (z.B. GitHub Projects) und Continuous Integration/Continuous Delivery (CI/CD) mit GitHub Actions. Es ist die Anlaufstelle für Millionen von Entwicklern und Unternehmen, um Open-Source-Projekte zu hosten, an privaten Projekten zusammenzuarbeiten und Code zu entdecken. GitHub hat sich als zentraler Knotenpunkt der globalen Softwareentwickler-Community etabliert und spielt eine entscheidende Rolle bei der Förderung von Open-Source und Teamarbeit.",
        "en": "GitHub is a web-based hosting platform for version control of software development projects using Git. Founded in 2008 and acquired by Microsoft in 2018, GitHub not only provides storage for Git repositories but also offers a wide array of features for collaborative development. These include issue tracking, pull requests, code reviews, project management tools (e.g., GitHub Projects), and Continuous Integration/Continuous Delivery (CI/CD) with GitHub Actions. It is the go-to place for millions of developers and companies to host open-source projects, collaborate on private ones, and discover code. GitHub has established itself as a central hub for the global software development community and plays a crucial role in fostering open source and teamwork."
      },
      "shortDescription": {
        "de": "Die weltweit größte Plattform für Softwareentwicklung und Versionskontrolle mit Git",
        "en": "The world's largest platform for software development and version control using Git"
      },
      "logo": "assets/img/utilities/github/logo/github.png",
      "screenshots": [],
      "links": {
        "website": "https://github.com/",
        "documentation": "https://docs.github.com/en"
      },
      "personalUsage": true
    },
    {
      "id": "bitbucket",
      "name": "Bitbucket",
      "developer": "Atlassian",
      "category": "Version Control Hosting",
      "platforms": ["web"],
      "releaseDate": "2008-10-02",
      "license": "Proprietär (mit kostenlosen und kostenpflichtigen Plänen)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Bitbucket ist eine webbasierte Versionskontroll- und Code-Management-Plattform, die von Atlassian entwickelt wurde. Sie bietet Hosting für Projekte, die sowohl Git als auch Mercurial nutzen, und unterscheidet sich von anderen Anbietern durch ihren anfänglichen Fokus auf unbegrenzte private Repositories für kleine Teams. Bitbucket ist eng in das Atlassian-Ökosystem integriert und bietet nahtlose Verbindungen zu Tools wie Jira (Projekt- und Issue-Tracking), Confluence (Dokumentation) und Trello (Kanban-Boards). Zu den Kernfunktionen gehören Code-Reviews mit Pull Requests, Inline-Kommentierung, Branch-Verwaltung, CI/CD-Pipelines (Bitbucket Pipelines), sowie detaillierte Zugriffsrechte und Sicherheitsfunktionen. Es ist eine bevorzugte Wahl für Unternehmen und Teams, die eine private, integrierte und skalierbare Lösung für ihre Softwareentwicklung suchen.",
        "en": "Bitbucket is a web-based version control and code management platform developed by Atlassian. It offers hosting for projects using both Git and Mercurial, distinguishing itself from other providers by its initial focus on unlimited private repositories for small teams. Bitbucket is tightly integrated into the Atlassian ecosystem, providing seamless connections to tools like Jira (project and issue tracking), Confluence (documentation), and Trello (Kanban boards). Core features include code reviews with pull requests, inline commenting, branch management, CI/CD pipelines (Bitbucket Pipelines), as well as detailed access controls and security features. It is a preferred choice for companies and teams seeking a private, integrated, and scalable solution for their software development."
      },
      "shortDescription": {
        "de": "Eine Git- und Mercurial-Code-Management-Lösung für Teams mit Fokus auf privaten Repositories",
        "en": "A Git and Mercurial code management solution for teams with a focus on private repositories"
      },
      "logo": "assets/img/utilities/bitbucket/logo/bitbucket.png",
      "screenshots": [],
      "links": {
        "website": "https://bitbucket.org/product/",
        "documentation": "https://support.atlassian.com/bitbucket-cloud/"
      },
      "personalUsage": false
    },
    {
      "id": "gitlab",
      "name": "GitLab",
      "developer": "GitLab Inc.",
      "category": "Version Control Hosting",
      "platforms": ["web"],
      "releaseDate": "2011-10-08",
      "license": "Open Core (MIT License für Community Edition, Proprietär für Enterprise Edition)",
      "pricing": ["Freemium"],
      "description": {
        "de": "GitLab ist eine webbasierte Open-Core-DevOps-Plattform, die eine umfassende Suite von Tools für den gesamten Softwareentwicklungszyklus in einer einzigen Anwendung vereint. Ursprünglich als Git-Repository-Hosting-Dienst gestartet, hat sich GitLab zu einer 'Complete DevOps Platform' entwickelt, die von der Planung über das Erstellen, Verifizieren, Sichern, Bereitstellen bis hin zum Überwachen und Sichern von Anwendungen alles abdeckt. Zu den Hauptfunktionen gehören Git-Repository-Management, Issue-Tracking, Code-Reviews, CI/CD-Pipelines (GitLab CI/CD), Container-Registry, Sicherheits-Scans, Wiki und vieles mehr. GitLab ist sowohl als SaaS-Lösung (GitLab.com) als auch als selbst gehostete Version (GitLab Community Edition und Enterprise Edition) verfügbar, was es für Unternehmen jeder Größe attraktiv macht. Es fördert eine offene Zusammenarbeit und Transparenz im Entwicklungsprozess und ist eine bevorzugte Wahl für Teams, die eine End-to-End-Lösung für ihre DevOps-Praktiken suchen.",
        "en": "GitLab is a web-based open-core DevOps platform that unifies a comprehensive suite of tools for the entire software development lifecycle in a single application. Initially starting as a Git repository hosting service, GitLab has evolved into a 'Complete DevOps Platform' covering everything from planning, creating, verifying, securing, deploying, monitoring, and securing applications. Key features include Git repository management, issue tracking, code reviews, CI/CD pipelines (GitLab CI/CD), container registry, security scanning, wiki, and much more. GitLab is available both as a SaaS solution (GitLab.com) and as a self-hosted version (GitLab Community Edition and Enterprise Edition), making it attractive for companies of all sizes. It promotes open collaboration and transparency in the development process and is a preferred choice for teams seeking an end-to-end solution for their DevOps practices."
      },
      "shortDescription": {
        "de": "Eine komplette DevOps-Plattform in einer einzigen Anwendung, basierend auf Git-Versionskontrolle",
        "en": "A complete DevOps platform in a single application, built on Git version control"
      },
      "logo": "assets/img/utilities/gitlab/logo/gitlab.png",
      "screenshots": [],
      "links": {
        "website": "https://about.gitlab.com/",
        "documentation": "https://docs.gitlab.com/",
        "github": "https://gitlab.com/gitlab-org/gitlab"
      },
      "personalUsage": false
    },
    {
      "id": "gitea",
      "name": "Gitea",
      "developer": "Gitea Community (Lunny, Teabot etc.)",
      "category": "Version Control Hosting",
      "platforms": ["windows", "macos", "linux", "docker"],
      "releaseDate": "2016-11-01",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Gitea ist ein freies und quelloffenes, leichtgewichtiges Git-Dienstprogramm, das in der Programmiersprache Go geschrieben wurde. Es ist eine Fork von Gogs und wurde entwickelt, um eine einfachere, schnellere und ressourcenschonendere Alternative zu umfassenderen Git-Hosting-Lösungen wie GitLab oder GitHub Enterprise zu bieten. Gitea konzentriert sich auf die Kernfunktionen des Git-Repository-Managements, einschließlich Issue-Tracking, Pull-Requests, Wiki und einer einfachen Verwaltungsoberfläche. Es ist besonders beliebt bei Entwicklern und kleinen bis mittleren Teams, die ihre Git-Repositories auf ihrer eigenen Infrastruktur hosten möchten, ohne dabei einen hohen Ressourcenverbrauch in Kauf nehmen zu müssen. Die Installation und Wartung von Gitea ist relativ unkompliziert, und es kann auf verschiedenen Plattformen (Linux, macOS, Windows) und mit verschiedenen Datenbanken (SQLite, MySQL, PostgreSQL) betrieben werden. Gitea ist ideal für private Projekte, interne Team-Repositories oder für alle, die volle Kontrolle über ihre Codebasis behalten möchten.",
        "en": "Gitea is a free and open-source, lightweight Git service written in the Go programming language. It is a fork of Gogs and was developed to provide a simpler, faster, and more resource-efficient alternative to more comprehensive Git hosting solutions like GitLab or GitHub Enterprise. Gitea focuses on the core functionalities of Git repository management, including issue tracking, pull requests, wiki, and a simple administration interface. It is particularly popular among developers and small to medium-sized teams who want to self-host their Git repositories on their own infrastructure without incurring high resource consumption. Gitea's installation and maintenance are relatively straightforward, and it can run on various platforms (Linux, macOS, Windows) and with different databases (SQLite, MySQL, PostgreSQL). Gitea is ideal for private projects, internal team repositories, or anyone who wants to maintain full control over their codebase."
      },
      "shortDescription": {
        "de": "Ein leichtgewichtiger, selbst gehosteter Git-Dienst, geschrieben in Go",
        "en": "A lightweight, self-hosted Git service, written in Go"
      },
      "logo": "assets/img/utilities/gitea/logo/gitea.png",
      "screenshots": [],
      "links": {
        "website": "https://gitea.io/",
        "documentation": "https://docs.gitea.io/",
        "github": "https://github.com/go-gitea/gitea"
      },
      "personalUsage": false
    },
    {
      "id": "microsoftsqlserver",
      "name": "Microsoft SQL Server",
      "developer": "Microsoft",
      "category": "Database",
      "platforms": ["windows", "linux", "docker"],
      "releaseDate": "1989-08-01",
      "license": "Proprietär (mit kostenlosen und kostenpflichtigen Editionen)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Microsoft SQL Server ist ein umfassendes relationales Datenbankmanagementsystem (RDBMS), das von Microsoft entwickelt wurde. Es ist eine der führenden Datenbanklösungen auf dem Markt und wird für eine Vielzahl von Anwendungen eingesetzt, von kleinen Webseiten bis hin zu großen Unternehmenslösungen und Business Intelligence (BI)-Systemen. SQL Server bietet robuste Funktionen für Datenmanagement, -analyse und -berichterstattung. Dazu gehören Transaction Processing, Data Warehousing, Business Intelligence (mit integrierten Diensten wie SSIS, SSAS, SSRS) und fortschrittliche Analysefunktionen. Es unterstützt T-SQL (Transact-SQL), eine Erweiterung von SQL, und bietet hohe Leistung, Skalierbarkeit, Sicherheit und Zuverlässigkeit. Neben den kommerziellen Editionen stellt Microsoft auch kostenlose Versionen wie SQL Server Express und eine Developer Edition bereit, die sich ideal für Entwicklung und kleine Produktionsumgebungen eignen. SQL Server ist eng in das Microsoft-Ökosystem integriert, ist aber auch für Linux und in Docker-Containern verfügbar.",
        "en": "Microsoft SQL Server is a comprehensive relational database management system (RDBMS) developed by Microsoft. It is one of the leading database solutions on the market, used for a wide range of applications, from small websites to large enterprise solutions and Business Intelligence (BI) systems. SQL Server offers robust features for data management, analysis, and reporting. These include transaction processing, data warehousing, Business Intelligence (with integrated services like SSIS, SSAS, SSRS), and advanced analytics capabilities. It supports T-SQL (Transact-SQL), an extension of SQL, and provides high performance, scalability, security, and reliability. In addition to commercial editions, Microsoft also offers free versions such as SQL Server Express and a Developer Edition, which are ideal for development and small production environments. SQL Server is tightly integrated into the Microsoft ecosystem but is also available for Linux and in Docker containers."
      },
      "shortDescription": {
        "de": "Ein relationales Datenbankmanagementsystem (RDBMS) von Microsoft für verschiedenste Anwendungen",
        "en": "A relational database management system (RDBMS) by Microsoft for a wide range of applications"
      },
      "logo": "assets/img/utilities/microsoft_sql_server/logo/microsoft_sql_server.png",
      "screenshots": [],
      "links": {
        "website": "https://www.microsoft.com/de-de/sql-server/sql-server-downloads",
        "documentation": "https://learn.microsoft.com/de-de/sql/sql-server/?view=sql-server-ver16"
      },
      "personalUsage": false
    },
    {
      "id": "apachehttpserver",
      "name": "Apache HTTP Server",
      "developer": "Apache Software Foundation",
      "category": "Web Server",
      "platforms": ["linux", "docker", "windows", "macos"],
      "releaseDate": "1995-04-01",
      "license": "Apache License 2.0",
      "pricing": ["Free"],
      "description": {
        "de": "Der Apache HTTP Server, oft einfach als Apache bezeichnet, ist der am weitesten verbreitete und meistgenutzte Webserver der Welt. Er ist eine freie und quelloffene Software, die von der Apache Software Foundation entwickelt und gepflegt wird. Apache ist bekannt für seine Stabilität, Robustheit, flexible Konfiguration und sein modular aufgebautes Design, das eine Erweiterung der Funktionalität durch Module ermöglicht (z.B. mod_rewrite für URL-Umschreibungen, mod_ssl für HTTPS). Er kann sowohl statische Webseiten als auch dynamische Inhalte (durch Integration mit Skriptsprachen wie PHP, Perl oder Python über CGI, FastCGI oder Module) bereitstellen. Apache läuft auf einer Vielzahl von Betriebssystemen, darunter Linux, Unix-ähnliche Systeme, Windows und macOS. Trotz des Aufkommens neuerer Webserver wie Nginx bleibt Apache aufgrund seiner ausgereiften Funktionen, der großen Community-Unterstützung und der umfangreichen Dokumentation eine bevorzugte Wahl für unzählige Websites und Anwendungen weltweit.",
        "en": "The Apache HTTP Server, often simply referred to as Apache, is the world's most widely used and popular web server. It is free and open-source software developed and maintained by the Apache Software Foundation. Apache is renowned for its stability, robustness, flexible configuration, and modular design, which allows for functionality extensions through modules (e.g., mod_rewrite for URL rewriting, mod_ssl for HTTPS). It can serve both static web pages and dynamic content (through integration with scripting languages like PHP, Perl, or Python via CGI, FastCGI, or modules). Apache runs on a wide range of operating systems, including Linux, Unix-like systems, Windows, and macOS. Despite the emergence of newer web servers like Nginx, Apache remains a preferred choice for countless websites and applications worldwide due to its mature features, extensive community support, and comprehensive documentation."
      },
      "shortDescription": {
        "de": "Ein weit verbreiteter, quelloffener Webserver für statische und dynamische Inhalte",
        "en": "A widely used, open-source web server for serving static and dynamic content"
      },
      "logo": "assets/img/utilities/apache_http_server/logo/apache_http_server.png",
      "screenshots": [],
      "links": {
        "website": "https://www.apache.org/",
        "documentation": "https://httpd.apache.org/docs/"
      },
      "personalUsage": false
    },
    {
      "id": "nginx",
      "name": "Nginx",
      "developer": "Nginx, Inc., Igor Sysoev,",
      "category": "Web Server",
      "platforms": ["linux", "docker", "windows", "macos"],
      "releaseDate": "2004-10-04",
      "license": "2-clause BSD-like license",
      "pricing": ["Freemium"],
      "description": {
        "de": "Nginx (ausgesprochen 'Engine-X') ist ein quelloffener Webserver, der auch als Reverse Proxy, HTTP-Cache und Load Balancer eingesetzt werden kann. Ursprünglich von Igor Sysoev entwickelt, um die Performance und Skalierbarkeit von hochfrequentierten Websites zu verbessern, hat Nginx aufgrund seiner Effizienz und seines geringen Ressourcenverbrauchs enorme Popularität gewonnen. Im Gegensatz zu Apache, das oft ein Thread- oder Prozess-basiertes Modell verwendet, nutzt Nginx ein asynchrones, ereignisgesteuertes Modell, das es ihm ermöglicht, Zehntausende gleichzeitiger Verbindungen mit geringem Speicherverbrauch zu verarbeiten. Dies macht ihn ideal für den Betrieb von modernen, dynamischen Webanwendungen und Microservices. Nginx ist ein wesentlicher Bestandteil des 'LEMP'-Stacks (Linux, Nginx, MySQL/MariaDB, PHP/Python/Perl) und wird häufig vor Apache oder anderen Anwendungsservern platziert, um Anfragen zu verwalten und Lasten zu verteilen. Es ist die bevorzugte Wahl für viele der größten Websites der Welt.",
        "en": "Nginx (pronounced 'Engine-X') is an open-source web server that can also be used as a reverse proxy, HTTP cache, and load balancer. Originally developed by Igor Sysoev to improve the performance and scalability of high-traffic websites, Nginx has gained enormous popularity due to its efficiency and low resource consumption. Unlike Apache, which often uses a thread- or process-based model, Nginx employs an asynchronous, event-driven model that allows it to handle tens of thousands of concurrent connections with low memory usage. This makes it ideal for running modern, dynamic web applications and microservices. Nginx is a key component of the 'LEMP' stack (Linux, Nginx, MySQL/MariaDB, PHP/Python/Perl) and is often placed in front of Apache or other application servers to manage requests and distribute loads. It is the preferred choice for many of the world's largest websites."
      },
      "shortDescription": {
        "de": "Ein leistungsstarker, ereignisbasierter Webserver, Reverse Proxy und Load Balancer",
        "en": "A powerful, event-driven web server, reverse proxy, and load balancer"
      },
      "logo": "assets/img/utilities/nginx/logo/nginx.png",
      "screenshots": [],
      "links": {
        "website": "https://nginx.org/",
        "documentation": "https://nginx.org/en/docs/"
      },
      "personalUsage": false
    },
    {
      "id": "mongodb",
      "name": "MongoDB",
      "developer": "MongoDB, Inc.",
      "category": "Database",
      "platforms": ["windows", "linux", "macos", "docker"],
      "releaseDate": "2009-02-11",
      "license": "Server Side Public License (SSPL) / Proprietär (Enterprise)",
      "pricing": ["Freemium"],
      "description": {
        "de": "MongoDB ist eine weit verbreitete, quelloffene und NoSQL-Datenbank, die auf einem dokumentenorientierten Datenmodell basiert. Im Gegensatz zu traditionellen relationalen Datenbanken speichert MongoDB Daten in flexiblen, JSON-ähnlichen Dokumenten mit dynamischen Schemata. Dies macht es besonders geeignet für die Speicherung unstrukturierter oder semi-strukturierter Daten und für Anwendungen, die schnelle Iterationen und sich ändernde Datenanforderungen haben. MongoDB bietet hohe Leistung, Skalierbarkeit durch Sharding (horizontale Skalierung) und hohe Verfügbarkeit durch Replikation. Es ist ein integraler Bestandteil des MEAN- und MERN-Stacks und wird häufig in modernen Web- und Mobilanwendungen, Echtzeit-Analysen, IoT und Content Management Systemen eingesetzt. Neben der Community Edition bietet MongoDB auch eine Enterprise Advanced Edition mit erweiterten Funktionen und Support sowie einen Cloud-Dienst namens MongoDB Atlas an.",
        "en": "MongoDB is a widely used, open-source, and NoSQL database that operates on a document-oriented data model. Unlike traditional relational databases, MongoDB stores data in flexible, JSON-like documents with dynamic schemas. This makes it particularly suitable for storing unstructured or semi-structured data and for applications with rapid iteration cycles and evolving data requirements. MongoDB offers high performance, scalability through sharding (horizontal scaling), and high availability through replication. It is an integral part of the MEAN and MERN stacks and is frequently used in modern web and mobile applications, real-time analytics, IoT, and content management systems. In addition to the Community Edition, MongoDB also offers an Enterprise Advanced Edition with extended features and and support, as well as a cloud service called MongoDB Atlas."
      },
      "shortDescription": {
        "de": "Eine führende NoSQL-Datenbank, die dokumentenorientiert ist und sich ideal für flexible Datenmodelle eignet",
        "en": "A leading NoSQL database, document-oriented and ideal for flexible data models"
      },
      "logo": "assets/img/utilities/mongodb/logo/mongodb.png",
      "screenshots": [],
      "links": {
        "website": "https://www.mongodb.com/de-de",
        "documentation": "https://www.mongodb.com/docs/",
        "github": "https://github.com/mongodb/mongo"
      },
      "personalUsage": false
    },
    {
      "id": "mariadb",
      "name": "MariaDB",
      "developer": "MariaDB Foundation und Community",
      "category": "Database",
      "platforms": ["windows", "linux", "macos", "docker"],
      "releaseDate": "2009-10-29",
      "license": "GNU GPLv2 (Client libraries LGPL/BSD)",
      "pricing": ["Free"],
      "description": {
        "de": "MariaDB ist ein populäres, quelloffenes relationales Datenbankmanagementsystem (RDBMS), das als Community-Fork von MySQL entstanden ist, nachdem Oracle Sun Microsystems (und damit MySQL) übernommen hatte. Es wurde von den ursprünglichen Entwicklern von MySQL ins Leben gerufen, um sicherzustellen, dass die Datenbank unter der GPL-Lizenz quelloffen und frei bleibt. MariaDB ist vollständig kompatibel mit MySQL, was den Übergang für bestehende MySQL-Nutzer extrem einfach macht. Es bietet eine verbesserte Leistung, neue Speicher-Engines (wie Aria und ColumnStore für analytische Workloads), erweiterte Funktionen und bessere Sicherheitsoptionen. MariaDB ist eine robuste und zuverlässige Wahl für Webanwendungen (oft Teil des LAMP/LEMP-Stacks), Data Warehousing, Cloud-Anwendungen und alle Szenarien, die eine skalierbare und performante relationale Datenbank erfordern. Es wird von einer aktiven Community unterstützt und von vielen großen Unternehmen und Diensten eingesetzt.",
        "en": "MariaDB is a popular, open-source relational database management system (RDBMS) that emerged as a community fork of MySQL after Oracle acquired Sun Microsystems (and thus MySQL). It was initiated by the original developers of MySQL to ensure the database remained open-source and free under the GPL license. MariaDB is fully compatible with MySQL, making the transition extremely easy for existing MySQL users. It offers improved performance, new storage engines (like Aria and ColumnStore for analytical workloads), enhanced features, and better security options. MariaDB is a robust and reliable choice for web applications (often part of the LAMP/LEMP stack), data warehousing, cloud applications, and any scenario requiring a scalable and performant relational database. It is supported by an active community and used by many large companies and services."
      },
      "shortDescription": {
        "de": "Eine quelloffene und performante relationale Datenbank, ein Community-Fork von MySQL",
        "en": "An open-source and performant relational database, a community fork of MySQL"
      },
      "logo": "assets/img/utilities/mariadb/logo/mariadb.png",
      "screenshots": [],
      "links": {
        "website": "https://mariadb.org/",
        "documentation": "https://mariadb.com/kb/en/documentation/",
        "github": "https://github.com/MariaDB/MariaDB-server"
      },
      "personalUsage": true
    },
    {
      "id": "postgresql",
      "name": "PostgreSQL",
      "developer": "PostgreSQL Global Development Group",
      "category": "Database",
      "platforms": ["windows", "linux", "macos", "docker"],
      "releaseDate": "1996-07-08",
      "license": "PostgreSQL License (BSD-ähnlich)",
      "pricing": ["Free"],
      "description": {
        "de": "PostgreSQL, oft auch einfach Postgres genannt, ist ein freies und quelloffenes objektrelationales Datenbankmanagementsystem (ORDBMS). Es ist bekannt für seine Robustheit, Feature-Reichtum und Einhaltung von Standards. Im Gegensatz zu rein relationalen Datenbanken bietet PostgreSQL auch objektorientierte Konzepte wie Klassen, Vererbung und Funktionen. Es ist hochgradig erweiterbar und unterstützt eine Vielzahl von Datentypen, darunter strukturierte (SQL), semi-strukturierte (JSON, XML), und auch räumliche Daten (PostGIS). PostgreSQL ist ideal für komplexe Transaktionslasten, Data Warehousing und Anwendungen, die Datenintegrität und erweiterte Funktionen benötigen. Es wird von einer engagierten globalen Entwicklergruppe gepflegt und genießt einen hervorragenden Ruf für Zuverlässigkeit, Datenintegrität und korrekte Implementierung von Standards. Viele Cloud-Anbieter bieten verwaltete PostgreSQL-Dienste an, was seine Beliebtheit und Anpassungsfähigkeit unterstreicht.",
        "en": "PostgreSQL, often referred to simply as Postgres, is a free and open-source object-relational database management system (ORDBMS). It is renowned for its robustness, feature richness, and adherence to standards. Unlike purely relational databases, PostgreSQL also offers object-oriented concepts such as classes, inheritance, and functions. It is highly extensible and supports a wide variety of data types, including structured (SQL), semi-structured (JSON, XML), and even spatial data (PostGIS). PostgreSQL is ideal for complex transactional workloads, data warehousing, and applications requiring data integrity and advanced features. It is maintained by a dedicated global development group and has an excellent reputation for reliability, data integrity, and correct implementation of standards. Many cloud providers offer managed PostgreSQL services, highlighting its popularity and adaptability."
      },
      "shortDescription": {
        "de": "Ein leistungsstarkes, quelloffenes objektrelationales Datenbankmanagementsystem",
        "en": "A powerful, open-source object-relational database management system"
      },
      "logo": "assets/img/utilities/postgresql/logo/postgresql.png",
      "screenshots": [],
      "links": {
        "website": "https://www.postgresql.org/",
        "documentation": "https://www.postgresql.org/docs/",
        "github": "https://github.com/postgres/postgres"
      },
      "personalUsage": false
    },
    {
      "id": "redis",
      "name": "Redis",
      "developer": "Salvatore Sanfilippo (ursprünglicher Autor), Redis Ltd. und Community",
      "category": "Database",
      "platforms": ["linux", "macos", "windows", "docker"],
      "releaseDate": "2009-05-10",
      "license": "BSD 3-Clause License",
      "pricing": ["Free"],
      "description": {
        "de": "Redis (kurz für 'Remote Dictionary Server') ist ein extrem schneller, quelloffener In-Memory-Datenstrukturspeicher, der als Datenbank, Cache und Message Broker verwendet wird. Im Gegensatz zu traditionellen Datenbanken speichert Redis Daten primär im Arbeitsspeicher, was blitzschnelle Lese- und Schreiboperationen ermöglicht. Es unterstützt eine Vielzahl von Datenstrukturen wie Strings, Hashes, Listen, Sets, sortierte Sets mit Ranges, Bitmaps, HyperLogLogs, Geodaten und Streams. Redis ist bekannt für seine hohe Leistung, seine Flexibilität und seine Fähigkeit, komplexe Anwendungsfälle wie Echtzeit-Analysen, Chat-Anwendungen, Gaming-Leaderboards und Session-Caching zu unterstützen. Es bietet Persistenz-Optionen, Replikation für Hochverfügbarkeit und Clustering für Skalierbarkeit. Redis ist ein unverzichtbares Werkzeug in modernen, leistungsintensiven Webanwendungen und Microservice-Architekturen.",
        "en": "Redis (short for 'Remote Dictionary Server') is an extremely fast, open-source in-memory data structure store used as a database, cache, and message broker. Unlike traditional databases, Redis primarily stores data in memory, enabling lightning-fast read and write operations. It supports a wide variety of data structures, including strings, hashes, lists, sets, sorted sets with ranges, bitmaps, HyperLogLogs, geospatial indexes, and streams. Redis is known for its high performance, flexibility, and ability to support complex use cases such as real-time analytics, chat applications, gaming leaderboards, and session caching. It offers persistence options, replication for high availability, and clustering for scalability. Redis is an indispensable tool in modern, high-performance web applications and microservice architectures."
      },
      "shortDescription": {
        "de": "Ein Open-Source In-Memory-Datenstrukturspeicher, der als Datenbank, Cache und Message Broker genutzt wird",
        "en": "An open-source in-memory data structure store, used as a database, cache, and message broker"
      },
      "logo": "assets/img/utilities/redis/logo/redis.png",
      "screenshots": [],
      "links": {
        "website": "https://redis.io/de/",
        "documentation": "https://redis.io/docs/",
        "github": "https://github.com/redis/redis"
      },
      "personalUsage": false
    },
    {
      "id": "heidisql",
      "name": "HeidiSQL",
      "developer": "Ansgar Becker (und Contributoren)",
      "category": "Database Management Tool",
      "platforms": ["windows"],
      "releaseDate": "2002-09-01",
      "license": "GNU GPL",
      "pricing": ["Free"],
      "description": {
        "de": "HeidiSQL ist eine leistungsstarke, kostenlose und quelloffene Software, die eine intuitive grafische Benutzeroberfläche (GUI) für die Verwaltung verschiedener relationaler Datenbanken bietet. Ursprünglich für MySQL entwickelt, unterstützt es heute auch MariaDB, PostgreSQL, Microsoft SQL Server und SQLite. HeidiSQL ermöglicht es Entwicklern und Datenbankadministratoren, Daten zu durchsuchen und zu bearbeiten, Tabellen zu erstellen und zu modifizieren, Abfragen auszuführen, Benutzerrechte zu verwalten und Datenbanken zu sichern oder wiederherzustellen. Es ist bekannt für seine schnelle Performance, seine einfache Bedienung und seine umfangreichen Funktionen, die oft in teuren kommerziellen Tools zu finden sind. HeidiSQL ist primär für Windows verfügbar, kann aber über Wine auch unter Linux und macOS genutzt werden. Es ist ein unverzichtbares Werkzeug für jeden, der regelmäßig mit relationalen Datenbanken arbeitet und eine effiziente, visuelle Verwaltungslösung sucht.",
        "en": "HeidiSQL is a powerful, free, and open-source software that provides an intuitive graphical user interface (GUI) for managing various relational databases. Originally developed for MySQL, it now also supports MariaDB, PostgreSQL, Microsoft SQL Server, and SQLite. HeidiSQL allows developers and database administrators to browse and edit data, create and modify tables, execute queries, manage user privileges, and back up or restore databases. It is known for its fast performance, ease of use, and extensive features often found in expensive commercial tools. HeidiSQL is primarily available for Windows but can also be used on Linux and macOS via Wine. It is an indispensable tool for anyone regularly working with relational databases who is looking for an efficient, visual management solution."
      },
      "shortDescription": {
        "de": "Ein kostenloses und quelloffenes Tool zur Verwaltung von MySQL, MariaDB, PostgreSQL, SQL Server und SQLite Datenbanken",
        "en": "A free and open-source tool for managing MySQL, MariaDB, PostgreSQL, SQL Server, and SQLite databases"
      },
      "logo": "assets/img/utilities/heidisql/logo/heidisql.png",
      "screenshots": ["assets/img/utilities/heidisql/screenshots/heidisql_screenshot.png"],
      "links": {
        "website": "https://www.heidisql.com/",
        "download": "https://www.heidisql.com/download.php",
        "documentation": "https://www.heidisql.com/help.php",
        "github": "https://github.com/HeidiSQL/HeidiSQL"
      },
      "personalUsage": true
    },
    {
      "id": "datagrip",
      "name": "DataGrip",
      "developer": "JetBrains",
      "category": "Database",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2015-05-18",
      "license": "Proprietär (kostenpflichtig mit Testversion)",
      "pricing": ["Paid"],
      "description": {
        "de": "DataGrip ist eine leistungsstarke und vielseitige integrierte Entwicklungsumgebung (IDE) von JetBrains, die speziell für Datenbankentwickler und Datenbankadministratoren konzipiert wurde. Es bietet eine konsistente Benutzeroberfläche für eine breite Palette von Datenbankmanagementsystemen, darunter MySQL, PostgreSQL, Oracle, SQL Server, Cassandra, MongoDB und viele andere. DataGrip zeichnet sich durch intelligente Code-Vervollständigung, Syntaxhervorhebung, Refactoring-Möglichkeiten, einen leistungsstarken Query-Editor, Schema-Navigation und ein robustes Versionskontroll-Integrationssystem aus. Es ermöglicht das Schreiben und Ausführen von SQL-Abfragen, das Verwalten von Daten, das Erstellen und Ändern von Datenbankobjekten sowie das visuelle Analysieren von Schemata. Mit seinen fortschrittlichen Funktionen zur Produktivitätssteigerung ist DataGrip eine bevorzugte Wahl für professionelle Anwender, die eine umfassende und intelligente Umgebung für die Arbeit mit Datenbanken suchen.",
        "en": "DataGrip is a powerful and versatile integrated development environment (IDE) from JetBrains, specifically designed for database developers and administrators. It provides a consistent user interface for a wide range of database management systems, including MySQL, PostgreSQL, Oracle, SQL Server, Cassandra, MongoDB, and many others. DataGrip features intelligent code completion, syntax highlighting, refactoring capabilities, a powerful query editor, schema navigation, and robust version control integration. It allows users to write and execute SQL queries, manage data, create and modify database objects, and visually analyze schemas. With its advanced productivity-boosting features, DataGrip is a preferred choice for professional users seeking a comprehensive and intelligent environment for working with databases."
      },
      "shortDescription": {
        "de": "Eine intelligente IDE für Datenbanken und SQL, die eine Vielzahl von Datenbanksystemen unterstützt",
        "en": "An intelligent IDE for databases and SQL, supporting a wide range of database systems"
      },
      "logo": "assets/img/utilities/datagrip/logo/datagrip.png",
      "screenshots": ["assets/img/utilities/datagrip/screenshots/datagrip_screenshot.png"],
      "links": {
        "website": "https://www.jetbrains.com/datagrip/",
        "download": "https://www.jetbrains.com/datagrip/download/",
        "documentation": "https://www.jetbrains.com/datagrip/documentation/"
      },
      "personalUsage": false
    },
    {
      "id": "phpmyadmin",
      "name": "phpMyAdmin",
      "developer": "The phpMyAdmin Project",
      "category": "Database Management Tool",
      "platforms": ["web"],
      "releaseDate": "1998-09-09",
      "license": "GNU GPLv2",
      "pricing": ["Free"],
      "description": {
        "de": "phpMyAdmin ist eines der bekanntesten und am weitesten verbreiteten **webbasierten Administrationswerkzeuge** für **MySQL- und MariaDB-Datenbanken**. Es wurde in **PHP** geschrieben und ermöglicht Nutzern die Interaktion mit ihren Datenbanken über eine intuitive **grafische Benutzeroberfläche** direkt im Browser, ohne dass Befehlszeilenkenntnisse erforderlich sind. Mit phpMyAdmin können Nutzer gängige Datenbankoperationen wie das Erstellen, Ändern und Löschen von Datenbanken, Tabellen, Spalten, Indizes, Nutzern und Berechtigungen durchführen. Es bietet auch die Möglichkeit, **SQL-Abfragen** auszuführen, Daten zu **importieren und zu exportieren** (in verschiedenen Formaten wie CSV, SQL, XML), und Datenbanken zu optimieren oder zu reparieren. Aufgrund seiner weiten Verbreitung und Integration in populäre LAMP/XAMPP-Stacks ist phpMyAdmin ein **unverzichtbares Tool für Webentwickler**, die MySQL oder MariaDB als Backend nutzen und eine einfache, visuelle Verwaltungslösung bevorzugen.",
        "en": "phpMyAdmin is one of the most well-known and widely used **web-based administration tools** for **MySQL and MariaDB databases**. Written in **PHP**, it allows users to interact with their databases via an intuitive **graphical user interface** directly in their browser, without requiring command-line knowledge. With phpMyAdmin, users can perform common database operations such as creating, modifying, and deleting databases, tables, columns, indexes, users, and permissions. It also offers the ability to execute **SQL queries**, **import and export** data (in various formats like CSV, SQL, XML), and optimize or repair databases. Due to its widespread adoption and integration into popular LAMP/XAMPP stacks, phpMyAdmin is an **indispensable tool for web developers** using MySQL or MariaDB as a backend who prefer a simple, visual management solution."
      },
      "shortDescription": {
        "de": "Eine kostenlose und quelloffene, webbasierte Benutzeroberfläche zur Verwaltung von MySQL und MariaDB",
        "en": "A free and open-source, web-based user interface for managing MySQL and MariaDB"
      },
      "logo": "assets/img/utilities/phpmyadmin/logo/phpmyadmin.png",
      "screenshots": ["assets/img/utilities/phpmyadmin/screenshots/phpmyadmin_screenshot.png"],
      "links": {
        "website": "https://www.phpmyadmin.net/",
        "download": "https://www.phpmyadmin.net/downloads/",
        "documentation": "https://docs.phpmyadmin.net/en/latest/",
        "github": "https://github.com/phpmyadmin/phpmyadmin"
      },
      "personalUsage": true
    },
    {
      "id": "dbeaver",
      "name": "DBeaver",
      "developer": "DBeaver Corp. (Serge Rider)",
      "category": "Database Management Tool",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2010-09-01",
      "license": "Apache License 2.0 (Community Edition), Proprietär (Enterprise Edition)",
      "pricing": ["Freemium"],
      "description": {
        "de": "DBeaver ist ein **kostenloses und quelloffenes universelles Datenbank-Tool**, das für Entwickler, Datenbankadministratoren und Analysten entwickelt wurde. Es ist in der Lage, sich mit einer **Vielzahl von Datenbanken** zu verbinden, darunter alle gängigen relationalen Datenbanken wie MySQL, PostgreSQL, Oracle, SQL Server, MariaDB, SQLite, sowie viele NoSQL-Datenbanken wie MongoDB, Cassandra und Redis. DBeaver bietet eine **intuitive grafische Benutzeroberfläche** zur Verwaltung von Datenbankstrukturen, zur Ausführung von SQL-Abfragen, zum Import und Export von Daten, zur visuellen Schema-Analyse und zur Datenbearbeitung. Es ist bekannt für seine **Erweiterbarkeit** durch Plugins und seine leistungsstarken Funktionen, die oft in kommerziellen Tools zu finden sind. Dank seiner plattformübergreifenden Natur und der Unterstützung für zahlreiche Datenbanktypen ist DBeaver ein **unverzichtbares Werkzeug** für jeden, der mit heterogenen Datenbanklandschaften arbeitet und eine konsistente, funktionsreiche Managementlösung sucht.",
        "en": "DBeaver is a **free and open-source universal database tool** designed for developers, database administrators, and analysts. It is capable of connecting to a **wide variety of databases**, including all popular relational databases such as MySQL, PostgreSQL, Oracle, SQL Server, MariaDB, SQLite, as well as many NoSQL databases like MongoDB, Cassandra, and Redis. DBeaver provides an **intuitive graphical user interface** for managing database structures, executing SQL queries, importing and exporting data, visual schema analysis, and data manipulation. It is known for its **extensibility** through plugins and its powerful features, often found in commercial tools. Thanks to its cross-platform nature and support for numerous database types, DBeaver is an **indispensable tool** for anyone working with heterogeneous database landscapes and seeking a consistent, feature-rich management solution."
      },
      "shortDescription": {
        "de": "Ein universelles Open-Source-Datenbank-Tool mit Unterstützung für relationale und NoSQL-Datenbanken",
        "en": "A universal open-source database tool supporting relational and NoSQL databases"
      },
      "logo": "assets/img/utilities/dbeaver/logo/dbeaver.png",
      "screenshots": ["assets/img/utilities/dbeaver/screenshots/dbeaver_screenshot.png"],
      "links": {
        "website": "https://dbeaver.io/",
        "download": "https://dbeaver.io/download/",
        "documentation": "https://dbeaver.com/docs/",
        "github": "https://github.com/dbeaver/dbeaver"
      },
      "personalUsage": false
    },
    {
      "id": "docker",
      "name": "Docker",
      "developer": "Docker Inc.",
      "category": "Containerization",
      "platforms": ["linux", "windows", "macos"],
      "releaseDate": "2013-03-20",
      "license": "Open Source (Docker Engine, Moby Project), Proprietär (Docker Desktop mit Nutzungsbedingungen)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Docker ist die weltweit führende **Containerisierungsplattform**, die Entwicklern ermöglicht, Anwendungen in isolierten, portablen Umgebungen – sogenannten **Containern** – zu verpacken und auszuführen. Diese Container enthalten alles, was eine Anwendung zum Laufen benötigt: Code, Laufzeitumgebung, System-Tools, Bibliotheken und Einstellungen. Im Gegensatz zu virtuellen Maschinen sind Container leichtgewichtiger und nutzen den Host-Betriebssystem-Kernel, was sie extrem effizient macht. Docker vereinfacht den gesamten Software-Lebenszyklus, von der Entwicklung und dem Testen bis zur Bereitstellung in der Produktion, indem es Konsistenz über verschiedene Umgebungen hinweg gewährleistet ('Build once, run anywhere'). Es hat die **DevOps-Praktiken** revolutioniert und ist ein Eckpfeiler moderner Cloud-nativer Architekturen, Microservices und Continuous Integration/Delivery (CI/CD) Pipelines. Mit **Docker Desktop** (für Entwickler) und der **Docker Engine** (für Server) bietet es eine umfassende Lösung für die Erstellung und Verwaltung von containerisierten Anwendungen.",
        "en": "Docker is the world's leading **containerization platform** that enables developers to package and run applications in isolated, portable environments called **containers**. These containers include everything an application needs to run: code, runtime, system tools, libraries, and settings. Unlike virtual machines, containers are more lightweight and share the host OS kernel, making them extremely efficient. Docker simplifies the entire software development lifecycle, from development and testing to production deployment, by ensuring consistency across different environments ('Build once, run anywhere'). It has revolutionized **DevOps practices** and is a cornerstone of modern cloud-native architectures, microservices, and Continuous Integration/Delivery (CI/CD) pipelines. With **Docker Desktop** (for developers) and the **Docker Engine** (for servers), it provides a comprehensive solution for building and managing containerized applications."
      },
      "shortDescription": {
        "de": "Eine Plattform zum Entwickeln, Bereitstellen und Ausführen von Anwendungen in Containern",
        "en": "A platform for developing, shipping, and running applications in containers"
      },
      "logo": "assets/img/utilities/docker/logo/docker.png",
      "screenshots": [],
      "links": {
        "website": "https://www.docker.com/",
        "products": "https://www.docker.com/products/",
        "documentation": "https://docs.docker.com/",
        "github": "https://github.com/docker/docker-ce"
      },
      "personalUsage": true
    },
    {
      "id": "podman",
      "name": "Podman",
      "developer": "Red Hat (und Open Source Community)",
      "category": "Containerization",
      "platforms": ["linux", "macos", "windows"],
      "releaseDate": "2017-06-19",
      "license": "Apache License 2.0",
      "pricing": ["Free"],
      "description": {
        "de": "Podman ist ein **Open-Source-Container-Engine**, der von Red Hat entwickelt wurde und sich als eine beliebte, **daemonlose Alternative zu Docker** etabliert hat. Im Gegensatz zu Docker benötigt Podman keinen zentralen Daemon (Hintergrunddienst) und läuft stattdessen direkt als normaler Benutzerprozess. Dies erhöht die **Sicherheit** und vereinfacht die Integration in bestehende Linux-Systeme. Podman ist vollständig **OCI (Open Container Initiative)-kompatibel**, was bedeutet, dass es die gleichen Container-Images ausführen kann, die auch mit Docker erstellt wurden, und dass es eine Docker-kompatible Befehlszeilenschnittstelle (CLI) bietet. Ein besonderes Merkmal von Podman ist die Möglichkeit, **Pods** zu verwalten – Gruppen von Containern, die Ressourcen teilen, ähnlich wie in Kubernetes. Dies macht Podman zu einem idealen Werkzeug für die lokale Entwicklung von Kubernetes-Workloads. Es ist eine ausgezeichnete Wahl für Entwickler und Sysadmins, die eine sichere, effiziente und flexible Container-Runtime suchen, insbesondere in Umgebungen, in denen ein Daemon nicht erwünscht ist oder Root-Rechte vermieden werden sollen.",
        "en": "Podman is an **open-source container engine** developed by Red Hat that has established itself as a popular, **daemonless alternative to Docker**. Unlike Docker, Podman does not require a central daemon (background service) and instead runs directly as a normal user process. This enhances **security** and simplifies integration into existing Linux systems. Podman is fully **OCI (Open Container Initiative) compliant**, meaning it can run the same container images created with Docker and offers a Docker-compatible command-line interface (CLI). A unique feature of Podman is its ability to manage **pods** – groups of containers that share resources, similar to Kubernetes. This makes Podman an ideal tool for local Kubernetes workload development. It's an excellent choice for developers and sysadmins looking for a secure, efficient, and flexible container runtime, especially in environments where a daemon is undesirable or root privileges should be avoided."
      },
      "shortDescription": {
        "de": "Ein Daemonless Container-Engine zum Entwickeln, Verwalten und Ausführen von OCI-Containern und Pods",
        "en": "A daemonless container engine for developing, managing, and running OCI containers and pods"
      },
      "logo": "assets/img/utilities/podman/logo/podman.png",
      "screenshots": [],
      "links": {
        "website": "https://podman.io/",
        "documentation": "https://docs.podman.io/",
        "github": "https://github.com/containers/podman"
      },
      "personalUsage": false
    },
    {
      "id": "windowsterminal",
      "name": "Windows Terminal",
      "developer": "Microsoft",
      "category": "Terminal",
      "platforms": ["windows"],
      "releaseDate": "2019-07-02",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Das Windows Terminal ist eine **moderne, schnelle, produktive und leistungsstarke Terminal-Anwendung** für Benutzer von Kommandozeilen-Tools und Shells wie PowerShell, CMD (Eingabeaufforderung), WSL (Windows Subsystem for Linux) oder SSH-Clients. Es wurde von **Microsoft** entwickelt, um die Einschränkungen der älteren Konsolen-Hosts zu überwinden und eine überlegene Benutzererfahrung zu bieten. Zu den Hauptmerkmalen gehören **Tab-Unterstützung**, die Möglichkeit, **mehrere Shells gleichzeitig** zu öffnen, **anpassbare Themes und Stile**, Unterstützung für **Emoji**, **GPU-beschleunigte Textdarstellung** für bessere Leistung und **Unicode-Unterstützung**. Windows Terminal ist **Open Source** und wird kontinuierlich weiterentwickelt, was es zu einem unverzichtbaren Werkzeug für Entwickler, Systemadministratoren und Power-User unter Windows macht, die eine verbesserte Produktivität und Ästhetik in ihrer Kommandozeilen-Umgebung suchen.",
        "en": "Windows Terminal is a **modern, fast, productive, and powerful terminal application** designed for users of command-line tools and shells like PowerShell, CMD (Command Prompt), WSL (Windows Subsystem for Linux), or SSH clients. It was developed by **Microsoft** to overcome the limitations of older console hosts and provide a superior user experience. Key features include **tab support**, the ability to open **multiple shells concurrently**, **customizable themes and styles**, **emoji support**, **GPU-accelerated text rendering** for improved performance, and **Unicode support**. Windows Terminal is **open-source** and continuously developed, making it an indispensable tool for developers, system administrators, and power users on Windows who seek enhanced productivity and aesthetics in their command-line environment."
      },
      "shortDescription": {
        "de": "Eine moderne, schnelle und anpassbare Terminal-Anwendung für Kommandozeilen-Benutzer in Windows",
        "en": "A modern, fast, and customizable terminal application for command-line users on Windows"
      },
      "logo": "assets/img/utilities/windows_terminal/logo/windows_terminal.png",
      "screenshots": ["assets/img/utilities/windows_terminal/screenshots/windows_terminal_screenshot.png"],
      "links": {
        "website": "https://apps.microsoft.com/detail/9n0dx20hk701",
        "documentation": "https://learn.microsoft.com/de-de/windows/terminal/",
        "github": "https://github.com/microsoft/terminal"
      },
      "personalUsage": true
    },
    {
      "id": "tabby",
      "name": "Tabby",
      "developer": "Eugeny Krivoruchko (und Contributoren)",
      "category": "Terminal",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2018-05-18",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Tabby (ehemals Terminus) ist ein **Open-Source, plattformübergreifender Terminal-Emulator**, der für moderne Workflows und Entwicklerbedürfnisse entwickelt wurde. Er ist nicht nur ein Ersatz für die Standard-Terminals, sondern bietet auch **integrierte SSH- und serielle Konnektivität**, was ihn zu einem vielseitigen Werkzeug für Systemadministratoren und IoT-Entwickler macht. Tabby zeichnet sich durch seine **umfassende Anpassbarkeit** aus, einschließlich Themes, Farbschemata, Schriftarten und Tastenkombinationen. Er unterstützt **Split-Panes**, **Maus-Interaktion**, **PowerShell Core, WSL, Git-Bash, Cygwin, MSYS2, Zsh, Fish** und viele weitere Shells. Weitere bemerkenswerte Funktionen sind ein integrierter SSH-Client mit Portweiterleitung, SFTP-Unterstützung für Dateiübertragungen, ein serieller Terminal für Hardware-Interaktion und ein umfangreiches Plugin-System, das seine Funktionalität erweitert. Tabby ist eine ausgezeichnete Wahl für alle, die einen leistungsstarken, funktionsreichen und ästhetisch ansprechenden Terminal-Client suchen.",
        "en": "Tabby (formerly Terminus) is an **open-source, cross-platform terminal emulator** designed for modern workflows and developer needs. It's not just a replacement for standard terminals but also offers **integrated SSH and serial connectivity**, making it a versatile tool for system administrators and IoT developers. Tabby stands out for its **extensive customizability**, including themes, color schemes, fonts, and keybindings. It supports **split panes**, **mouse interaction**, **PowerShell Core, WSL, Git-Bash, Cygwin, MSYS2, Zsh, Fish**, and many more shells. Other notable features include a built-in SSH client with port forwarding, SFTP support for file transfers, a serial terminal for hardware interaction, and a rich plugin system that extends its functionality. Tabby is an excellent choice for anyone looking for a powerful, feature-rich, and aesthetically pleasing terminal client."
      },
      "shortDescription": {
        "de": "Ein moderner, anpassbarer Terminal-Emulator, SSH- und serieller Client für Windows, macOS und Linux",
        "en": "A modern, highly customizable terminal emulator, SSH, and serial client for Windows, macOS, and Linux"
      },
      "logo": "assets/img/utilities/tabby/logo/tabby.png",
      "screenshots": ["assets/img/utilities/tabby/screenshots/tabby_screenshot.png"],
      "links": {
        "website": "https://tabby.sh/",
        "download": "https://tabby.sh/#_download",
        "github": "https://github.com/Eugeny/tabby",
        "documentation": "https://github.com/Eugeny/tabby/wiki"
      },
      "personalUsage": false
    },
    {
      "id": "putty",
      "name": "PuTTY",
      "developer": "Simon Tatham (und Contributoren)",
      "category": "Terminal ",
      "platforms": ["windows"],
      "releaseDate": "1999-07-08",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "PuTTY ist ein **beliebter, schlanker und quelloffener Client** für die Protokolle SSH, Telnet, Rlogin und Raw Socket. Es wurde ursprünglich für Windows entwickelt und ist seit langem das **Standardwerkzeug für Systemadministratoren und Entwickler**, um sich sicher mit entfernten Servern zu verbinden. PuTTY zeichnet sich durch seine **einfache Bedienung**, seine **Portabilität** (keine Installation erforderlich, nur eine ausführbare Datei) und seine grundlegenden, aber effektiven Funktionen aus. Dazu gehören die Verwaltung von SSH-Schlüsseln (mit PuTTYgen), Port-Weiterleitung (Tunneling), X11-Weiterleitung und verschiedene Terminal-Emulationsoptionen. Obwohl modernere Terminal-Emulatoren wie Windows Terminal oder Tabby mehr Funktionen und eine modernere Oberfläche bieten, bleibt PuTTY aufgrund seiner **Zuverlässigkeit, minimalen Ressourcenanforderungen und breiten Akzeptanz** ein weit verbreitetes Werkzeug, insbesondere in Windows-Umgebungen, wo es als erste Wahl für grundlegende SSH-Verbindungen dient.",
        "en": "PuTTY is a **popular, lightweight, and open-source client** for the SSH, Telnet, Rlogin, and Raw Socket protocols. Originally developed for Windows, it has long been the **go-to tool for system administrators and developers** to securely connect to remote servers. PuTTY is known for its **simplicity of use**, **portability** (no installation required, just an executable file), and its basic yet effective features. These include SSH key management (with PuTTYgen), port forwarding (tunneling), X11 forwarding, and various terminal emulation options. While more modern terminal emulators like Windows Terminal or Tabby offer more features and a contemporary interface, PuTTY remains a widely used tool due to its **reliability, minimal resource requirements, and broad acceptance**, especially in Windows environments, where it serves as a primary choice for basic SSH connections."
      },
      "shortDescription": {
        "de": "Ein kostenloses und quelloffenes SSH-, Telnet- und Rlogin-Client für Windows und Unix-Plattformen",
        "en": "A free and open-source SSH, Telnet, and Rlogin client for Windows and Unix platforms"
      },
      "logo": "assets/img/utilities/putty/logo/putty.png",
      "screenshots": ["assets/img/utilities/putty/screenshots/putty_screenshot.png"],
      "links": {
        "website": "https://www.putty.org/",
        "download": "https://www.putty.org/latest.html",
        "documentation": "https://www.putty.org/docs.html"
      },
      "personalUsage": false
    },
    {
      "id": "winscp",
      "name": "WinSCP",
      "developer": "Martin Prikryl",
      "category": "FTP/SFTP Client",
      "platforms": ["windows"],
      "releaseDate": "2000-04-10",
      "license": "GNU GPLv3",
      "pricing": ["Free"],
      "description": {
        "de": "WinSCP ist ein **beliebter, kostenloser und quelloffener Dateimanager und SFTP-, FTP-, WebDAV-, S3- und SCP-Client** für Microsoft Windows. Es wurde entwickelt, um eine sichere Dateiübertragung zwischen einem lokalen und einem entfernten Computer zu ermöglichen. WinSCP bietet eine **intuitive grafische Benutzeroberfläche** mit einer klassischen Dual-Pane-Ansicht oder einer Explorer-ähnlichen Ansicht, die das Hoch- und Herunterladen von Dateien per Drag-and-Drop stark vereinfacht. Neben den Kernfunktionen für die Dateiübertragung bietet WinSCP auch einen **integrierten Texteditor**, die Möglichkeit zur **Synchronisierung von Verzeichnissen**, Skripting-Funktionen zur Automatisierung von Aufgaben und die Integration mit PuTTY zur sicheren Shell-Anmeldung. Es ist ein **unverzichtbares Werkzeug für Webentwickler, Systemadministratoren und jeden, der regelmäßig Dateien sicher zwischen seinem Windows-PC und entfernten Servern austauschen muss**. Die Software ist für ihre Stabilität, Benutzerfreundlichkeit und die breite Unterstützung verschiedener Übertragungsprotokolle bekannt.",
        "en": "WinSCP is a **popular, free, and open-source file manager and SFTP, FTP, WebDAV, S3, and SCP client** for Microsoft Windows. It's designed to enable secure file transfers between a local and a remote computer. WinSCP offers an **intuitive graphical user interface** with a classic dual-pane view or an Explorer-like view, which greatly simplifies file uploads and downloads via drag-and-drop. In addition to its core file transfer functionalities, WinSCP also provides an **integrated text editor**, directory **synchronization capabilities**, scripting features for task automation, and integration with PuTTY for secure shell login. It is an **indispensable tool for web developers, system administrators, and anyone who regularly needs to securely exchange files between their Windows PC and remote servers**. The software is well-known for its stability, user-friendliness, and broad support for various transfer protocols."
      },
      "shortDescription": {
        "de": "Ein kostenloser und quelloffener SFTP-, FTP-, WebDAV-, S3- und SCP-Client für Windows mit GUI",
        "en": "A free and open-source SFTP, FTP, WebDAV, S3, and SCP client for Windows with a graphical user interface"
      },
      "logo": "assets/img/utilities/winscp/logo/winscp.png",
      "screenshots": ["assets/img/utilities/winscp/screenshots/winscp_screenshot.png"],
      "links": {
        "website": "https://winscp.net/eng/docs/lang:de",
        "download": "https://winscp.net/eng/download.php",
        "documentation": "https://winscp.net/eng/docs/start",
        "github": "https://github.com/winscp/winscp"
      },
      "personalUsage": true
    },
    {
      "id": "filezilla",
      "name": "FileZilla",
      "developer": "Tim Kosse (und Contributoren)",
      "category": "FTP/SFTP Client",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2001-06-27",
      "license": "GNU GPLv2",
      "pricing": ["Free"],
      "description": {
        "de": "FileZilla ist ein äußerst beliebter, **kostenloser und quelloffener FTP-Client** mit einer grafischen Benutzeroberfläche, der für die Dateiübertragung über **FTP, FTPS (FTP über SSL/TLS) und SFTP (SSH File Transfer Protocol)** verwendet wird. Er ist als Client-Version (FileZilla Client) für Windows, macOS und Linux sowie als Server-Version (FileZilla Server) nur für Windows verfügbar. Der Client zeichnet sich durch seine **benutzerfreundliche Zwei-Fenster-Ansicht** aus, die eine intuitive Navigation durch lokale und entfernte Dateisysteme ermöglicht. Funktionen wie Drag-and-Drop, die Wiederaufnahme von abgebrochenen Übertragungen, die Unterstützung großer Dateien (über 4 GB), ein Site Manager zur Speicherung von Verbindungsdaten und eine konfigurierbare Übertragungsgeschwindigkeitsbegrenzung machen FileZilla zu einem **Standardwerkzeug für Webentwickler, Administratoren und normale Benutzer**, die häufig Dateien zu und von Servern übertragen müssen. Seine Zuverlässigkeit und die aktive Entwicklung durch die Community haben seine Position als eines der Top-Tools in diesem Bereich gefestigt.",
        "en": "FileZilla is an extremely popular, **free and open-source FTP client** with a graphical user interface, used for file transfers over **FTP, FTPS (FTP over SSL/TLS), and SFTP (SSH File Transfer Protocol)**. It is available as a client version (FileZilla Client) for Windows, macOS, and Linux, and as a server version (FileZilla Server) only for Windows. The client is characterized by its **user-friendly two-pane view**, which allows intuitive navigation through local and remote file systems. Features such as drag-and-drop, resume broken transfers, support for large files (over 4 GB), a Site Manager for storing connection data, and a configurable transfer speed limit make FileZilla a **standard tool for web developers, administrators, and regular users** who frequently need to transfer files to and from servers. Its reliability and active community development have solidified its position as one of the top tools in this area."
      },
      "shortDescription": {
        "de": "Ein kostenloses und quelloffenes FTP-, FTPS- und SFTP-Client für die einfache Dateiübertragung",
        "en": "A free and open-source FTP, FTPS, and SFTP client for easy file transfer"
      },
      "logo": "assets/img/utilities/filezilla/logo/filezilla.png",
      "screenshots": ["assets/img/utilities/filezilla/screenshots/filezilla_screenshot.png"],
      "links": {
        "website": "https://filezilla-project.org/",
        "download": "https://filezilla-project.org/download.php?type=client",
        "documentation": "https://wiki.filezilla-project.org/Documentation",
        "forums": "https://forum.filezilla-project.org/"
      },
      "personalUsage": false
    },
    {
      "id": "blender",
      "name": "Blender",
      "developer": "Blender Foundation",
      "category": "3D Graphics Software",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "1994-01-02",
      "license": "GNU GPLv3",
      "pricing": ["Free"],
      "description": {
        "de": "Blender ist eine **umfassende, kostenlose und quelloffene 3D-Computergrafiksoftware**, die für die Erstellung von animierten Filmen, visuellen Effekten, Kunst, interaktiven 3D-Anwendungen, Virtual Reality und Videospielen verwendet wird. Es ist ein **vollständiges Produktionswerkzeug** und bietet eine breite Palette von Funktionen, darunter: **3D-Modellierung** (Polygon-Modellierung, Sculpting, Kurven), **UV-Mapping**, **Texturierung**, **Rigging und Animation**, **Partikel- und Flüssigkeitssimulationen**, **Rendering** (mit den integrierten Render-Engines Cycles und Eevee), **Motion Tracking**, **Compositing** und **Videoschnitt**. Blender wird von einer **aktiven und engagierten Community** von Künstlern und Entwicklern unterstützt und ist für seine stetige Weiterentwicklung und die Fähigkeit bekannt, mit kommerziellen 3D-Suiten zu konkurrieren. Es ist eine bevorzugte Wahl für Independent-Künstler, kleine Studios und Hobbyisten, die ein leistungsstarkes und zugängliches 3D-Tool suchen.",
        "en": "Blender is a **comprehensive, free, and open-source 3D computer graphics software** used for creating animated films, visual effects, art, interactive 3D applications, virtual reality, and video games. It is a **complete production tool** and offers a wide range of functionalities, including: **3D modeling** (polygon modeling, sculpting, curves), **UV mapping**, **texturing**, **rigging and animation**, **particle and fluid simulations**, **rendering** (with integrated render engines Cycles and Eevee), **motion tracking**, **compositing**, and **video editing**. Blender is supported by an **active and dedicated community** of artists and developers and is known for its continuous development and ability to compete with commercial 3D suites. It is a preferred choice for independent artists, small studios, and hobbyists looking for a powerful and accessible 3D tool."
      },
      "shortDescription": {
        "de": "Eine kostenlose und quelloffene 3D-Grafiksoftware für Modellierung, Animation, Rendering und mehr",
        "en": "A free and open-source 3D graphics software for modeling, animation, rendering, and more"
      },
      "logo": "assets/img/utilities/blender/logo/blender.png",
      "screenshots": ["assets/img/utilities/blender/screenshots/blender_screenshot.png"],
      "links": {
        "website": "https://www.blender.org/",
        "download": "https://www.blender.org/download/",
        "documentation": "https://docs.blender.org/manual/en/latest/",
        "github": "https://github.com/blender/blender"
      },
      "personalUsage": true
    },
    {
      "id": "cinema4d",
      "name": "Cinema 4D",
      "developer": "Maxon Computer GmbH",
      "category": "3D Graphics Software",
      "platforms": ["windows", "macos"],
      "releaseDate": "1993-02-01",
      "license": "Proprietär (Abonnement)",
      "pricing": ["Paid"],
      "description": {
        "de": "Cinema 4D ist eine **professionelle und intuitiv bedienbare 3D-Software** von Maxon, die weit verbreitet in der Film- und Fernsehproduktion, bei der Erstellung von Motion Graphics, in der Architekturvisualisierung, im Produktdesign und in der Spieleentwicklung ist. Es ist bekannt für seine **benutzerfreundliche Oberfläche** und einen vergleichsweise **einfachen Einstieg** in die Welt der 3D-Modellierung, Animation und des Renderings. Die Software bietet ein **umfassendes Set an Werkzeugen** für Polygonzäunung, NURBS-Modellierung, Sculpting, Texturierung, Rigging und Animation. Besondere Stärken von Cinema 4D liegen in seinen **leistungsstarken Motion Graphics Werkzeugen (MoGraph)**, die es ermöglichen, komplexe Animationen und Effekte schnell und effizient zu erstellen. Es beinhaltet außerdem **fortgeschrittene Simulationssysteme** für Partikel, Flüssigkeiten und Stoffe sowie hochwertige Render-Engines. Cinema 4D ist eine bevorzugte Wahl für Künstler und Designer, die Wert auf einen effizienten Workflow und hochwertige visuelle Ergebnisse legen.",
        "en": "Cinema 4D is a **professional and intuitively operable 3D software** from Maxon, widely used in film and television production, motion graphics creation, architectural visualization, product design, and game development. It is known for its **user-friendly interface** and a relatively **easy entry point** into the world of 3D modeling, animation, and rendering. The software offers a **comprehensive set of tools** for polygon modeling, NURBS modeling, sculpting, texturing, rigging, and animation. Particular strengths of Cinema 4D lie in its **powerful Motion Graphics tools (MoGraph)**, which enable the quick and efficient creation of complex animations and effects. It also includes **advanced simulation systems** for particles, fluids, and cloth, as well as high-quality render engines. Cinema 4D is a preferred choice for artists and designers who value an efficient workflow and high-quality visual results."
      },
      "shortDescription": {
        "de": "Eine professionelle 3D-Software für Modellierung, Animation, Simulation und Rendering, besonders beliebt für Motion Graphics",
        "en": "A professional 3D software for modeling, animation, simulation, and rendering, especially popular for motion graphics"
      },
      "logo": "assets/img/utilities/cinema4d/logo/cinema4d.png",
      "screenshots": ["assets/img/utilities/cinema4d/screenshots/cinema4d_screenshot.png"],
      "links": {
        "website": "https://www.maxon.net/de/cinema-4d",
        "download": "https://www.maxon.net/de/downloads",
        "documentation": "https://www.maxon.net/de/learn/documentation/cinema-4d"
      },
      "personalUsage": false
    },
    {
      "id": "gimp",
      "name": "GIMP",
      "developer": "The GIMP Development Team",
      "category": "Image Editing Software",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "1996-07-21",
      "license": "GNU GPLv3",
      "pricing": ["Free"],
      "description": {
        "de": "GIMP, kurz für **GNU Image Manipulation Program**, ist ein **leistungsstarkes, kostenloses und quelloffenes Rastergrafikprogramm**, das für die **Bildbearbeitung, Bildkomposition und Bildgenerierung** verwendet wird. Es ist oft die erste Wahl für Anwender, die eine Alternative zu kommerzieller Software wie Adobe Photoshop suchen. GIMP bietet eine **umfassende Palette von Werkzeugen** für Retusche, Bildkomposition, Erstellung von Webgrafiken, digitale Malerei und mehr. Dazu gehören eine Vielzahl von Pinseln, Filtern, Effekten, Ebenenunterstützung, Masken, Auswahlwerkzeuge und Transformationswerkzeuge. Es ist **plattformübergreifend** auf Windows, macOS und Linux verfügbar und unterstützt eine Vielzahl von Dateiformaten. Dank seiner **aktiven Community** und der Unterstützung durch Plugins kann GIMP an eine Vielzahl von Arbeitsabläufen angepasst werden. Es ist ein vielseitiges Tool, das sowohl für Hobbyisten als auch für professionelle Designer und Fotografen geeignet ist, die eine flexible und kostengünstige Lösung für ihre Grafikbearbeitungsbedürfnisse suchen.",
        "en": "GIMP, short for **GNU Image Manipulation Program**, is a **powerful, free, and open-source raster graphics editor** used for **image manipulation, image composition, and image creation**. It's often the go-to choice for users seeking an alternative to commercial software like Adobe Photoshop. GIMP offers a **comprehensive suite of tools** for retouching, image composition, web graphic creation, digital painting, and more. These include a wide variety of brushes, filters, effects, layer support, masks, selection tools, and transformation tools. It is **cross-platform** available on Windows, macOS, and Linux, and supports a multitude of file formats. Thanks to its **active community** and plugin support, GIMP can be adapted to a variety of workflows. It's a versatile tool suitable for hobbyists as well as professional designers and photographers looking for a flexible and cost-effective solution for their graphic editing needs."
      },
      "shortDescription": {
        "de": "Ein kostenloses und quelloffenes Rastergrafikprogramm für Bildbearbeitung und -erstellung",
        "en": "A free and open-source raster graphics editor for image manipulation and creation"
      },
      "logo": "assets/img/utilities/gimp/logo/gimp.png",
      "screenshots": ["assets/img/utilities/gimp/screenshots/gimp_screenshot.png"],
      "links": {
        "website": "https://www.gimp.org/",
        "download": "https://www.gimp.org/downloads/",
        "documentation": "https://docs.gimp.org/en/latest/",
        "gitlab": "https://gitlab.gnome.org/GNOME/gimp"
      },
      "personalUsage": false
    },
    {
      "id": "paintnet",
      "name": "Paint.NET",
      "developer": "Rick Brewster (und Contributoren)",
      "category": "Image Editing Software",
      "platforms": ["windows"],
      "releaseDate": "2004-11-06",
      "license": "Proprietär (kostenlos nutzbar)",
      "pricing": ["Free"],
      "description": {
        "de": "Paint.NET ist ein **leistungsstarkes und dennoch einfach zu bedienendes Bild- und Fotobearbeitungsprogramm**, das exklusiv für **Windows-Betriebssysteme** entwickelt wurde. Ursprünglich als Open-Source-Projekt an der Washington State University gestartet und als Ersatz für Microsoft Paint gedacht, hat es sich zu einer robusten Anwendung mit vielen fortschrittlichen Funktionen entwickelt, die typischerweise in teurerer Software zu finden sind. Zu den Hauptmerkmalen gehören **Ebenen (Layers)**, eine **unbegrenzte Rückgängig-/Wiederherstellen-Historie**, **Spezialeffekte**, eine breite Palette von **nützlichen und leistungsstarken Werkzeugen** für Auswahl, Retusche und Zeichnen. Es unterstützt auch **Plugins**, die die Funktionalität erheblich erweitern. Paint.NET ist bekannt für seine **schnelle Performance** und seine **intuitive Benutzeroberfläche**, was es zu einer ausgezeichneten Wahl für Hobbyfotografen, Webdesigner und alle macht, die eine leistungsfähige, aber unkomplizierte Lösung für die Bildbearbeitung unter Windows suchen.",
        "en": "Paint.NET is a **powerful yet easy-to-use image and photo editing program** developed exclusively for **Windows operating systems**. Originally started as an open-source project at Washington State University and intended as a replacement for Microsoft Paint, it has evolved into a robust application with many advanced features typically found in more expensive software. Key features include **layers**, an **unlimited undo/redo history**, **special effects**, and a wide range of **useful and powerful tools** for selection, retouching, and drawing. It also supports **plugins** that significantly extend its functionality. Paint.NET is known for its **fast performance** and **intuitive user interface**, making it an excellent choice for amateur photographers, web designers, and anyone looking for a capable yet straightforward solution for image editing on Windows."
      },
      "shortDescription": {
        "de": "Ein kostenloses Bild- und Fotobearbeitungsprogramm für Windows, bekannt für seine Einfachheit und Leistung",
        "en": "A free image and photo editing software for Windows, known for its simplicity and performance"
      },
      "logo": "assets/img/utilities/paintnet/logo/paintnet.png",
      "screenshots": ["assets/img/utilities/paintnet/screenshots/paintnet_screenshot.png"],
      "links": {
        "website": "https://www.getpaint.net/",
        "download": "https://www.getpaint.net/download.html",
        "forums": "https://forums.getpaint.net/"
      },
      "personalUsage": false
    },
    {
      "id": "adobephotoshop",
      "name": "Adobe Photoshop",
      "developer": "Adobe Inc.",
      "category": "Image Editing Software",
      "platforms": ["windows", "macos", "ipados"],
      "releaseDate": "1990-02-19",
      "license": "Proprietär (Abonnement)",
      "pricing": ["Paid"],
      "description": {
        "de": "Adobe Photoshop ist die **weltweit führende und der Industriestandard für digitale Bildbearbeitung und Grafikdesign**. Es ist eine **umfassende und leistungsstarke Software**, die von Fotografen, Grafikdesignern, Webdesignern, Künstlern und vielen anderen Kreativprofis für eine breite Palette von Aufgaben verwendet wird. Photoshop bietet eine **riesige Auswahl an Werkzeugen und Funktionen** für Bildretusche, Bildkomposition, digitales Malen, Webdesign, 3D-Design, Animation und vieles mehr. Zu den Kernmerkmalen gehören: **Ebenen (Layers)** für nicht-destruktive Bearbeitung, **Masken**, **Auswahlwerkzeuge**, **Filter und Effekte**, fortgeschrittene **Farbkorrektur**, **Typografie** und die Integration von **KI-gestützten Funktionen** (Adobe Sensei) zur Automatisierung komplexer Aufgaben. Photoshop ist Teil der Adobe Creative Cloud und wird ständig weiterentwickelt und um neue Funktionen erweitert. Es ist die bevorzugte Wahl für alle, die höchste Qualität und Flexibilität in der professionellen Bildmanipulation benötigen.",
        "en": "Adobe Photoshop is the **world's leading and industry-standard software for digital image editing and graphic design**. It is a **comprehensive and powerful application** used by photographers, graphic designers, web designers, artists, and many other creative professionals for a wide range of tasks. Photoshop offers a **vast array of tools and features** for image retouching, image composition, digital painting, web design, 3D design, animation, and much more. Core features include: **layers** for non-destructive editing, **masks**, **selection tools**, **filters and effects**, advanced **color correction**, **typography**, and the integration of **AI-powered features** (Adobe Sensei) to automate complex tasks. Photoshop is part of the Adobe Creative Cloud and is continuously developed and expanded with new functionalities. It is the preferred choice for anyone requiring the highest quality and flexibility in professional image manipulation."
      },
      "shortDescription": {
        "de": "Der Industriestandard für professionelle Bildbearbeitung, Grafikdesign und digitale Kunst",
        "en": "The industry standard for professional image editing, graphic design, and digital art"
      },
      "logo": "assets/img/utilities/adobe_photoshop/logo/adobe_photoshop.png",
      "screenshots": ["assets/img/utilities/adobe_photoshop/screenshots/adobe_photoshop_screenshot.png"],
      "links": {
        "website": "https://www.adobe.com/de/products/photoshop.html",
        "download": "https://www.adobe.com/de/creativecloud/desktop-app.html",
        "documentation": "https://helpx.adobe.com/de/photoshop/user-guide.html"
      },
      "personalUsage": true
    },
    {
      "id": "davinciresolve",
      "name": "DaVinci Resolve",
      "developer": "Blackmagic Design",
      "category": "Video Editing Software",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2004-06-01",
      "license": "Freemium (kostenlose Version verfügbar)",
      "pricing": ["Freemium"],
      "description": {
        "de": "DaVinci Resolve ist eine **hochmoderne, professionelle Video-Postproduktionssoftware**, die von Blackmagic Design entwickelt wurde. Ursprünglich bekannt als das weltweit fortschrittlichste System für **Farbkorrektur**, hat es sich zu einer **umfassenden All-in-One-Lösung** entwickelt, die jetzt auch **professionellen Videoschnitt, Motion Graphics, visuelle Effekte (VFX) mit Fusion und Audio-Postproduktion mit Fairlight** integriert. Was DaVinci Resolve besonders attraktiv macht, ist seine **kostenlose Version ('DaVinci Resolve Free')**, die bereits einen extrem umfangreichen Funktionsumfang bietet, der für die meisten professionellen Projekte ausreicht. Die **Studio-Version ('DaVinci Resolve Studio')** bietet zusätzliche Funktionen wie neuronale Engine-Funktionen (KI), HDR-Scoping, Stereoskopisches 3D, mehr Videoformate und Multi-User-Kollaboration. Resolve ist bekannt für seine **herausragende Leistung**, seine **nicht-lineare Bearbeitungsumgebung** und die Möglichkeit, komplexe Workflows effizient zu handhaben. Es ist eine bevorzugte Wahl für Filmemacher, Cutter, Coloristen, VFX-Künstler und Sounddesigner, die eine leistungsstarke und vielseitige Software suchen.",
        "en": "DaVinci Resolve is a **state-of-the-art, professional video post-production software** developed by Blackmagic Design. Originally renowned as the world's most advanced system for **color correction**, it has evolved into a **comprehensive all-in-one solution** that now integrates **professional video editing, motion graphics, visual effects (VFX) with Fusion, and audio post-production with Fairlight**. What makes DaVinci Resolve particularly appealing is its **free version ('DaVinci Resolve Free')**, which already offers an extremely extensive feature set, sufficient for most professional projects. The **Studio version ('DaVinci Resolve Studio')** provides additional features like neural engine capabilities (AI), HDR scoping, stereoscopic 3D, more video formats, and multi-user collaboration. Resolve is known for its **outstanding performance**, its **non-linear editing environment**, and its ability to efficiently handle complex workflows. It is a preferred choice for filmmakers, editors, colorists, VFX artists, and sound designers seeking powerful and versatile software."
      },
      "shortDescription": {
        "de": "Eine professionelle, kostenlose Video-Schnittsoftware mit Farbkorrektur, Effekten und Audio-Postproduktion",
        "en": "A professional, free video editing software with color correction, effects, and audio post-production"
      },
      "logo": "assets/img/utilities/davinciresolve/logo/davinciresolve.png",
      "screenshots": ["assets/img/utilities/davinciresolve/screenshots/davinciresolve_screenshot.png"],
      "links": {
        "website": "https://www.blackmagicdesign.com/de/products/davinciresolve",
        "download": "https://www.blackmagicdesign.com/de/products/davinciresolve/get",
        "documentation": "https://www.blackmagicdesign.com/de/support/family/davinci-resolve-and-fusion"
      },
      "personalUsage": false
    },
    {
      "id": "adobepremierepro",
      "name": "Adobe Premiere Pro",
      "developer": "Adobe Inc.",
      "category": "Video Editing Software",
      "platforms": ["windows", "macos"],
      "releaseDate": "2003-08-21",
      "license": "Proprietär (Abonnement)",
      "pricing": ["Paid"],
      "description": {
        "de": "Adobe Premiere Pro ist die **branchenführende, professionelle Videobearbeitungssoftware** von Adobe, die von Filmemachern, YouTubern, Broadcast-Journalisten und Videoproduzenten weltweit eingesetzt wird. Es handelt sich um ein **nicht-lineares Videoschnittsystem (NLE)**, das die Bearbeitung von Video- und Audiodaten in nahezu jedem nativen Format ermöglicht, von 8K VR bis zum Smartphone-Footage. Premiere Pro ist bekannt für seine **umfassenden Werkzeuge** für Schnitt, Trimmen, Farbkorrektur, Audio-Mixing und die Integration von Spezialeffekten. Eine seiner größten Stärken ist die **nahtlose Integration** mit anderen Adobe Creative Cloud Anwendungen wie After Effects (für Motion Graphics und VFX), Audition (für Audiobearbeitung) und Photoshop (für Bildbearbeitung), was einen effizienten Workflow über verschiedene Disziplinen hinweg ermöglicht. Premiere Pro bietet auch **KI-gestützte Funktionen (Adobe Sensei)** zur Automatisierung und Beschleunigung von Aufgaben. Es ist eine bevorzugte Wahl für alle, die eine skalierbare, funktionsreiche und branchenübliche Lösung für ihre Videoproduktionsbedürfnisse suchen.",
        "en": "Adobe Premiere Pro is the **industry-leading professional video editing software** from Adobe, used by filmmakers, YouTubers, broadcast journalists, and video producers worldwide. It is a **non-linear editing system (NLE)** that allows editing of video and audio data in virtually any native format, from 8K VR to smartphone footage. Premiere Pro is known for its **comprehensive tools** for cutting, trimming, color correction, audio mixing, and the integration of special effects. One of its greatest strengths is its **seamless integration** with other Adobe Creative Cloud applications like After Effects (for motion graphics and VFX), Audition (for audio editing), and Photoshop (for image editing), enabling an efficient workflow across different disciplines. Premiere Pro also offers **AI-powered features (Adobe Sensei)** to automate and accelerate tasks. It is a preferred choice for anyone seeking a scalable, feature-rich, and industry-standard solution for their video production needs."
      },
      "shortDescription": {
        "de": "Die führende professionelle Software für Videobearbeitung und Videoschnitt",
        "en": "The leading professional software for video editing and video post-production"
      },
      "logo": "assets/img/utilities/adobe_premiere_pro/logo/adobe_premiere_pro.png",
      "screenshots": ["assets/img/utilities/adobe_premiere_pro/screenshots/adobe_premiere_pro_screenshot.png"],
      "links": {
        "website": "https://www.adobe.com/de/products/premiere.html",
        "download": "https://www.adobe.com/de/creativecloud/desktop-app.html",
        "documentation": "https://helpx.adobe.com/de/premiere-pro/user-guide.html"
      },
      "personalUsage": true
    },
    {
      "id": "kdenlive",
      "name": "Kdenlive",
      "developer": "Kdenlive Development Team (KDE Community)",
      "category": "Video Editing Software",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2002-09-01",
      "license": "GNU GPLv3",
      "pricing": ["Free"],
      "description": {
        "de": "Kdenlive ist eine **leistungsstarke, kostenlose und quelloffene nicht-lineare Videobearbeitungssoftware (NLE)**, die sich an semi-professionelle Anwender und Hobbyisten richtet. Ursprünglich für das KDE-Desktop-Umfeld unter Linux entwickelt, ist Kdenlive heute **plattformübergreifend** auf Windows, macOS und Linux verfügbar. Es basiert auf dem MLT Framework und bietet eine **intuitive und flexible Benutzeroberfläche**, die sich an die Bedürfnisse des Benutzers anpassen lässt. Zu den Kernfunktionen gehören: **Multi-Track-Bearbeitung** mit einer unbegrenzten Anzahl von Video- und Audiospuren, eine **Vielzahl von Effekten und Übergängen**, **Titel-Erstellung**, **Farbkorrektur-Tools**, Keyframing, und die Unterstützung einer breiten Palette von Video- und Audioformaten. Kdenlive ist bekannt für seine **Stabilität, die aktive Entwicklung durch die Community** und seine Fähigkeit, auch auf weniger leistungsstarken Systemen gut zu funktionieren. Es ist eine ausgezeichnete Wahl für YouTuber, Filmemacher und Content-Ersteller, die eine funktionsreiche und kostenlose Alternative zu kommerzieller Videoschnittsoftware suchen.",
        "en": "Kdenlive is a **powerful, free, and open-source non-linear video editing software (NLE)** aimed at semi-professional users and hobbyists. Originally developed for the KDE desktop environment on Linux, Kdenlive is now **cross-platform** available on Windows, macOS, and Linux. It is based on the MLT Framework and offers an **intuitive and flexible user interface** that can be customized to the user's needs. Key features include: **multi-track editing** with an unlimited number of video and audio tracks, a **wide variety of effects and transitions**, **title creation**, **color correction tools**, keyframing, and support for a broad range of video and audio formats. Kdenlive is known for its **stability, active community development**, and its ability to perform well even on less powerful systems. It is an excellent choice for YouTubers, filmmakers, and content creators looking for a feature-rich and free alternative to commercial video editing software."
      },
      "shortDescription": {
        "de": "Eine kostenlose und quelloffene nicht-lineare Videobearbeitungssoftware für Linux, Windows und macOS",
        "en": "A free and open-source non-linear video editing software for Linux, Windows, and macOS"
      },
      "logo": "assets/img/utilities/kdenlive/logo/kdenlive.png",
      "screenshots": ["assets/img/utilities/kdenlive/screenshots/kdenlive_screenshot.png"],
      "links": {
        "website": "https://kdenlive.org/de/",
        "download": "https://kdenlive.org/de/download/",
        "documentation": "https://userbase.kde.org/Kdenlive/Manual",
        "gitlab": "https://invent.kde.org/multimedia/kdenlive"
      },
      "personalUsage": false
    },
    {
      "id": "openshotvideoeditor",
      "name": "OpenShot Video Editor",
      "developer": "Jonathan Thomas (und OpenShot Studios, LLC)",
      "category": "Video Editing Software",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2008-08-01",
      "license": "GNU GPLv3",
      "pricing": ["Free"],
      "description": {
        "de": "OpenShot Video Editor ist ein **leistungsstarker, kostenloser und quelloffener nicht-linearer Video-Editor**, der für Benutzer aller Kenntnisstufen entwickelt wurde, von Anfängern bis zu fortgeschrittenen Filmemachern. Er ist **plattformübergreifend** auf Linux, Windows und macOS verfügbar. OpenShot zielt darauf ab, Videobearbeitung einfach und zugänglich zu machen, ohne dabei an Funktionen zu sparen. Die Software bietet eine **intuitive Benutzeroberfläche** und unterstützt eine Vielzahl von Video-, Audio- und Bildformaten. Zu den Hauptfunktionen gehören: **Multi-Track-Bearbeitung** mit unbegrenzten Spuren, **Keyframe-basierte Animationen**, eine breite Palette von **Videoeffekten und Übergängen**, **Titelvorlagen** (auch 3D-Titel), Zeitlupen- und Zeitraffer-Effekte, Audio-Mixing und Wellenform-Anzeige. OpenShot ist bekannt für seine **Benutzerfreundlichkeit** und wird kontinuierlich weiterentwickelt, um neue Funktionen hinzuzufügen und die Stabilität zu verbessern. Es ist eine ausgezeichnete Wahl für alle, die einen funktionsreichen, aber dennoch unkomplizierten Video-Editor suchen, ohne Kosten anfallen.",
        "en": "OpenShot Video Editor is a **powerful, free, and open-source non-linear video editor** designed for users of all skill levels, from beginners to advanced filmmakers. It is **cross-platform** available on Linux, Windows, and macOS. OpenShot aims to make video editing easy and accessible without compromising on features. The software offers an **intuitive user interface** and supports a wide variety of video, audio, and image formats. Key features include: **multi-track editing** with unlimited tracks, **keyframe-based animations**, a broad range of **video effects and transitions**, **title templates** (including 3D titles), slow-motion and time-lapse effects, audio mixing, and waveform display. OpenShot is known for its **user-friendliness** and is continuously developed to add new features and improve stability. It is an excellent choice for anyone looking for a feature-rich, yet straightforward video editor at no cost."
      },
      "shortDescription": {
        "de": "Ein kostenloser und quelloffener Video-Editor, der einfach zu bedienen ist und viele Funktionen bietet",
        "en": "A free and open-source video editor that is easy to use and offers many features"
      },
      "logo": "assets/img/utilities/openshot/logo/openshot.png",
      "screenshots": ["assets/img/utilities/openshot/screenshots/openshot_screenshot.png"],
      "links": {
        "website": "https://www.openshot.org/",
        "download": "https://www.openshot.org/download/",
        "documentation": "https://www.openshot.org/user-guide/",
        "github": "https://github.com/OpenShot/openshot-qt"
      },
      "personalUsage": false
    },
    {
      "id": "obsidian",
      "name": "Obsidian",
      "developer": "Dynalist Inc.",
      "category": "Documentation",
      "platforms": ["windows", "macos", "linux", "android", "ios"],
      "releaseDate": "2020-03-30",
      "license": "Proprietär (kostenlos für persönliche/Bildungszwecke, kostenpflichtige Add-ons)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Obsidian ist ein **innovatives Wissensmanagement- und Notizprogramm**, das sich durch seine einzigartige Herangehensweise an die Organisation und Verknüpfung von Informationen auszeichnet. Anstatt auf eine Cloud-Datenbank zu setzen, arbeitet Obsidian **direkt mit lokalen Markdown-Dateien** in einem von Ihnen gewählten Ordner, der als 'Vault' (Tresor) bezeichnet wird. Dies gibt Benutzern **volle Kontrolle über ihre Daten** und gewährleistet Langlebigkeit sowie Offline-Zugriff. Die Stärke von Obsidian liegt in der Fähigkeit, **Verbindungen zwischen Notizen (Links)** zu erstellen und diese visuell in einem **interaktiven Graphen** darzustellen. Dadurch können Benutzer komplexe Ideen und Wissensnetze aufbauen. Die Software ist **hochgradig anpassbar** durch Themes, CSS-Snippets und eine riesige Auswahl an **Community-Plugins**, die Funktionen von Task-Management bis hin zu wissenschaftlichen Notizen erweitern. Obsidian ist für **persönliche und Bildungszwecke kostenlos** nutzbar und bietet kostenpflichtige Dienste für Synchronisierung und Veröffentlichung (Obsidian Publish). Es ist ein unverzichtbares Werkzeug für Studenten, Forscher, Schriftsteller und alle, die ihre Gedanken, Ideen und Informationen in einem vernetzten System organisieren möchten.",
        "en": "Obsidian is an **innovative knowledge management and note-taking application** characterized by its unique approach to organizing and linking information. Instead of relying on a cloud database, Obsidian works **directly with local Markdown files** in a user-chosen folder called a 'vault'. This gives users **full control over their data** and ensures longevity and offline access. Obsidian's strength lies in its ability to create **connections between notes (links)** and visualize them in an **interactive graph view**. This allows users to build complex ideas and knowledge networks. The software is **highly customizable** through themes, CSS snippets, and a vast selection of **community plugins** that extend its functionality from task management to scientific note-taking. Obsidian is **free for personal and educational use** and offers paid services for synchronization and publishing (Obsidian Publish). It is an indispensable tool for students, researchers, writers, and anyone looking to organize their thoughts, ideas, and information in a networked system."
      },
      "shortDescription": {
        "de": "Ein leistungsstarkes Markdown-basiertes Wissensmanagement- und Notizprogramm, das auf lokalen Dateien basiert",
        "en": "A powerful Markdown-based knowledge management and note-taking application built on local files"
      },
      "logo": "assets/img/utilities/obsidian/logo/obsidian.png",
      "screenshots": ["assets/img/utilities/obsidian/screenshots/obsidian_screenshot.png"],
      "links": {
        "website": "https://obsidian.md/",
        "download": "https://obsidian.md/download",
        "documentation": "https://help.obsidian.md/Home",
        "forum": "https://forum.obsidian.md/"
      },
      "personalUsage": true
    },
    {
      "id": "wikijs",
      "name": "Wiki.js",
      "developer": "Requarks.io / Nicolas Charbonnier",
      "category": "Documentation",
      "platforms": ["web", "docker"],
      "releaseDate": "2018-02-01",
      "license": "AGPLv3",
      "pricing": ["Free"],
      "description": {
        "de": "Wiki.js ist eine **moderne, leistungsstarke und quelloffene Wiki-Software**, die auf **Node.js** und Markdown basiert. Sie wurde entwickelt, um das Erstellen, Verwalten und Zusammenarbeiten an Wissensdatenbanken so einfach und effizient wie möglich zu machen. Wiki.js ist extrem **vielseitig und anpassbar** und bietet eine breite Palette von Funktionen, die es von traditionellen Wikis abheben. Dazu gehören ein **visueller Editor** (WYSIWYG) und ein **Markdown-Editor**, umfassende **Medienverwaltung**, ein **leistungsstarkes Suchsystem**, flexible **Berechtigungs- und Authentifizierungsoptionen** (inkl. OAuth, SAML, LDAP), die Möglichkeit, Inhalte aus verschiedenen Quellen zu synchronisieren (z.B. Git, S3), und ein **intuitives Dashboard für die Verwaltung**. Es ist ideal für Unternehmen, Entwicklerteams, Bildungseinrichtungen und Communitys, die eine **zentrale Plattform für Dokumentation, Wissensaustausch oder interne Notizen** benötigen. Dank seiner modernen Architektur und der aktiven Entwicklung ist Wiki.js eine exzellente Wahl für zukunftssichere Wiki-Lösungen.",
        "en": "Wiki.js is a **modern, powerful, and open-source wiki software** built on **Node.js** and Markdown. It's designed to make creating, managing, and collaborating on knowledge bases as simple and efficient as possible. Wiki.js is extremely **versatile and customizable**, offering a wide range of features that set it apart from traditional wikis. These include a **visual editor** (WYSIWYG) and a **Markdown editor**, comprehensive **media management**, a **powerful search system**, flexible **permission and authentication options** (including OAuth, SAML, LDAP), the ability to sync content from various sources (e.g., Git, S3), and an **intuitive management dashboard**. It's ideal for businesses, development teams, educational institutions, and communities needing a **central platform for documentation, knowledge sharing, or internal notes**. Thanks to its modern architecture and active development, Wiki.js is an excellent choice for future-proof wiki solutions."
      },
      "shortDescription": {
        "de": "Eine leistungsstarke, quelloffene und moderne Wiki-Software, die auf Node.js basiert",
        "en": "A powerful, open-source, and modern wiki software built on Node.js"
      },
      "logo": "assets/img/utilities/wikijs/logo/wikijs.png",
      "screenshots": ["assets/img/utilities/wikijs/screenshots/wikijs_screenshot.png"],
      "links": {
        "website": "https://js.wiki/",
        "documentation": "https://docs.requarks.io/",
        "github": "https://github.com/Requarks/wiki",
        "demo": "https://docs.requarks.io/wiki-demo"
      },
      "personalUsage": false
    },
    {
      "id": "jetbrainswriterside",
      "name": "JetBrains Writerside",
      "developer": "JetBrains s.r.o.",
      "category": "Documentation",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2023-11-20",
      "license": "Proprietär (Abonnement)",
      "pricing": ["Paid"],
      "description": {
        "de": "JetBrains Writerside ist eine **spezialisierte integrierte Entwicklungsumgebung (IDE)**, die von JetBrains entwickelt wurde, um den gesamten Prozess der **technischen Dokumentation** zu optimieren. Es ist darauf ausgelegt, Autoren, Ingenieuren und Technologen eine leistungsstarke Umgebung für das **Verfassen, Verwalten und Veröffentlichen von Dokumentationen** zu bieten. Writerside unterstützt verschiedene Markup-Sprachen, darunter **Markdown, reStructuredText und DocBook**, und bietet eine **Vielzahl von Funktionen**, die über einen einfachen Texteditor hinausgehen. Dazu gehören: **intelligente Code-Vervollständigung**, **automatische Überprüfung auf Fehler und Inkonsistenzen**, **Vorschau in Echtzeit**, **Versionskontrollintegration** (Git), **Wiederverwendbarkeit von Inhalten**, und **mehrere Exportformate** (z.B. HTML, PDF, EPUB). Es ist Teil des JetBrains-Ökosystems und profitiert von dessen bewährten Stärken in Bezug auf Produktivität und Workflow-Optimierung. Writerside ist eine ideale Lösung für Teams und Einzelpersonen, die eine robuste, effiziente und kollaborative Umgebung für das Erstellen und Pflegen hochwertiger technischer Dokumentation benötigen.",
        "en": "JetBrains Writerside is a **specialized Integrated Development Environment (IDE)** developed by JetBrains to streamline the entire process of **technical documentation**. It is designed to provide authors, engineers, and technologists with a powerful environment for **authoring, managing, and publishing documentation**. Writerside supports various markup languages, including **Markdown, reStructuredText, and DocBook**, and offers a **wide range of features** that go beyond a simple text editor. These include: **intelligent code completion**, **automatic error and inconsistency checking**, **real-time preview**, **version control integration** (Git), **content reusability**, and **multiple export formats** (e.g., HTML, PDF, EPUB). It is part of the JetBrains ecosystem and benefits from its proven strengths in productivity and workflow optimization. Writerside is an ideal solution for teams and individuals who need a robust, efficient, and collaborative environment for creating and maintaining high-quality technical documentation."
      },
      "shortDescription": {
        "de": "Eine intelligente IDE von JetBrains für das Verfassen, Verwalten und Veröffentlichen von Dokumentationen",
        "en": "An intelligent IDE from JetBrains for authoring, managing, and publishing documentation"
      },
      "logo": "assets/img/utilities/writerside/logo/writerside.png",
      "screenshots": [],
      "links": {
        "website": "https://www.jetbrains.com/de-de/writerside/",
        "download": "https://www.jetbrains.com/de-de/writerside/download/",
        "documentation": "https://www.jetbrains.com/de-de/writerside/documentation/"
      },
      "personalUsage": false
    },
    {
      "id": "notion",
      "name": "Notion",
      "developer": "Notion Labs, Inc.",
      "category": "Documentation",
      "platforms": ["web", "windows", "macos", "android", "ios"],
      "releaseDate": "2016-03-01",
      "license": "Proprietär (Freemium)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Notion ist ein **vielseitiger All-in-One-Workspace**, der die Funktionen von Notiz-Apps, Aufgabenmanagern, Datenbanken, Wikis und Projektmanagement-Tools in einer einzigen, flexiblen Plattform vereint. Es ist bekannt für seinen **blockbasierten Editor**, der es Benutzern ermöglicht, Inhalte (Text, Bilder, To-Do-Listen, Tabellen, Datenbanken, Code-Blöcke und mehr) einfach zu erstellen und zu strukturieren. Notion ist extrem **anpassbar** und erlaubt es Teams und Einzelpersonen, ihre Arbeitsabläufe genau nach ihren Bedürfnissen zu gestalten. Ob für **persönliche Notizen, die Verwaltung von Projekten, das Erstellen von Wikis und Dokumentationen oder die Organisation von Teams** – Notion bietet eine zentrale Anlaufstelle. Die Plattform ist **plattformübergreifend** über Webbrowser, Desktop-Anwendungen (Windows, macOS) und mobile Apps (Android, iOS) zugänglich und unterstützt die **Zusammenarbeit in Echtzeit**. Notion hat sich schnell zu einem beliebten Werkzeug für Start-ups, Remote-Teams, Studenten und Freiberufler entwickelt, die eine flexible und leistungsstarke Lösung zur Steigerung der Produktivität suchen.",
        "en": "Notion is a **versatile all-in-one workspace** that combines the functionalities of note-taking apps, task managers, databases, wikis, and project management tools into a single, flexible platform. It is known for its **block-based editor**, which allows users to easily create and structure content (text, images, to-do lists, tables, databases, code blocks, and more). Notion is extremely **customizable**, enabling teams and individuals to tailor their workflows precisely to their needs. Whether for **personal notes, managing projects, building wikis and documentation, or organizing teams** – Notion provides a central hub. The platform is **cross-platform** accessible via web browsers, desktop applications (Windows, macOS), and mobile apps (Android, iOS), and supports **real-time collaboration**. Notion has quickly become a popular tool for startups, remote teams, students, and freelancers seeking a flexible and powerful solution to boost productivity."
      },
      "shortDescription": {
        "de": "Ein All-in-One-Workspace für Notizen, Aufgabenmanagement, Wissensmanagement und Projektmanagement",
        "en": "An all-in-one workspace for notes, tasks, knowledge management, and project management"
      },
      "logo": "assets/img/utilities/notion/logo/notion.png",
      "screenshots": ["assets/img/utilities/notion/screenshots/notion_screenshot.png"],
      "links": {
        "website": "https://www.notion.so/",
        "download": "https://www.notion.so/download",
        "documentation": "https://www.notion.so/help"
      },
      "personalUsage": true
    },
    {
      "id": "microsoftpowertoys",
      "name": "Microsoft PowerToys",
      "developer": "Microsoft (und Open-Source-Community)",
      "category": "System Utilities / Productivity Tools",
      "platforms": ["windows"],
      "releaseDate": "2019-09-08",
      "license": "MIT License",
      "pricing": ["Free"],
      "description": {
        "de": "Microsoft PowerToys ist eine **Sammlung von kostenlosen und quelloffenen Dienstprogrammen**, die von Microsoft entwickelt wurden, um **Windows-Benutzern die Produktivität zu steigern und die Anpassungsmöglichkeiten zu erweitern**. Inspiriert von den PowerToys-Sammlungen aus Windows 95 und Windows XP, bietet diese moderne Version eine Reihe von nützlichen Tools, die die standardmäßige Windows-Funktionalität ergänzen und verbessern. Zu den beliebtesten PowerToys gehören: **FancyZones** (ein Fenster-Manager zum Erstellen komplexer Layouts), **PowerRename** (ein Tool zur Massenumbenennung von Dateien), **Image Resizer** (zum schnellen Ändern der Bildgröße im Kontextmenü), **Keyboard Manager** (zum Neuzuordnen von Tasten und Tastenkombinationen), **Color Picker** (ein System-weiter Farbwähler), **Always On Top** (um Fenster immer im Vordergrund zu halten) und **PowerToys Run** (ein schneller Launcher, ähnlich Spotlight auf macOS). Die PowerToys werden **kontinuierlich von Microsoft und der Open-Source-Community weiterentwickelt** und erhalten regelmäßig neue Funktionen und Verbesserungen, was sie zu einem unverzichtbaren Werkzeug für Power-User unter Windows macht.",
        "en": "Microsoft PowerToys is a **collection of free and open-source utilities** developed by Microsoft to **boost productivity and extend customization options for Windows users**. Inspired by the PowerToys collections from Windows 95 and Windows XP, this modern version offers a suite of useful tools that complement and enhance standard Windows functionality. Popular PowerToys include: **FancyZones** (a window manager for creating complex layouts), **PowerRename** (a bulk file renaming tool), **Image Resizer** (for quickly resizing images from the context menu), **Keyboard Manager** (for remapping keys and shortcuts), **Color Picker** (a system-wide color picker), **Always On Top** (to keep windows always in the foreground), and **PowerToys Run** (a quick launcher, similar to Spotlight on macOS). PowerToys are **continuously developed by Microsoft and the open-source community**, regularly receiving new features and improvements, making them an indispensable tool for Windows power users."
      },
      "shortDescription": {
        "de": "Eine Sammlung von kostenlosen und quelloffenen Dienstprogrammen für Windows, um die Produktivität zu steigern",
        "en": "A collection of free and open-source utilities for Windows to boost productivity"
      },
      "logo": "assets/img/utilities/microsoft_powertoys/logo/microsoft_powertoys.png",
      "screenshots": ["assets/img/utilities/microsoft_powertoys/screenshots/microsoft_powertoys_screenshot.png"],
      "links": {
        "github": "https://github.com/microsoft/PowerToys",
        "download": "https://github.com/microsoft/PowerToys/releases",
        "documentation": "https://learn.microsoft.com/de-de/windows/powertoys/",
        "microsoft_store": "https://apps.microsoft.com/store/detail/microsoft-powertoys/9NCSPXPZCRWT"
      },
      "personalUsage": true
    },
    {
      "id": "googlechrome",
      "name": "Google Chrome",
      "developer": "Google LLC",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "linux", "android", "ios"],
      "releaseDate": "2008-09-02",
      "license": "Freeware (Proprietär, basiert auf Open Source Chromium)",
      "pricing": ["Free"],
      "description": {
        "de": "Google Chrome ist der **weltweit meistgenutzte Webbrowser**, entwickelt von Google. Er ist bekannt für seine **Geschwindigkeit, Einfachheit, Sicherheit und seine tiefgehende Integration mit Google-Diensten**. Basierend auf dem Open-Source-Projekt Chromium bietet Chrome eine **intuitive Benutzeroberfläche**, die das Surfen im Web effizient gestaltet. Zu seinen Hauptmerkmalen gehören: **schnelles Laden von Seiten**, eine **leistungsstarke Omnibox** (Kombination aus Adressleiste und Suchfeld), **Tabbed Browse**, ein **inkognito-Modus** für privates Surfen, **Synchronisierung von Lesezeichen und Einstellungen** über mehrere Geräte hinweg über das Google-Konto, und ein **umfangreicher Chrome Web Store** für Erweiterungen und Themes. Chrome legt großen Wert auf **Sicherheit**, indem es vor schädlichen Websites warnt und automatische Updates bereitstellt. Es ist eine bevorzugte Wahl für die meisten Internetnutzer, die eine schnelle, zuverlässige und funktionsreiche Browser-Erfahrung suchen, insbesondere wenn sie bereits intensiv das Google-Ökosystem nutzen.",
        "en": "Google Chrome is the **world's most widely used web browser**, developed by Google. It is known for its **speed, simplicity, security, and deep integration with Google services**. Based on the open-source Chromium project, Chrome offers an **intuitive user interface** that makes web Browse efficient. Its main features include: **fast page loading**, a **powerful Omnibox** (combination of address bar and search field), **tabbed Browse**, an **incognito mode** for private Browse, **synchronization of bookmarks and settings** across multiple devices via a Google account, and an **extensive Chrome Web Store** for extensions and themes. Chrome places a strong emphasis on **security** by warning against malicious websites and providing automatic updates. It is a preferred choice for most internet users seeking a fast, reliable, and feature-rich Browse experience, especially if they are already heavily using the Google ecosystem."
      },
      "shortDescription": {
        "de": "Ein schneller, sicherer und populärer Webbrowser, entwickelt von Google",
        "en": "A fast, secure, and popular web browser developed by Google"
      },
      "logo": "assets/img/utilities/google_chrome/logo/google_chrome.png",
      "screenshots": ["assets/img/utilities/google_chrome/screenshots/google_chrome_screenshot.png"],
      "links": {
        "website": "https://www.google.com/intl/de_de/chrome/",
        "download": "https://www.google.com/intl/de_de/chrome/",
        "chrome_web_store": "https://chromewebstore.google.com/"
      },
      "personalUsage": true
    },
    {
      "id": "zenbrowser",
      "name": "Zen Browser",
      "developer": "Zen Browser Inc.",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2023-09-07",
      "license": "Freeware",
      "pricing": ["Free"],
      "description": {
        "de": "Zen Browser ist ein **neuartiger Webbrowser**, der darauf abzielt, die digitale Ablenkung zu reduzieren und die **Konzentration sowie den Datenschutz** seiner Nutzer zu verbessern. Im Gegensatz zu traditionellen Browsern, die oft mit überflüssigen Funktionen und aufdringlichen Trackern überladen sind, bietet Zen Browser eine **minimale, aufgeräumte Benutzeroberfläche** und integrierte Tools, die speziell für eine konzentrierte Arbeitsweise entwickelt wurden. Zu den Kernfunktionen gehören ein **integrierter Werbe- und Tracker-Blocker**, ein **Fokusmodus** zur Ausblendung von Ablenkungen, ein **Notizbereich direkt im Browser**, ein **Lesezeichen-Manager mit Tags** und die Möglichkeit, **Tabs in Sessions zu organisieren**. Zen Browser legt großen Wert auf die **Privatsphäre** der Nutzer, indem er keine Nutzerdaten sammelt und eine sichere Browse-Umgebung schafft. Er ist ideal für Studenten, Schriftsteller, Entwickler und jeden, der sich in der digitalen Welt besser konzentrieren und seine Produktivität steigern möchte, ohne Kompromisse beim Datenschutz einzugehen.",
        "en": "Zen Browser is a **novel web browser** designed to reduce digital distractions and enhance user **focus and privacy**. Unlike traditional browsers, which are often cluttered with superfluous features and intrusive trackers, Zen Browser offers a **minimalist, clean user interface** and integrated tools specifically designed for focused work. Key features include a **built-in ad and tracker blocker**, a **focus mode** to hide distractions, an **in-browser notes area**, a **bookmark manager with tags**, and the ability to **organize tabs into sessions**. Zen Browser places a strong emphasis on user **privacy** by not collecting user data and by creating a secure Browse environment. It is ideal for students, writers, developers, and anyone looking to improve their concentration and productivity in the digital world without compromising on privacy."
      },
      "shortDescription": {
        "de": "Ein datenschutzorientierter Webbrowser mit integrierten Produktivitäts- und Konzentrationstools",
        "en": "A privacy-focused web browser with integrated productivity and focus tools"
      },
      "logo": "assets/img/utilities/zen_browser/logo/zen_browser.png",
      "screenshots": ["assets/img/utilities/zen_browser/screenshots/zen_browser_screenshot.png"],
      "links": {
        "website": "https://zen-browser.app/",
        "download": "https://zen-browser.app/download"
      },
      "personalUsage": true
    },
    {
      "id": "chromium",
      "name": "Chromium",
      "developer": "Google (und Open-Source-Community)",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "linux", "android"],
      "releaseDate": "2008-09-02",
      "license": "BSD-ähnliche Lizenzen (diverse)",
      "pricing": ["Free"],
      "description": {
        "de": "Chromium ist ein **Open-Source-Webbrowser-Projekt**, das von Google initiiert und von einer aktiven Community entwickelt wird. Es dient als **Grundlage für Google Chrome** und viele andere beliebte Webbrowser wie Microsoft Edge, Opera und Brave. Im Wesentlichen ist Chromium die quelloffene Codebasis, während Google Chrome eine proprietäre Version von Chromium ist, die zusätzliche Funktionen wie integrierte PDF-Betrachter, proprietäre Medien-Codecs, automatische Updates und die Integration mit Google-Diensten enthält. Chromium selbst konzentriert sich auf die Bereitstellung eines **schnellen, stabilen und sicheren Web-Browse-Erlebnisses** mit Unterstützung für aktuelle Webstandards. Es ist ideal für Entwickler, Sicherheitsexperten und Anwender, die eine **'reine' Browser-Erfahrung** ohne die zusätzlichen Google-Integrationen wünschen oder die die Entwicklung des Browsers verfolgen möchten. Da es kontinuierlich aktualisiert wird, ist es immer auf dem neuesten Stand der Webtechnologien. Der Download von Chromium erfordert oft den Zugriff auf Entwickler-Builds, da es nicht so stark beworben wird wie die Endbenutzerversionen wie Chrome.",
        "en": "Chromium is an **open-source web browser project** initiated by Google and developed by an active community. It serves as the **foundation for Google Chrome** and many other popular web browsers like Microsoft Edge, Opera, and Brave. Essentially, Chromium is the open-source codebase, while Google Chrome is a proprietary version of Chromium that includes additional features such as integrated PDF viewers, proprietary media codecs, automatic updates, and integration with Google services. Chromium itself focuses on providing a **fast, stable, and secure web Browse experience** with support for current web standards. It is ideal for developers, security professionals, and users who desire a **'pure' Browse experience** without the extra Google integrations or who want to follow the browser's development. As it is continuously updated, it always stays current with web technologies. Downloading Chromium often requires accessing developer builds, as it is not promoted as heavily as end-user versions like Chrome."
      },
      "shortDescription": {
        "de": "Das Open-Source-Projekt, das die Basis für Google Chrome und viele andere Webbrowser bildet",
        "en": "The open-source project that forms the basis for Google Chrome and many other web browsers"
      },
      "logo": "assets/img/utilities/chromium/logo/chromium.png",
      "screenshots": ["assets/img/utilities/chromium/screenshots/chromium_screenshot.png"],
      "links": {
        "website": "https://www.chromium.org/",
        "download": "https://www.chromium.org/getting-involved/download-chromium/",
        "documentation": "https://www.chromium.org/developers/how-tos/",
        "code_repository": "https://chromium.googlesource.com/chromium/src/"
      },
      "personalUsage": false
    },
    {
      "id": "mozillafirefox",
      "name": "Mozilla Firefox",
      "developer": "Mozilla Foundation",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "linux", "android", "ios"],
      "releaseDate": "2004-11-09",
      "license": "Mozilla Public License 2.0 (MPL 2.0)",
      "pricing": ["Free"],
      "description": {
        "de": "Mozilla Firefox ist ein **beliebter, freier und quelloffener Webbrowser**, der von der Mozilla Foundation entwickelt wird. Er ist bekannt für seinen **starken Fokus auf Datenschutz, Sicherheit und Anpassbarkeit**, was ihn zu einer bevorzugten Wahl für Nutzer macht, die Wert auf Kontrolle über ihre Online-Erfahrung legen. Firefox basiert auf der Gecko-Engine und bietet eine **schnelle und moderne Browse-Erfahrung** mit Funktionen wie: **Tabbed Browse**, ein **integrierter Pop-up-Blocker**, **intelligente Suchleiste**, **Lesezeichenverwaltung**, **Privater Modus mit Tracking-Schutz** und eine Vielzahl von **Erweiterungen und Themes** über den Mozilla Add-ons Store. Im Gegensatz zu Browsern, die auf Chromium basieren, verfolgt Firefox einen **unabhängigen Ansatz**, was zur Vielfalt im Webbrowser-Markt beiträgt. Er bietet außerdem fortschrittliche Entwicklerwerkzeuge und kontinuierliche Innovationen im Bereich der Webstandards. Firefox ist eine ausgezeichnete Wahl für alle, die einen leistungsstarken, sicheren und anpassbaren Browser suchen, der die Privatsphäre der Nutzer respektiert.",
        "en": "Mozilla Firefox is a **popular, free, and open-source web browser** developed by the Mozilla Foundation. It is known for its **strong focus on privacy, security, and customizability**, making it a preferred choice for users who value control over their online experience. Based on the Gecko engine, Firefox offers a **fast and modern Browse experience** with features such as: **tabbed Browse**, a **built-in pop-up blocker**, **smart search bar**, **bookmark management**, **Private Browse with Tracking Protection**, and a wide variety of **extensions and themes** via the Mozilla Add-ons Store. Unlike Chromium-based browsers, Firefox pursues an **independent approach**, contributing to diversity in the web browser market. It also offers advanced developer tools and continuous innovation in web standards. Firefox is an excellent choice for anyone looking for a powerful, secure, and customizable browser that respects user privacy."
      },
      "shortDescription": {
        "de": "Ein schneller, sicherer und datenschutzfreundlicher Open-Source-Webbrowser",
        "en": "A fast, secure, and privacy-friendly open-source web browser"
      },
      "logo": "assets/img/utilities/mozilla_firefox/logo/mozilla_firefox.png",
      "screenshots": ["assets/img/utilities/mozilla_firefox/screenshots/mozilla_firefox_screenshot.png"],
      "links": {
        "website": "https://www.mozilla.org/en-GB/firefox/new/",
        "download": "https://www.mozilla.org/en-GB/firefox/new/",
        "add_ons": "https://addons.mozilla.org/",
        "documentation": "https://support.mozilla.org/en-US/products/firefox"
      },
      "personalUsage": false
    },
    {
      "id": "opera",
      "name": "Opera",
      "developer": "Opera Software AS",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "linux", "android", "ios"],
      "releaseDate": "1995-12-01",
      "license": "Freeware (Proprietär, basiert auf Open Source Chromium)",
      "pricing": ["Free"],
      "description": {
        "de": "Opera ist ein **innovativer und funktionsreicher Webbrowser**, der sich durch seine einzigartigen integrierten Funktionen von anderen Browsern abhebt. Ursprünglich von Opera Software AS entwickelt und seit 2016 im Besitz eines chinesischen Konsortiums, konzentriert sich Opera auf **Geschwindigkeit, Sicherheit und ein verbessertes Benutzererlebnis**. Er basiert auf dem **Chromium-Engine**, bietet aber eine eigene, schlanke Benutzeroberfläche und eine Reihe von Alleinstellungsmerkmalen. Dazu gehören ein **kostenloses, integriertes VPN**, ein **eingebauter Werbe- und Tracker-Blocker**, ein **Batteriesparmodus** für Laptop-Nutzer und Funktionen zur Organisation von Tabs. In jüngster Zeit hat Opera auch **KI-Integrationen** wie einen direkten Zugriff auf ChatGPT und Aria (Operas eigene Browser-KI) implementiert. Für Gamer bietet der spezialisierte **Opera GX**-Browser zusätzliche Leistungs- und Anpassungsoptionen. Opera ist eine ausgezeichnete Wahl für Nutzer, die Wert auf Privatsphäre, Sicherheit und innovative Funktionen legen, ohne auf die Kompatibilität der Chromium-Engine verzichten zu wollen.",
        "en": "Opera is an **innovative and feature-rich web browser** that stands out from other browsers due to its unique integrated functionalities. Originally developed by Opera Software AS and owned by a Chinese consortium since 2016, Opera focuses on **speed, security, and an enhanced user experience**. It is based on the **Chromium engine** but offers its own sleek user interface and a range of unique selling points. These include a **free, built-in VPN**, a **built-in ad and tracker blocker**, a **battery saver mode** for laptop users, and features for tab organization. Recently, Opera has also implemented **AI integrations** such as direct access to ChatGPT and Aria (Opera's own browser AI). For gamers, the specialized **Opera GX** browser offers additional performance and customization options. Opera is an excellent choice for users who value privacy, security, and innovative features without wanting to sacrifice the compatibility of the Chromium engine."
      },
      "shortDescription": {
        "de": "Ein innovativer Webbrowser mit integriertem VPN, Ad-Blocker und KI-Funktionen",
        "en": "An innovative web browser with integrated VPN, ad blocker, and AI features"
      },
      "logo": "assets/img/utilities/opera/logo/opera.png",
      "screenshots": ["assets/img/utilities/opera/screenshots/opera_screenshot.png"],
      "links": {
        "website": "https://www.opera.com/de/browsers/opera",
        "download": "https://www.opera.com/de/download",
        "add_ons": "https://addons.opera.com/en/"
      },
      "personalUsage": false
    },
    {
      "id": "operagx",
      "name": "Opera GX",
      "developer": "Opera Software AS",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "android", "ios"],
      "releaseDate": "2019-06-11",
      "license": "Freeware (Proprietär, basiert auf Open Source Chromium)",
      "pricing": ["Free"],
      "description": {
        "de": "Opera GX ist der **weltweit erste und einzige Webbrowser, der speziell für Gamer entwickelt wurde**. Er basiert auf der bewährten **Chromium-Engine** und bietet alle Kernfunktionen des Standard-Opera-Browsers (wie das kostenlose VPN und den Werbeblocker), ergänzt diese aber um eine Reihe einzigartiger Features, die auf die Bedürfnisse von Gamern zugeschnitten sind. Zu den herausragenden Funktionen gehören der **CPU-, RAM- und Netzwerk-Limiter (GX Control)**, mit dem Nutzer die Ressourcen, die der Browser verbraucht, genau steuern können, um mehr Leistung für Spiele freizugeben. Weiterhin bietet Opera GX eine **integrierte GX Corner** mit aktuellen Gaming-News, Deals und einem Release-Kalender. Visuell ist er hochgradig **anpassbar** mit speziellen Themes, Soundeffekten und einer Integration von Twitch und Discord in der Seitenleiste. Er ist eine ideale Wahl für Gamer, die einen Browser suchen, der ihre Gaming-Performance nicht beeinträchtigt und gleichzeitig ein reichhaltiges, auf ihre Interessen zugeschnittenes Browse-Erlebnis bietet.",
        "en": "Opera GX is the **world's first and only web browser specifically designed for gamers**. It is built on the proven **Chromium engine** and offers all the core functionalities of the standard Opera browser (like the free VPN and ad blocker), but complements them with a range of unique features tailored to the needs of gamers. Key features include the **CPU, RAM, and Network Limiter (GX Control)**, which allows users to precisely control the resources consumed by the browser to free up more performance for games. Furthermore, Opera GX offers an **integrated GX Corner** with current gaming news, deals, and a release calendar. Visually, it is highly **customizable** with special themes, sound effects, and integration of Twitch and Discord in the sidebar. It is an ideal choice for gamers looking for a browser that doesn't compromise their gaming performance while providing a rich Browse experience tailored to their interests."
      },
      "shortDescription": {
        "de": "Ein Webbrowser speziell für Gamer mit integrierten Ressourcenbegrenzern, Gaming-News und Anpassungsoptionen",
        "en": "A web browser specifically for gamers with built-in resource limiters, gaming news, and customization options"
      },
      "logo": "assets/img/utilities/opera_gx/logo/opera_gx.png",
      "screenshots": ["assets/img/utilities/opera_gx/screenshots/opera_gx_screenshot.png"],
      "links": {
        "website": "https://www.opera.com/de/gx",
        "download": "https://www.opera.com/de/gx/download",
        "twitch_integration": "https://www.opera.com/de/features/twitch-integration"
      },
      "personalUsage": false
    },
    {
      "id": "brave",
      "name": "Brave",
      "developer": "Brave Software Inc.",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "linux", "android", "ios"],
      "releaseDate": "2016-01-20",
      "license": "Mozilla Public License 2.0 (Client), diverse für Chromium",
      "pricing": ["Free"],
      "description": {
        "de": "Brave ist ein **datenschutzorientierter Webbrowser**, der von Brendan Eich (dem Erfinder von JavaScript und Mitbegründer von Mozilla) entwickelt wurde. Er basiert auf der **Chromium-Engine**, unterscheidet sich aber grundlegend durch seinen starken Fokus auf **Privatsphäre, Sicherheit und Geschwindigkeit**. Brave blockiert standardmäßig **Werbung und Tracker von Drittanbietern**, was zu schnelleren Ladezeiten und einem reduzierten Datenverbrauch führt. Einzigartig an Brave ist das **Basic Attention Token (BAT)-Ökosystem**: Nutzer können wählen, ob sie datenschutzfreundliche Werbung (Brave Ads) sehen möchten und erhalten dafür BAT-Token, die sie an ihre Lieblings-Content-Ersteller spenden oder in Kryptowährungen umwandeln können. Der Browser integriert zudem eine **kryptographische Wallet**, IPFS-Unterstützung und eine Option für ein integriertes VPN. Brave ist eine ausgezeichnete Wahl für Nutzer, die eine **schnelle, sichere und private Browse-Erfahrung** wünschen und gleichzeitig am Konzept der 'attentionsbasierten' Ökonomie teilhaben möchten.",
        "en": "Brave is a **privacy-focused web browser** developed by Brendan Eich (creator of JavaScript and co-founder of Mozilla). It is based on the **Chromium engine** but fundamentally differentiates itself through its strong emphasis on **privacy, security, and speed**. Brave **blocks third-party ads and trackers by default**, leading to faster page load times and reduced data consumption. Unique to Brave is its **Basic Attention Token (BAT) ecosystem**: users can opt to view privacy-preserving ads (Brave Ads) and earn BAT tokens, which they can then tip to their favorite content creators or convert into cryptocurrencies. The browser also integrates a **cryptographic wallet**, IPFS support, and an option for a built-in VPN. Brave is an excellent choice for users who desire a **fast, secure, and private Browse experience** while also wanting to participate in the 'attention-based' economy concept."
      },
      "shortDescription": {
        "de": "Ein schneller, datenschutzorientierter Webbrowser mit integriertem Werbeblocker und Krypto-Wallet",
        "en": "A fast, privacy-focused web browser with an integrated ad blocker and crypto wallet"
      },
      "logo": "assets/img/utilities/brave/logo/brave.png",
      "screenshots": ["assets/img/utilities/brave/screenshots/brave_screenshot.png"],
      "links": {
        "website": "https://brave.com/",
        "download": "https://brave.com/download/",
        "documentation": "https://support.brave.com/",
        "github": "https://github.com/brave"
      },
      "personalUsage": false
    },
    {
      "id": "vivaldi",
      "name": "Vivaldi",
      "developer": "Vivaldi Technologies",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "linux", "android"],
      "releaseDate": "2016-04-06",
      "license": "Freeware (Proprietär, basiert auf Open Source Chromium)",
      "pricing": ["Free"],
      "description": {
        "de": "Vivaldi ist ein **innovativer und extrem anpassbarer Webbrowser**, der von Vivaldi Technologies entwickelt wurde – einem Unternehmen, das von ehemaligen Opera-Mitarbeitern gegründet wurde. Er richtet sich speziell an **Power-User** und diejenigen, die maximale Kontrolle über ihr Browse-Erlebnis wünschen. Obwohl Vivaldi auf der **Chromium-Engine** basiert, unterscheidet er sich stark von anderen Chromium-Browsern durch seine einzigartige Benutzeroberfläche und eine Fülle von integrierten Funktionen, die oft Erweiterungen in anderen Browsern erfordern würden. Zu den herausragenden Merkmalen gehören: **fortschrittliches Tab-Management** (z.B. Tab-Stapel, Tab-Tiling), eine **integrierte Notizfunktion**, **Bildschirmaufnahmen**, ein **Mail-Client, Kalender und Feed-Reader** (in den Full-Versionen), **Mausgesten**, **Tastaturkurzbefehle** (Quick Commands), anpassbare Benutzeroberfläche (Themes, Adressleisten-Position, etc.) und ein **eingebauter Werbe- und Tracker-Blocker**. Vivaldi legt großen Wert auf **Datenschutz** und sammelt keine Nutzerdaten. Es ist die ideale Wahl für Nutzer, die eine personalisierte, effiziente und funktionsreiche Browser-Umgebung suchen, die sich flexibel an ihre individuellen Arbeitsabläufe anpassen lässt.",
        "en": "Vivaldi is an **innovative and extremely customizable web browser** developed by Vivaldi Technologies – a company founded by former Opera employees. It is specifically aimed at **power users** and those who desire maximum control over their Browse experience. Although Vivaldi is based on the **Chromium engine**, it differs greatly from other Chromium browsers through its unique user interface and a wealth of integrated features that would often require extensions in other browsers. Key features include: **advanced tab management** (e.g., tab stacks, tab tiling), a **built-in notes function**, **screen captures**, an **email client, calendar, and feed reader** (in full versions), **mouse gestures**, **keyboard shortcuts** (Quick Commands), customizable user interface (themes, address bar position, etc.), and a **built-in ad and tracker blocker**. Vivaldi places a strong emphasis on **privacy** and does not collect user data. It is the ideal choice for users seeking a personalized, efficient, and feature-rich Browse environment that can be flexibly adapted to their individual workflows."
      },
      "shortDescription": {
        "de": "Ein hochgradig anpassbarer Webbrowser, entwickelt für Power-User mit vielen integrierten Funktionen",
        "en": "A highly customizable web browser designed for power users with many integrated features"
      },
      "logo": "assets/img/utilities/vivaldi/logo/vivaldi.png",
      "screenshots": ["assets/img/utilities/vivaldi/screenshots/vivaldi_screenshot.png"],
      "links": {
        "website": "https://vivaldi.com/de/desktop/",
        "download": "https://vivaldi.com/de/download/",
        "forum": "https://forum.vivaldi.net/",
        "blog": "https://vivaldi.com/blog/"
      },
      "personalUsage": false
    },
    {
      "id": "microsoftedge",
      "name": "Microsoft Edge",
      "developer": "Microsoft Corporation",
      "category": "Web Browser",
      "platforms": ["windows", "macos", "linux", "android", "ios"],
      "releaseDate": "2015-07-29 (original EdgeHTML), 2020-01-15 (Chromium-based)",
      "license": "Proprietär (Freeware, basiert auf Open Source Chromium)",
      "pricing": ["Free"],
      "description": {
        "de": "Microsoft Edge ist der **Webbrowser von Microsoft**, der in Windows integriert ist und auch für andere Plattformen verfügbar ist. Ursprünglich mit der EdgeHTML-Engine gestartet, wurde er 2020 auf die **Chromium-Engine** umgestellt, wodurch er eine deutlich verbesserte Kompatibilität und Leistung erlangte. Edge ist bekannt für seine **Geschwindigkeit, Sicherheit und seine nahtlose Integration mit dem Microsoft-Ökosystem**. Er bietet eine Reihe von einzigartigen Funktionen, die ihn von anderen Chromium-Browsern abheben. Dazu gehören: ein **integrierter Tracking-Schutz**, der **Collection-Modus** zum Sammeln und Organisieren von Webinhalten, ein **vertikales Tab-Layout**, ein **Lese-Modus** zur Reduzierung von Ablenkungen, ein **integrierter 'Shopping'-Assistent** und die **Integration von KI-Funktionen (Copilot)** direkt in die Seitenleiste für die Suche und Zusammenfassungen. Edge ist eine ausgezeichnete Wahl für Windows-Nutzer, die eine schnelle, sichere und funktionsreiche Browser-Erfahrung suchen, die eng mit ihren anderen Microsoft-Diensten (wie Microsoft 365) verbunden ist.",
        "en": "Microsoft Edge is the **web browser from Microsoft**, integrated into Windows and also available for other platforms. Originally launched with the EdgeHTML engine, it was transitioned to the **Chromium engine** in 2020, significantly improving its compatibility and performance. Edge is known for its **speed, security, and seamless integration with the Microsoft ecosystem**. It offers a range of unique features that set it apart from other Chromium browsers. These include: **built-in tracking prevention**, the **Collections feature** for gathering and organizing web content, a **vertical tabs layout**, a **reading mode** to reduce distractions, a **built-in shopping assistant**, and **integration of AI features (Copilot)** directly into the sidebar for search and summarization. Edge is an excellent choice for Windows users seeking a fast, secure, and feature-rich Browse experience that is closely linked to their other Microsoft services (like Microsoft 365)."
      },
      "shortDescription": {
        "de": "Ein schneller und sicherer Webbrowser von Microsoft, basierend auf Chromium",
        "en": "A fast and secure web browser from Microsoft, based on Chromium"
      },
      "logo": "assets/img/utilities/microsoft_edge/logo/microsoft_edge.png",
      "screenshots": ["assets/img/utilities/microsoft_edge/screenshots/microsoft_edge_screenshot.png"],
      "links": {
        "website": "https://www.microsoft.com/de-de/edge/download?form=MA13FJ",
        "download": "https://www.microsoft.com/de-de/edge/download?form=MA13FJ",
        "documentation": "https://support.microsoft.com/de-de/microsoft-edge",
        "microsoft_store": "https://apps.microsoft.com/store/detail/microsoft-edge/9MSPC6MP9CWC"
      },
      "personalUsage": false
    },
    {
      "id": "flameshot",
      "name": "Flameshot",
      "developer": "Mehdi Hossein",
      "category": "Screenshot Tool",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2018-05-18",
      "license": "GNU GPLv3",
      "pricing": ["Free"],
      "description": {
        "de": "Flameshot ist ein **umfassendes und sehr beliebtes Open-Source-Tool für Bildschirmfotos und Anmerkungen**, das für Linux, Windows und macOS verfügbar ist. Es geht weit über die grundlegende Funktionalität herkömmlicher Screenshot-Tools hinaus, indem es eine **Vielzahl von Bearbeitungs- und Anpassungsoptionen direkt nach der Aufnahme** bietet. Sobald Sie einen Bereich auf dem Bildschirm ausgewählt haben, erscheint eine intuitive Leiste mit Werkzeugen. Zu den Hauptfunktionen gehören: **Zeichnen mit verschiedenen Formen (Linien, Pfeile, Rechtecke, Kreise), Hinzufügen von Text, Hervorheben, Weichzeichnen bestimmter Bereiche, Nummerierungsmarker, und das Spiegeln von Bildern**. Flameshot ermöglicht es Ihnen auch, den Screenshot direkt in die Zwischenablage zu kopieren, auf Imgur hochzuladen, als Datei zu speichern oder in einer externen Anwendung zu öffnen. Es ist bekannt für seine **Benutzerfreundlichkeit und seine Flexibilität**, was es zu einem unverzichtbaren Werkzeug für Entwickler, Designer, Content-Ersteller und jeden macht, der regelmäßig Screenshots mit Anmerkungen versehen muss.",
        "en": "Flameshot is a **comprehensive and very popular open-source screenshot and annotation tool** available for Linux, Windows, and macOS. It goes far beyond the basic functionality of traditional screenshot tools by offering a **wide range of editing and customization options directly after capture**. Once you select an area on the screen, an intuitive bar with tools appears. Key features include: **drawing with various shapes (lines, arrows, rectangles, circles), adding text, highlighting, blurring specific areas, numbering markers, and mirroring images**. Flameshot also allows you to directly copy the screenshot to the clipboard, upload it to Imgur, save it as a file, or open it in an external application. It is known for its **user-friendliness and flexibility**, making it an indispensable tool for developers, designers, content creators, and anyone who regularly needs to annotate screenshots."
      },
      "shortDescription": {
        "de": "Ein leistungsstarkes, kostenloses und quelloffenes Tool für Screenshots und Anmerkungen",
        "en": "A powerful, free, and open-source screenshot and annotation tool"
      },
      "logo": "assets/img/utilities/flameshot/logo/flameshot.png",
      "screenshots": ["assets/img/utilities/flameshot/screenshots/flameshot_screenshot.png"],
      "links": {
        "website": "https://flameshot.org/",
        "download": "https://flameshot.org/docs/guide/install/",
        "github": "https://github.com/flameshot-org/flameshot",
        "documentation": "https://flameshot.org/docs/guide/usage/"
      },
      "personalUsage": false
    },
    {
      "id": "greenshot",
      "name": "Greenshot",
      "developer": "Greenshot Team",
      "category": "Screenshot Tool",
      "platforms": ["windows", "macos"],
      "releaseDate": "2007-06-01",
      "license": "GNU GPLv3 (Windows), Proprietär (macOS)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Greenshot ist ein **leichtgewichtiges und dennoch leistungsstarkes Screenshot-Tool**, das für **Produktivität und Effizienz** entwickelt wurde. Es ist **kostenlos und quelloffen für Windows** und über den Mac App Store auch für macOS verfügbar (dort aber kostenpflichtig). Greenshot zeichnet sich durch seine **schnelle und einfache Bedienung** aus, mit der Benutzer schnell Bildschirmfotos von einem ausgewählten Bereich, einem Fenster oder dem gesamten Bildschirm erstellen können. Nach der Aufnahme bietet Greenshot eine **Vielzahl von Optionen**: den Screenshot direkt in die Zwischenablage kopieren, in einer Datei speichern, an einen Drucker senden, in eine Microsoft Office-Anwendung exportieren oder mit dem **integrierten Bildeditor** bearbeiten. Der Editor ermöglicht das **Hinzufügen von Anmerkungen wie Pfeilen, Linien, Text, Markierungen oder die Unkenntlichmachung von sensiblen Bereichen (Zensurfunktion)**. Es ist ein unverzichtbares Werkzeug für Softwaretester, Entwickler, Autoren technischer Dokumentationen und jeden, der regelmäßig Screenshots für Erklärungen oder zur Fehlerberichterstattung benötigt.",
        "en": "Greenshot is a **lightweight yet powerful screenshot tool** designed for **productivity and efficiency**. It is **free and open-source for Windows** and also available for macOS via the Mac App Store (as a paid app there). Greenshot stands out for its **fast and easy operation**, allowing users to quickly capture screenshots of a selected region, a window, or the entire screen. After capture, Greenshot offers a **variety of options**: copy the screenshot directly to the clipboard, save it to a file, send it to a printer, export it to a Microsoft Office application, or edit it with the **built-in image editor**. The editor enables **adding annotations such as arrows, lines, text, highlights, or obscuring sensitive areas (obfuscation)**. It is an indispensable tool for software testers, developers, technical writers, and anyone who regularly needs to annotate screenshots for explanations or bug reporting."
      },
      "shortDescription": {
        "de": "Ein leichtgewichtiges, kostenloses Open-Source-Screenshot-Tool mit Bearbeitungs- und Anmerkungsfunktionen für Windows und macOS",
        "en": "A lightweight, free, and open-source screenshot tool with editing and annotation features for Windows and macOS"
      },
      "logo": "assets/img/utilities/greenshot/logo/greenshot.png",
      "screenshots": ["assets/img/utilities/greenshot/screenshots/greenshot_screenshot.png"],
      "links": {
        "website": "https://getgreenshot.org/",
        "download": "https://getgreenshot.org/downloads/",
        "documentation": "https://getgreenshot.org/help/",
        "github": "https://github.com/greenshot/greenshot"
      },
      "personalUsage": false
    },
    {
      "id": "lightshot",
      "name": "Lightshot",
      "developer": "Skillbrains",
      "category": "Screenshot Tool",
      "platforms": ["windows", "macos", "web"],
      "releaseDate": "2010-09-01",
      "license": "Freeware",
      "pricing": ["Free"],
      "description": {
        "de": "Lightshot ist ein **beliebtes, schnelles und leichtgewichtiges Screenshot-Tool**, das für seine **einfache Bedienung und integrierte Upload-Funktionen** bekannt ist. Es ist für Windows, macOS und als Browser-Erweiterung für Chrome, Firefox, Edge und Opera verfügbar. Die Hauptstärke von Lightshot liegt in der **Geschwindigkeit**, mit der Benutzer einen Bereich des Bildschirms auswählen, mit einfachen Anmerkungen versehen und **sofort online hochladen** können, um einen teilbaren Link zu erhalten. Nach der Auswahl eines Screenshot-Bereichs können Nutzer direkt Linien, Pfeile, Text oder Markierungen hinzufügen oder Teile weichzeichnen. Neben dem Hochladen auf den eigenen Hosting-Dienst prntscr.com können Screenshots auch in die Zwischenablage kopiert, lokal gespeichert oder direkt in sozialen Medien geteilt werden. Lightshot ist ideal für schnelle Kommunikationsbedürfnisse, Fehlerberichte oder das einfache Teilen visueller Informationen.",
        "en": "Lightshot is a **popular, fast, and lightweight screenshot tool** known for its **ease of use and integrated upload capabilities**. It is available for Windows, macOS, and as a browser extension for Chrome, Firefox, Edge, and Opera. Lightshot's main strength lies in the **speed** with which users can select an area of the screen, add simple annotations, and **instantly upload it online** to get a shareable link. After selecting a screenshot area, users can directly add lines, arrows, text, or highlights, or blur parts. In addition to uploading to its own hosting service prntscr.com, screenshots can also be copied to the clipboard, saved locally, or shared directly on social media. Lightshot is ideal for quick communication needs, bug reports, or simply sharing visual information."
      },
      "shortDescription": {
        "de": "Ein schnelles und leichtgewichtiges Screenshot-Tool mit sofortigem Upload und einfacher Bearbeitung",
        "en": "A fast and lightweight screenshot tool with instant upload and simple editing"
      },
      "logo": "assets/img/utilities/lightshot/logo/lightshot.png",
      "screenshots": ["assets/img/utilities/lightshot/screenshots/lightshot_screenshot.png"],
      "links": {
        "website": "https://app.prntscr.com/en/",
        "download": "https://app.prntscr.com/en/download.html",
        "browser_extensions": "https://app.prntscr.com/en/download_extensions.html"
      },
      "personalUsage": false
    },
    {
      "id": "anydesk",
      "name": "AnyDesk",
      "developer": "AnyDesk Software GmbH",
      "category": "Remote Desktop Software",
      "platforms": ["windows", "macos", "linux", "android", "ios"],
      "releaseDate": "2012-07-01",
      "license": "Proprietär (Freemium)",
      "pricing": ["Freemium"],
      "description": {
        "de": "AnyDesk ist eine **beliebte und leistungsstarke Fernzugriffssoftware**, die es Benutzern ermöglicht, von jedem Ort der Welt aus auf Computer zuzugreifen, diese fernzusteuern und mit ihnen zu interagieren. Es ist bekannt für seine **hohe Geschwindigkeit (dank des DeskRT-Codecs), geringe Latenz und robuste Sicherheitsfunktionen**. AnyDesk ist **plattformübergreifend** auf einer Vielzahl von Betriebssystemen wie Windows, macOS, Linux, Android, iOS und sogar für Raspberry Pi verfügbar. Die Software wird häufig für technischen Support, Fernarbeit, Online-Zusammenarbeit und die Verwaltung unbeaufsichtigter Server eingesetzt. Zu den Kernfunktionen gehören: **Fernsteuerung von Desktops**, **Dateiübertragung**, **Sitzungsaufzeichnung**, **unbeaufsichtigter Zugriff** (mit Passwortschutz), **Wake-on-LAN**, und eine **intuitive Benutzeroberfläche**. AnyDesk bietet sowohl eine **kostenlose Version für den persönlichen Gebrauch** als auch verschiedene **kostenpflichtige Lizenzen** mit erweiterten Funktionen für Unternehmen und professionelle Anwender. Es ist eine zuverlässige Lösung für alle, die einen schnellen, sicheren und vielseitigen Fernzugriff benötigen.",
        "en": "AnyDesk is a **popular and powerful remote desktop software** that allows users to access, remotely control, and interact with computers from anywhere in the world. It is known for its **high speed (thanks to the DeskRT codec), low latency, and robust security features**. AnyDesk is **cross-platform** available on a wide range of operating systems including Windows, macOS, Linux, Android, iOS, and even for Raspberry Pi. The software is widely used for technical support, remote work, online collaboration, and managing unattended servers. Key features include: **remote desktop control**, **file transfer**, **session recording**, **unattended access** (with password protection), **Wake-on-LAN**, and an **intuitive user interface**. AnyDesk offers both a **free version for personal use** and various **paid licenses** with advanced features for businesses and professional users. It is a reliable solution for anyone requiring fast, secure, and versatile remote access."
      },
      "shortDescription": {
        "de": "Eine schnelle und sichere Software für Fernzugriff, Fernsteuerung und Online-Zusammenarbeit",
        "en": "A fast and secure software for remote access, remote control, and online collaboration"
      },
      "logo": "assets/img/utilities/anydesk/logo/anydesk.png",
      "screenshots": ["assets/img/utilities/anydesk/screenshots/anydesk_screenshot.png"],
      "links": {
        "website": "https://anydesk.com/de/",
        "download": "https://anydesk.com/de/downloads/",
        "support": "https://support.anydesk.com/startseite"
      },
      "personalUsage": true
    },
    {
      "id": "chatgpt",
      "name": "ChatGPT",
      "developer": "OpenAI",
      "category": "AI",
      "platforms": ["web", "ios", "android"],
      "releaseDate": "2022-11-30",
      "license": "Proprietär (Freemium)",
      "pricing": ["Freemium"],
      "description": {
        "de": "ChatGPT ist ein **leistungsstarker KI-gestützter Chatbot**, der von OpenAI entwickelt wurde und auf deren großen Sprachmodellen (LLMs) wie GPT-3.5 und GPT-4 basiert. Er ist darauf ausgelegt, menschenähnliche Konversationen zu führen und eine breite Palette von Textaufgaben zu erledigen. Seit seiner Veröffentlichung hat ChatGPT die Art und Weise revolutioniert, wie Menschen mit künstlicher Intelligenz interagieren. Zu den Hauptfunktionen gehören: **Beantwortung von Fragen**, **Erstellung von Texten** (Artikel, E-Mails, Gedichte, Code), **Zusammenfassung von Informationen**, **Übersetzung von Sprachen**, **Ideenfindung (Brainstorming)** und **Hilfe bei der Problemlösung**. ChatGPT kann den Kontext einer Konversation beibehalten und bietet daher ein dynamisches und interaktives Benutzererlebnis. Während eine **kostenlose Version** für den allgemeinen Gebrauch verfügbar ist (oft basierend auf GPT-3.5), bietet **ChatGPT Plus** (eine kostenpflichtige Abonnementversion) Zugang zu den fortschrittlicheren Modellen (z.B. GPT-4), schnelleren Antwortzeiten und exklusiven Funktionen. Es ist ein vielseitiges Werkzeug für Studenten, Berufstätige, Entwickler und Kreative, das die Produktivität steigern und den Zugang zu Informationen vereinfachen kann.",
        "en": "ChatGPT is a **powerful AI-powered chatbot** developed by OpenAI, based on their large language models (LLMs) like GPT-3.5 and GPT-4. It is designed to engage in human-like conversations and perform a wide range of text-based tasks. Since its release, ChatGPT has revolutionized how people interact with artificial intelligence. Key features include: **answering questions**, **generating text** (articles, emails, poems, code), **summarizing information**, **translating languages**, **brainstorming ideas**, and **assisting with problem-solving**. ChatGPT can maintain conversational context, providing a dynamic and interactive user experience. While a **free version** is available for general use (often based on GPT-3.5), **ChatGPT Plus** (a paid subscription version) offers access to more advanced models (e.g., GPT-4), faster response times, and exclusive features. It is a versatile tool for students, professionals, developers, and creatives that can boost productivity and simplify access to information."
      },
      "shortDescription": {
        "de": "Ein KI-gestützter Chatbot von OpenAI für Konversation, Texterstellung und Wissenszugriff",
        "en": "An AI-powered chatbot by OpenAI for conversation, content generation, and knowledge access"
      },
      "logo": "assets/img/utilities/chatgpt/logo/chatgpt.png",
      "screenshots": [],
      "links": {
        "website": "https://chatgpt.com/",
        "login": "https://chatgpt.com/auth/login",
        "developer_docs": "https://platform.openai.com/docs/overview"
      },
      "personalUsage": true
    },
    {
      "id": "googlegemini",
      "name": "Google Gemini",
      "developer": "Google",
      "category": "AI",
      "platforms": ["web", "android", "ios"],
      "releaseDate": "2023-12-06",
      "license": "Proprietär (Freemium)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Google Gemini ist eine **Familie fortschrittlicher multimodaler KI-Modelle**, die von Google entwickelt wurden, um eine Vielzahl von Aufgaben zu bewältigen, die über reine Textgenerierung hinausgehen. Gemini wurde von Grund auf als **multimodales Modell** konzipiert, was bedeutet, dass es nicht nur Text, sondern auch Bilder, Audio und Video verstehen, verarbeiten und generieren kann. Es ist in verschiedenen Größen (Ultra, Pro, Nano) verfügbar, um unterschiedliche Anwendungsfälle abzudecken, von komplexen Rechenzentrumsaufgaben bis hin zu On-Device-Anwendungen. Die Nutzung von Google Gemini erfolgt typischerweise über eine **Web-Oberfläche (gemini.google.com)**, aber auch über APIs für Entwickler und in die Google-Produkte integriert. Zu den Hauptfunktionen gehören: **komplexe Problemlösung**, **Code-Generierung und -Analyse**, **kreatives Schreiben** (Gedichte, Skripte, musikalische Stücke, E-Mails, Briefe usw.), **Informationszusammenfassungen**, **Ideenfindung** und die Fähigkeit, **Fragen zu beantworten und Inhalte basierend auf verschiedenen Eingabeformaten zu verstehen**. Google positioniert Gemini als eine vielseitige KI, die in der Lage ist, menschliche Denkweisen besser zu simulieren und komplexere Aufgaben zu bewältigen als frühere Modelle. Es wird kontinuierlich weiterentwickelt und ist ein zentraler Bestandteil von Googles KI-Strategie.",
        "en": "Google Gemini is a **family of advanced multimodal AI models** developed by Google to handle a variety of tasks beyond pure text generation. Gemini was designed from the ground up as a **multimodal model**, meaning it can understand, operate on, and combine different types of information, including text, images, audio, and video. It is available in various sizes (Ultra, Pro, Nano) to cover different use cases, from complex data center tasks to on-device applications. Google Gemini is typically accessed through a **web interface (gemini.google.com)**, but also via APIs for developers and integrated into Google products. Key features include: **complex problem-solving**, **code generation and analysis**, **creative writing** (poems, scripts, musical pieces, emails, letters, etc.), **information summarization**, **ideation (brainstorming)**, and the ability to **answer questions and understand content based on various input formats**. Google positions Gemini as a versatile AI capable of better simulating human thinking and handling more complex tasks than previous models. It is continuously being developed and is a central part of Google's AI strategy."
      },
      "shortDescription": {
        "de": "Eine Familie multimodaler KI-Modelle von Google für Konversation, kreative Inhalte und Problemlösung",
        "en": "A family of multimodal AI models by Google for conversation, creative content, and problem-solving"
      },
      "logo": "assets/img/utilities/google_gemini/logo/google_gemini.png",
      "screenshots": [],
      "links": {
        "website": "https://gemini.google.com/app",
        "ai_overview": "https://ai.google/gemini/",
        "developer_docs": "https://ai.google.dev/gemini-api/docs"
      },
      "personalUsage": true
    },
    {
      "id": "claude",
      "name": "Claude",
      "developer": "Anthropic",
      "category": "AI",
      "platforms": ["web"],
      "releaseDate": "2023-03-14 (öffentliche Vorstellung)",
      "license": "Proprietär (Freemium)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Claude ist ein **KI-gestützter Chatbot**, entwickelt von Anthropic, einem Unternehmen, das sich auf die Entwicklung von KI-Systemen konzentriert, die sicher, nützlich und 'harmlos' sind. Claude basiert auf Anthropic's **Large Language Models (LLMs)**, die mit einem besonderen Fokus auf **Ethik und Sicherheit (Constitutional AI)** trainiert wurden. Dies bedeutet, dass Claude darauf ausgelegt ist, hilfreich zu sein, aber gleichzeitig 'schädliche' oder voreingenommene Antworten zu vermeiden. Zu den Hauptfunktionen von Claude gehören: **Konversationsführung**, **Texterstellung** (Artikel, Berichte, kreative Inhalte), **Zusammenfassung langer Dokumente**, **Code-Generierung und -Analyse**, **Ideenfindung** und **komplexe Problemlösung**. Claude zeichnet sich durch seine Fähigkeit aus, auch sehr lange Kontexte zu verstehen und zu verarbeiten (großes Kontextfenster), was es ideal für die Arbeit mit umfangreichen Texten wie Büchern oder detaillierten Berichten macht. Es ist über eine **Web-Oberfläche (claude.ai)** und über APIs für Entwickler verfügbar. Claude ist eine ausgezeichnete Wahl für Nutzer, die einen leistungsstarken KI-Assistenten suchen, der Wert auf Sicherheit, Zuverlässigkeit und einen verantwortungsvollen Umgang mit KI legt.",
        "en": "Claude is an **AI-powered chatbot** developed by Anthropic, a company focused on building AI systems that are safe, helpful, and 'harmless'. Claude is based on Anthropic's **Large Language Models (LLMs)**, which have been trained with a particular emphasis on **ethics and safety (Constitutional AI)**. This means Claude is designed to be helpful while actively avoiding harmful or biased responses. Key features of Claude include: **engaging in conversations**, **generating text** (articles, reports, creative content), **summarizing long documents**, **code generation and analysis**, **brainstorming ideas**, and **complex problem-solving**. Claude is notable for its ability to understand and process very long contexts (large context window), making it ideal for working with extensive texts like books or detailed reports. It is available via a **web interface (claude.ai)** and through APIs for developers. Claude is an excellent choice for users seeking a powerful AI assistant that prioritizes safety, reliability, and responsible AI practices."
      },
      "shortDescription": {
        "de": "Ein KI-gestützter Chatbot von Anthropic, bekannt für seine Sicherheit, Nützlichkeit und Harmonie",
        "en": "An AI-powered chatbot by Anthropic, known for its safety, helpfulness, and harmlessness"
      },
      "logo": "assets/img/utilities/claude/logo/claude.png",
      "screenshots": [],
      "links": {
        "website": "https://claude.ai/",
        "login": "https://claude.ai/login",
        "developer_docs": "https://docs.anthropic.com/"
      },
      "personalUsage": true
    },
    {
      "id": "sunoai",
      "name": "Suno AI",
      "developer": "Suno, Inc.",
      "category": "AI",
      "platforms": ["web"],
      "releaseDate": "2023-12-20",
      "license": "Proprietär (Freemium)",
      "pricing": ["Freemium"],
      "description": {
        "de": "Suno ist eine **innovative KI-Plattform**, die es Benutzern ermöglicht, **komplette Songs zu generieren**, einschließlich Musik, Gesang und Liedtexten, allein basierend auf einer Textbeschreibung oder wenigen Anweisungen. Es demokratisiert die Musikproduktion, indem es jedem, unabhängig von musikalischen Kenntnissen, erlaubt, hochwertige Songs zu erstellen. Suno nutzt fortschrittliche generative KI-Modelle, um einzigartige Kompositionen zu schaffen, die verschiedene Genres und Stile umfassen können. Die Plattform bietet eine **intuitive Web-Oberfläche**, in der Benutzer einfach einen Prompt eingeben können (z.B. 'Ein optimistischer Pop-Song über das Finden von Liebe im Sommer' oder 'Ein trauriges Klavierstück im Stil von Debussy'). Suno generiert dann in kurzer Zeit einen kompletten Track. Zu den Kernfunktionen gehören die **Generierung von Liedtexten**, die **Auswahl von Stilen**, die **Erzeugung von Instrumentalstücken und Gesang**. Die Technologie hat das Potenzial, Musikern, Content-Erstellern und Hobbyisten neue Wege der Kreativität zu eröffnen und die Barrieren der traditionellen Musikproduktion zu senken. Es bietet eine **kostenlose Version mit täglichen Credits** und kostenpflichtige Pläne für erweiterte Nutzung und kommerzielle Rechte.",
        "en": "Suno is an **innovative AI platform** that allows users to **generate complete songs**, including music, vocals, and lyrics, based solely on a text description or a few prompts. It democratizes music production by enabling anyone, regardless of musical knowledge, to create high-quality songs. Suno leverages advanced generative AI models to create unique compositions that can span various genres and styles. The platform provides an **intuitive web interface** where users can simply enter a prompt (e.g., 'An upbeat pop song about finding love in summer' or 'A melancholic piano piece in the style of Debussy'). Suno then generates a complete track in a short amount of time. Key features include **lyric generation**, **style selection**, **instrumental, and vocal creation**. The technology has the potential to open up new avenues of creativity for musicians, content creators, and hobbyists, lowering the barriers of traditional music production. It offers a **free version with daily credits** and paid plans for extended use and commercial rights."
      },
      "shortDescription": {
        "de": "Eine KI-Plattform, die es ermöglicht, komplette Songs aus Textbeschreibungen zu generieren",
        "en": "An AI platform that allows generating complete songs from text descriptions"
      },
      "logo": "assets/img/utilities/suno/logo/suno.png",
      "screenshots": [],
      "links": {
        "website": "https://suno.com/",
        "login": "https://suno.com/login"
      },
      "personalUsage": true
    },
    {
      "id": "gamepadviewer",
      "name": "Gamepad Viewer",
      "developer": "Gamepad Viewer (unabhängiger Entwickler / Community-Projekt)",
      "category": "Streaming Tool",
      "platforms": ["web"],
      "releaseDate": "Unbekannt (seit ca. 2017 aktiv)",
      "license": "Kostenlos (Open Source-Bestandteile möglich)",
      "pricing": ["Free"],
      "description": {
        "de": "Gamepad Viewer ist ein **kostenloses und webbasiertes Tool**, das speziell für Streamer, Content-Ersteller und Gamer entwickelt wurde. Es ermöglicht die **Echtzeit-Visualisierung von Gamepad-Eingaben** direkt auf dem Bildschirm. Dies ist besonders nützlich, um Zuschauern oder Betrachtern von Gameplay-Videos zu zeigen, welche Tasten und Joysticks auf dem Controller gedrückt werden. Das Tool funktioniert durch die Erkennung eines angeschlossenen Gamepads über den Web-Standard Gamepad API und die Darstellung der Eingaben in einer **anpassbaren Grafik-Overlay**. Nutzer können aus einer **Vielzahl von Controller-Layouts und Skins** wählen, die Transparenz anpassen und die Größe sowie Position des Overlays festlegen. Dies macht Gamepad Viewer zu einer idealen Ergänzung für Streaming-Software wie OBS Studio oder XSplit, indem es eine zusätzliche Ebene der Interaktion und des Verständnisses für das Publikum schafft. Es ist ein wertvolles Werkzeug für Tutorials, Let's Plays oder einfach nur, um die eigenen Controller-Skills zu demonstrieren.",
        "en": "Gamepad Viewer is a **free and web-based tool** specifically designed for streamers, content creators, and gamers. It enables **real-time visualization of gamepad inputs** directly on screen. This is particularly useful for showing viewers or those watching gameplay videos which buttons and joysticks are being pressed on the controller. The tool works by detecting a connected gamepad via the Web Gamepad API standard and displaying the inputs in a **customizable graphic overlay**. Users can choose from a **variety of controller layouts and skins**, adjust transparency, and set the size and position of the overlay. This makes Gamepad Viewer an ideal complement to streaming software like OBS Studio or XSplit, by creating an additional layer of interaction and understanding for the audience. It is a valuable tool for tutorials, let's plays, or simply demonstrating one's controller skills."
      },
      "shortDescription": {
        "de": "Ein Online-Tool zur Visualisierung von Gamepad-Eingaben für Streaming und Videoaufnahmen",
        "en": "An online tool for visualizing gamepad inputs for streaming and video recording"
      },
      "logo": "assets/img/utilities/gamepad_viewer/logo/gamepad_viewer.png",
      "screenshots": ["assets/img/utilities/gamepad_viewer/screenshots/gamepad_viewer_screenshot.png"],
      "links": {
        "website": "https://gamepadviewer.com/",
        "generate": "https://beta.gamepadviewer.com/generate",
        "github": "https://github.com/syohex/gamepadviewer"
      },
      "personalUsage": true
    },
    {
      "id": "streamerbot",
      "name": "Streamer.bot",
      "developer": "Nate (mit Community-Beiträgen)",
      "category": "Streaming Tool",
      "platforms": ["windows"],
      "releaseDate": "Unbekannt (aktive Entwicklung seit 2020/2021)",
      "license": "Kostenlos (proprietär mit Open Source-Anteilen / Community-Projekt)",
      "pricing": ["Free"],
      "description": {
        "de": "Streamer.bot ist eine **revolutionäre und äußerst flexible Desktop-Anwendung**, die speziell für **Twitch-Streamer** entwickelt wurde, um ihren Stream zu automatisieren, zu erweitern und die Zuschauerinteraktion auf ein neues Niveau zu heben. Es ist eine **kostenlose und Open-Source-Alternative** zu vielen abonnementbasierten Bot-Diensten und bietet eine beispiellose Tiefe an Anpassungsmöglichkeiten. Im Kern ermöglicht Streamer.bot die Erstellung komplexer **Aktionen und Befehle**, die durch eine Vielzahl von Ereignissen (z.B. Chat-Nachrichten, Follows, Subs, Channel Points, Bit-Spenden, Raids) ausgelöst werden können. Es integriert sich nahtlos mit **OBS Studio**, was die Steuerung von Szenen, Quellen, Filtern und Overlays durch Chat-Befehle oder Zuschaueraktionen ermöglicht. Weitere Funktionen umfassen: **Sound-Wiedergabe**, **Texte-zu-Sprache (TTS)**, **Benutzerverwaltung**, **Countdown-Timer**, **API-Integrationen** (z.B. mit Spielen oder anderen Diensten) und eine **aktive Community** für Support und vorgefertigte Aktionen. Streamer.bot ist ein unverzichtbares Werkzeug für Streamer, die einen dynamischen, interaktiven und einzigartigen Stream erstellen möchten, ohne auf externe Dienste angewiesen zu sein.",
        "en": "Streamer.bot is a **revolutionary and highly flexible desktop application** specifically designed for **Twitch streamers** to automate, extend, and elevate viewer interaction in their streams. It serves as a **free and open-source alternative** to many subscription-based bot services, offering unparalleled depth of customization. At its core, Streamer.bot allows the creation of complex **actions and commands** that can be triggered by a wide array of events (e.g., chat messages, follows, subs, Channel Points, bit donations, raids). It integrates seamlessly with **OBS Studio**, enabling control of scenes, sources, filters, and overlays via chat commands or viewer actions. Further features include: **sound playback**, **text-to-speech (TTS)**, **user management**, **countdown timers**, **API integrations** (e.g., with games or other services), and an **active community** for support and pre-built actions. Streamer.bot is an indispensable tool for streamers looking to create a dynamic, interactive, and unique stream without relying on external services."
      },
      "shortDescription": {
        "de": "Eine leistungsstarke und hochgradig anpassbare Desktop-Anwendung für Twitch-Streamer zur Automatisierung und Interaktion",
        "en": "A powerful and highly customizable desktop application for Twitch streamers for automation and interaction"
      },
      "logo": "assets/img/utilities/streamer_bot/logo/streamer_bot.png",
      "screenshots": ["assets/img/utilities/streamer_bot/screenshots/streamer_bot_screenshot.png"],
      "links": {
        "website": "https://streamer.bot/",
        "download": "https://streamer.bot/download",
        "docs": "https://streamer.bot/docs/",
        "discord": "https://discord.gg/streamerbot",
        "github": "https://github.com/Streamer-Bot"
      },
      "personalUsage": true
    },
    {
      "id": "obsstudio",
      "name": "OBS Studio",
      "developer": "OBS Project",
      "category": "Streaming Tool",
      "platforms": ["windows", "macos", "linux"],
      "releaseDate": "2012-09-01 (erste Veröffentlichung)",
      "license": "GNU GPLv2",
      "pricing": ["Free"],
      "description": {
        "de": "OBS Studio (Open Broadcaster Software) ist die **führende kostenlose und quelloffene Software für Videoaufnahme und Live-Streaming**. Es ist ein unverzichtbares Werkzeug für Content-Ersteller, Gamer, Pädagogen und Unternehmen, die professionelle Broadcasts erstellen möchten. OBS Studio bietet eine **flexible und leistungsstarke Plattform** zum Mischen und Übertragen von Audio und Video in Echtzeit. Es ermöglicht Benutzern, **verschiedene Quellen** (Webcams, Bildschirme, Fenster, Bilder, Texte, Browser-Quellen, Video-Dateien usw.) zu kombinieren und **nahtlos zwischen Szenen zu wechseln**. Zu den Kernfunktionen gehören: **High-Performance-Echtzeit-Video-/Audioaufnahme und -Mischen**, **intuitive Audio-Mixer** mit Rauschunterdrückung und Gain-Kontrolle, **unbegrenzte Anzahl von Szenen** mit benutzerdefinierten Übergängen, **Hotkeys für nahezu jede Aktion**, ein **Studio-Modus** zur Vorschau von Szenen vor der Live-Schaltung, und **umfassende Konfigurationsoptionen für Streaming und Aufnahme**. OBS Studio unterstützt eine Vielzahl von Streaming-Diensten wie Twitch, YouTube, Facebook Live und bietet umfassende Einstellungsmöglichkeiten für Videoqualität, Encoder und Ausgabepfade. Dank seiner **aktiven Community und einer Fülle von Plugins** kann die Funktionalität von OBS Studio noch weiter erweitert werden, was es zu einem extrem vielseitigen und anpassbaren Tool macht.",
        "en": "OBS Studio (Open Broadcaster Software) is the **leading free and open-source software for video recording and live streaming**. It is an indispensable tool for content creators, gamers, educators, and businesses looking to produce professional broadcasts. OBS Studio provides a **flexible and powerful platform** for real-time audio and video mixing and broadcasting. It allows users to **combine various sources** (webcams, displays, windows, images, text, browser sources, video files, etc.) and **seamlessly switch between scenes**. Key features include: **high-performance real-time video/audio capture and mixing**, **intuitive audio mixer** with noise suppression and gain control, **unlimited number of scenes** with custom transitions, **hotkeys for virtually every action**, a **Studio Mode** to preview scenes before going live, and **comprehensive configuration options for streaming and recording**. OBS Studio supports a variety of streaming services such as Twitch, YouTube, Facebook Live, and offers extensive settings for video quality, encoders, and output paths. Thanks to its **active community and a wealth of plugins**, OBS Studio's functionality can be further extended, making it an extremely versatile and customizable tool."
      },
      "shortDescription": {
        "de": "Kostenlose und quelloffene Software für Videoaufnahme und Live-Streaming",
        "en": "Free and open-source software for video recording and live streaming"
      },
      "logo": "assets/img/utilities/obs_studio/logo/obs_studio.png",
      "screenshots": ["assets/img/utilities/obs_studio/screenshots/obs_studio_screenshot.png"],
      "links": {
        "website": "https://obsproject.com/de",
        "download": "https://obsproject.com/de/download",
        "docs": "https://obsproject.com/de/help",
        "github": "https://github.com/obsproject/obs-studio",
        "forum": "https://obsproject.com/forum/"
      },
      "personalUsage": true
    },
    {
      "id": "vocalremover",
      "name": "Vocal Remover",
      "developer": "Acappella-Extractor.com",
      "category": "AI",
      "platforms": ["web"],
      "releaseDate": "Unbekannt (Online seit ca. 2020)",
      "license": "Freeware (Online-Service)",
      "pricing": ["Free"],
      "description": {
        "de": "Vocal Remover ist ein **kostenloses und einfach zu bedienendes Online-Tool**, das künstliche Intelligenz nutzt, um **Gesang und Instrumentalspuren aus jeder Audiodatei zu isolieren oder zu entfernen**. Es ist eine äußerst nützliche Ressource für Musiker, DJs, Karaoke-Fans, Content-Ersteller und jeden, der Audiomaterial bearbeiten möchte, ohne komplexe Software installieren zu müssen. Die Funktionsweise ist denkbar einfach: Benutzer laden eine Audiodatei (MP3, WAV, FLAC und andere gängige Formate) hoch, und die KI-Algorithmen von Vocal Remover analysieren das Lied, um die Vocal- und Instrumentalspuren voneinander zu trennen. Das Ergebnis sind zwei separate Dateien, die heruntergeladen werden können – eine nur mit dem Gesang (A-Cappella) und eine nur mit der Instrumentierung (Karaoke-Version). Neben der Hauptfunktion der Stimmenentfernung bietet die Plattform oft auch **zusätzliche Tools** wie einen **Tonart-Changer, BPM-Detektor, Audio-Cutter, Joiner oder Recorder**. Vocal Remover ist ideal für die Erstellung von Karaoke-Versionen, Remixe, Sampling oder einfach nur, um eine Begleitmusik für Übungszwecke zu erhalten. Es ist ein Paradebeispiel dafür, wie zugänglich fortschrittliche KI-Technologie durch Webanwendungen gemacht werden kann.",
        "en": "Vocal Remover is a **free and easy-to-use online tool** that leverages artificial intelligence to **isolate or remove vocal and instrumental tracks from any audio file**. It's an incredibly useful resource for musicians, DJs, karaoke enthusiasts, content creators, and anyone looking to manipulate audio without needing to install complex software. Its operation is straightforward: users upload an audio file (MP3, WAV, FLAC, and other common formats), and Vocal Remover's AI algorithms analyze the song to separate the vocal and instrumental stems. The result is two separate files that can be downloaded—one with only the vocals (acapella) and one with only the instrumentation (karaoke version). In addition to the main vocal removal feature, the platform often provides **additional tools** such as a **key changer, BPM detector, audio cutter, joiner, or recorder**. Vocal Remover is ideal for creating karaoke versions, remixes, sampling, or simply obtaining backing tracks for practice. It's a prime example of how accessible advanced AI technology can be made through web applications."
      },
      "shortDescription": {
        "de": "Ein kostenloses Online-Tool zur Trennung von Gesang und Instrumentalspuren aus Audiodateien",
        "en": "A free online tool for separating vocal and instrumental tracks from audio files"
      },
      "logo": "assets/img/utilities/vocal_remover/logo/vocal_remover.png",
      "screenshots": ["assets/img/utilities/vocal_remover/screenshots/vocal_remover_screenshot.png"],
      "links": {
        "website": "https://vocalremover.org/",
        "tools_overview": "https://vocalremover.org/tools"
      },
      "personalUsage": true
    },
    {
      "id": "realtimecolors",
      "name": "Realtime Colors",
      "developer": "Max Schneider (Individual Developer)",
      "category": "Design Tool",
      "platforms": ["web"],
      "releaseDate": "2023-01-01 (geschätzt)",
      "license": "Freeware (Online-Service)",
      "pricing": ["Free"],
      "description": {
        "de": "Realtime Colors ist ein **innovatives und interaktives Online-Tool**, das Designern und Entwicklern hilft, **Farbpaletten in Echtzeit auf einer simulierten Benutzeroberfläche zu testen und zu visualisieren**. Es beseitigt das Rätselraten und den manuellen Aufwand beim Ausprobieren von Farbkombinationen, indem es eine dynamische Vorschau der ausgewählten Farben auf verschiedenen UI-Elementen (wie Text, Buttons, Hintergründe, Schatten) bietet. Nutzer können **primäre, sekundäre, Akzent- und Textfarben** anpassen und sofort sehen, wie diese auf einem Mockup einer Website oder Anwendung wirken. Das Tool bietet auch die Möglichkeit, **Farbkontraste** zu überprüfen, um die Barrierefreiheit zu gewährleisten, und generiert die entsprechenden **CSS-Variablen oder Tailwind CSS-Konfigurationen** für eine einfache Integration in Entwicklungsprojekte. Es ist ein **kostenloses, browserbasiertes Utility**, das den Workflow bei der Erstellung von Benutzeroberflächen erheblich beschleunigt und die Konsistenz und Ästhetik von Farbentscheidungen verbessert. Ideal für UI/UX-Designer, Webentwickler und alle, die mit Farbpaletten arbeiten.",
        "en": "Realtime Colors is an **innovative and interactive online tool** that helps designers and developers **test and visualize color palettes in real-time on a simulated user interface**. It eliminates the guesswork and manual effort of trying out color combinations by providing a dynamic preview of selected colors on various UI elements (such as text, buttons, backgrounds, shadows). Users can adjust **primary, secondary, accent, and text colors** and instantly see how they appear on a mockup of a website or application. The tool also offers the ability to check **color contrasts** to ensure accessibility and generates the corresponding **CSS variables or Tailwind CSS configurations** for easy integration into development projects. It is a **free, browser-based utility** that significantly speeds up the workflow for creating user interfaces and improves the consistency and aesthetics of color choices. Ideal for UI/UX designers, web developers, and anyone working with color palettes."
      },
      "shortDescription": {
        "de": "Ein Online-Tool zur Echtzeit-Visualisierung von Farbpaletten auf einer simulierten UI",
        "en": "An online tool for real-time visualization of color palettes on a simulated UI"
      },
      "logo": "assets/img/utilities/realtime_colors/logo/realtime_colors.png",
      "screenshots": [],
      "links": {
        "website": "https://www.realtimecolors.com/",
        "twitter": "https://twitter.com/realtime_colors",
        "github": "https://github.com/realtime-colors"
      },
      "personalUsage": true
    },
    {
      "id": "ngrok",
      "name": "ngrok",
      "developer": "ngrok, Inc.",
      "category": "Developer Tool",
      "platforms": ["Windows", "macOS", "Linux"],
      "releaseDate": "2013-01-01 (geschätzt)",
      "license": "Freemium",
      "pricing": ["Free", "Paid Plans"],
      "description": {
        "de": "ngrok ist ein **Tunneling- und Reverse-Proxy-Tool**, das Entwicklern ermöglicht, **lokale Server über sichere öffentliche URLs zugänglich zu machen**. Es wird häufig genutzt, um Webhooks, APIs oder lokale Webprojekte zu testen, ohne sie auf einen externen Server hochladen zu müssen. Nach der Installation kann ngrok per einfachem Befehl wie `ngrok http 80` gestartet werden und erstellt automatisch eine **HTTPS-URL**, die Anfragen an den lokalen Port weiterleitet. Entwickler können damit z. B. lokale Websites, Laravel- oder Node.js-Projekte, oder Webhooks von Diensten wie Stripe oder Slack testen. Die kostenlose Version erlaubt temporäre öffentliche Tunnels, während kostenpflichtige Pläne zusätzliche Funktionen wie **benutzerdefinierte Subdomains, reservierte Domains und erweiterte Sicherheitsoptionen** bieten.",
        "en": "ngrok is a **tunneling and reverse proxy tool** that allows developers to **expose local servers to the internet through secure public URLs**. It is widely used for testing webhooks, APIs, or local web projects without needing to deploy them to a live server. Once installed, ngrok can be launched with a simple command like `ngrok http 80`, automatically creating a **public HTTPS URL** that forwards traffic to a local port. Developers often use it to test local websites, Laravel or Node.js projects, or webhook integrations from services like Stripe or Slack. The free version provides temporary tunnels, while paid plans offer **custom subdomains, reserved domains, and advanced security features**."
      },
      "shortDescription": {
        "de": "Tool zur sicheren Freigabe lokaler Server über das Internet",
        "en": "Tool for securely exposing local servers to the internet"
      },
      "logo": "assets/img/utilities/ngrok/logo/ngrok.png",
      "screenshots": [],
      "links": {
        "website": "https://ngrok.com/",
        "documentation": "https://ngrok.com/docs",
        "github": "https://github.com/inconshreveable/ngrok"
      },
      "personalUsage": true
    },
    {
      "id": "caniuse",
      "name": "Can I use",
      "developer": "Alexis Deveria",
      "category": "Web Development Tool",
      "platforms": ["web"],
      "releaseDate": "2009-01-01",
      "license": "CC BY 4.0",
      "pricing": ["Free"],
      "description": {
        "de": "Can I use ist ein Online-Tool, das Webentwicklern hilft, die Browserunterstützung für Webstandards und Frontend-Technologien wie HTML, CSS, SVG und JavaScript-APIs zu überprüfen. Die Plattform bietet detaillierte Kompatibilitätsinformationen für verschiedene Browser und Versionen und wird regelmäßig mit aktuellen Daten aus Browser-Engines wie Chrome, Firefox, Safari und Edge aktualisiert. Durch die übersichtliche Darstellung in Tabellenform ermöglicht Can I use Entwicklern, fundierte Entscheidungen über den Einsatz bestimmter Webtechnologien zu treffen, um eine optimale Kompatibilität ihrer Projekte zu gewährleisten.",
        "en": "Can I use is an online tool that helps web developers check browser support for web standards and front-end technologies such as HTML, CSS, SVG, and JavaScript APIs. The platform provides detailed compatibility data for various browsers and versions and is regularly updated with the latest information from browser engines like Chrome, Firefox, Safari, and Edge. With its clear, tabular interface, Can I use enables developers to make informed decisions about using specific web technologies to ensure optimal compatibility across projects."
      },
      "shortDescription": {
        "de": "Tool zur Überprüfung der Browserkompatibilität von Webtechnologien",
        "en": "Tool for checking browser compatibility of web technologies"
      },
      "logo": "assets/img/utilities/caniuse/logo/caniuse.png",
      "screenshots": ["assets/img/utilities/caniuse/screenshots/caniuse_screenshot.png"],
      "links": {
        "website": "https://caniuse.com/",
        "github": "https://github.com/Fyrd/caniuse",
        "documentation": "https://caniuse.com/usage-table"
      },
      "personalUsage": true
    }
  ]
}
